{
  "mythologies": {
    "greek": {
      "name": "Greek & Roman Mythology",
      "description": "One of the most influential mythological systems in Western history, featuring the Olympian gods and their numerous offspring",
      "deities": [
        {
          "id": "zeus",
          "name": "Zeus / Jupiter",
          "type": "Olympian God",
          "domain": "Thunder, Sky, King of Gods",
          "dangerLevel": 95,
          "popularity": 90,
          "parents": [
            "Cronus",
            "Rhea"
          ],
          "children": [
            "Athena",
            "Apollo",
            "Artemis",
            "Ares",
            "Hephaestus",
            "Dionysus",
            "Hermes",
            "Aphrodite",
            "Heracles",
            "Perseus",
            "Helen of Troy",
            "The Dioscuri"
          ],
          "consort": "Hera",
          "symbols": "Thunderbolt, Eagle, Oak",
          "significance": "King of the Olympian gods and ruler of the sky. Zeus was the most powerful deity in Greek religion, representing law, justice, and divine authority. His worship was central to Greek civilization.",
          "impact": "Zeus profoundly influenced Greek culture through worship cults, athletic competitions like the Olympic Games, and myths establishing moral lessons. His authority provided a template for human kingship.",
          "alterEgos": "Swan (to seduce Leda), Bull (to abduct Europa), Eagle (divine form), Golden Shower (to reach Danaë), Serpent (to seduce Persephone), Mortal man (various human forms)",
          "relationships": "Wife: Hera (stormy marriage due to infidelities). Lovers: Leda, Europa, Danaë, Io, Semele, Metis. Children with multiple goddesses and mortals. Major rivalry with Ares. Strong mentoring with Athena and Apollo. Conflict with Prometheus.",
          "powers": "Thunderbolt projection, lightning summoning, weather control, shape-shifting, teleportation, superhuman strength, immortality, omniscience",
          "temples": "Temple of Zeus at Olympia (housed colossal gold-ivory statue), Zeus Xenios temples throughout Greece, temples in Athens, Thebes, Crete, Rome",
          "worshipers": "Nearly universal among Greeks and Romans - estimated tens of millions at peak",
          "history": "Worship from Mycenaean period (1600-1100 BCE), central to classical Greek religion (500-323 BCE), adopted by Romans as Jupiter"
        },
        {
          "id": "hera",
          "name": "Hera / Juno",
          "type": "Olympian Goddess",
          "domain": "Marriage, Women, Queen of Gods",
          "parents": [
            "Cronus",
            "Rhea"
          ],
          "children": [
            "Ares",
            "Hephaestus",
            "Hebe"
          ],
          "consort": "Zeus",
          "symbols": "Peacock, Pomegranate",
          "significance": "Queen of Olympian gods and goddess of marriage, family, and women. Represented the sacred bond of marriage and protection of women and children.",
          "impact": "Hera cults emphasized family values. Her jealousy narratives reflected real-world marriage complexities. Peacock symbolism became iconic in Mediterranean art.",
          "dangerLevel": 85,
          "alterEgos": "Iris (messenger form), Peacock (sacred animal manifestation), Protector of the Hearth (domestic form)",
          "relationships": "Husband: Zeus (stormy due to infidelities). Protective of young women and pregnant mothers. Bitter rivalries with Zeus's lovers and illegitimate children.",
          "powers": "Divine authority, curse casting, punishment of oath-breakers, control over marriage bonds, weather influence, shapeshifting",
          "temples": "Heraeum in Argos, Heraeum in Olympia, temples throughout Greece",
          "worshipers": "Estimated 10-15 million at peak, particularly women",
          "history": "Worship from Early Bronze Age, central to Greek religion, widely worshipped in Rome as Juno",
          "popularity": 70
        },
        {
          "id": "poseidon",
          "name": "Poseidon / Neptune",
          "type": "Olympian God",
          "domain": "Sea, Earthquakes, Horses",
          "parents": [
            "Cronus",
            "Rhea"
          ],
          "children": [
            "Triton",
            "Antaeus",
            "Proteus",
            "Polyphemus",
            "Theseus"
          ],
          "consort": "Amphitrite",
          "symbols": "Trident, Sea, Horse",
          "significance": "God of seas, earthquakes, and horses. One of twelve major Olympians with immense power over maritime civilization.",
          "impact": "Poseidon worship was vital for sailors, fishermen, and traders. Temples stood near harbors throughout Greece.",
          "dangerLevel": 85,
          "alterEgos": "Horse (to seduce Medusa and Demeter), Dolphin (to guide sailors), Stallion (equine form), Earthquake (destructive force)",
          "relationships": "Wife: Amphitrite. Lover of Medusa. Pursued Demeter (rejected). Complicated relationship with Athens. Punished Odysseus.",
          "powers": "Earthquake creation, tsunami generation, weather control, horse mastery, shapeshifting, trident magic",
          "temples": "Poseidon Temple in Sounion, temples in Corinth, Athens, Isthmia",
          "worshipers": "Estimated 8-12 million at peak, particularly sailors and fishermen",
          "history": "Worship from Mycenaean period, central to seafaring civilization",
          "popularity": 75
        },
        {
          "id": "hades",
          "name": "Hades / Pluto",
          "type": "Olympian God",
          "domain": "Underworld, Death, Riches",
          "parents": [
            "Cronus",
            "Rhea"
          ],
          "children": [
            "Persephone",
            "Zagreus"
          ],
          "consort": "Persephone",
          "symbols": "Helmet, Pomegranate, Gold",
          "significance": "God of the Underworld and the dead, ruling all souls who died. Despite his dark domain, Hades was not evil but impartial.",
          "impact": "Hades cults, particularly the Eleusinian Mysteries, offered secret knowledge about the afterlife.",
          "dangerLevel": 70,
          "alterEgos": "Pluto (wealth manifestation), Invisible King (helmet of invisibility), Judge of the Dead (judicial form)",
          "relationships": "Wife: Persephone (abducted but eventually loved). Brothers: Zeus and Poseidon. Close with Hermes.",
          "powers": "Death control, soul command, wealth manipulation, invisibility (helmet), immortality",
          "temples": "Temples at Hermione, Acheron, honored through Eleusinian Mysteries",
          "worshipers": "Estimated 5-8 million at peak, less widely worshipped due to fear",
          "history": "Worship from Mycenaean period, central to mystery religions",
          "popularity": 65
        },
        {
          "id": "demeter",
          "name": "Demeter / Ceres",
          "type": "Olympian Goddess",
          "domain": "Agriculture, Harvest, Earth",
          "parents": [
            "Cronus",
            "Rhea"
          ],
          "children": [
            "Persephone",
            "Plutus",
            "Iasion"
          ],
          "consort": null,
          "symbols": "Wheat, Torch, Poppy",
          "significance": "Goddess of agriculture, grain, and harvest. Represented fertility and humanity's dependence on agriculture.",
          "impact": "Demeter's myth explained seasonal cycles. Eleusinian Mysteries became most important Greek religious rite.",
          "dangerLevel": 60,
          "alterEgos": "Chloé (green sprout form), Wheat Goddess (grain manifestation), Mother of Abundance (fertility form)",
          "relationships": "Daughter: Persephone (devoted, abduction caused devastating famine). Sister: Hestia, Hera, Zeus.",
          "powers": "Crop growth and control, famine creation, fertility granting, seasonal cycle manipulation",
          "temples": "Eleusinian Sanctuary (most sacred), temples at Eleusis, Enna",
          "worshipers": "Estimated 10-15 million at peak, particularly farmers",
          "history": "Worship from Mycenaean period, central to agricultural society",
          "popularity": 70
        },
        {
          "id": "athena",
          "name": "Athena / Minerva",
          "type": "Olympian Goddess",
          "domain": "Wisdom, War, Crafts",
          "parents": [
            "Zeus"
          ],
          "children": [],
          "consort": null,
          "symbols": "Owl, Olive, Spear",
          "significance": "Goddess of wisdom, warfare strategy, and craft skills. Represented intellectual pursuits and practical arts.",
          "impact": "Athena's patronage of Athens made her central to Greek civilization's identity. The Parthenon honored her.",
          "dangerLevel": 70,
          "alterEgos": "Pallas (warrior form), Parthenos (maiden form), Craftswoman (artisan aspect)",
          "relationships": "Father: Zeus (born from his head). Mentor/Patron: Heracles, Perseus, Odysseus.",
          "powers": "Strategic warfare guidance, craft mastery, wisdom granting, weaving magic, owl communication",
          "temples": "Parthenon in Athens (most famous), Athena Nike temple, temples throughout Greece",
          "worshipers": "Estimated 12-18 million at peak, particularly in Athens",
          "history": "Worship from Mycenaean period, central to Athenian identity",
          "popularity": 85
        },
        {
          "id": "apollo",
          "name": "Apollo / Phoebus",
          "type": "Olympian God",
          "domain": "Sun, Music, Poetry, Prophecy",
          "parents": [
            "Zeus",
            "Leto"
          ],
          "children": [
            "Asclepius",
            "Orpheus",
            "Ion"
          ],
          "consort": null,
          "symbols": "Lyre, Arrow, Sun Disk",
          "significance": "God of sun, music, healing, prophecy, and poetry. Represented order, beauty, and rational thought.",
          "impact": "Apollo's Oracles at Delphi were most consulted prophecy sources in ancient world.",
          "dangerLevel": 85,
          "alterEgos": "Phoebus (sun chariot driver), Healer (medical form), The Oracle (prophetic aspect)",
          "relationships": "Mother: Leto. Twin Sister: Artemis (closest bond). Many lovers: Daphne, Coronis, Hyacinthus.",
          "powers": "Sun control and movement, prophecy granting, music inspiration, plague summoning, healing abilities",
          "temples": "Temple of Apollo at Delphi (most important), Temple in Corinth, temples at Delos",
          "worshipers": "Estimated 15-20 million at peak",
          "history": "Worship from Mycenaean period, Oracle at Delphi operated for 1000+ years",
          "popularity": 90
        },
        {
          "id": "artemis",
          "name": "Artemis / Diana",
          "type": "Olympian Goddess",
          "domain": "Hunt, Moon, Chastity",
          "parents": [
            "Zeus",
            "Leto"
          ],
          "children": [],
          "consort": null,
          "symbols": "Bow, Stag, Moon",
          "significance": "Goddess of hunt, moon, virginity, and young women. Represented independence and divine feminine autonomy.",
          "impact": "Artemis cults provided space for women outside patriarchal structures. Her identity as hunter challenged gender norms.",
          "dangerLevel": 70,
          "alterEgos": "Diana (Roman form), Hecate (triple goddess form), Huntress (predatory aspect)",
          "relationships": "Twin Brother: Apollo (closest bond). Father: Zeus. Mother: Leto.",
          "powers": "Hunting mastery, moon control, animal communication, forest control, childbirth protection",
          "temples": "Temple of Artemis at Ephesus (one of Seven Wonders), temples in Athens, Sparta",
          "worshipers": "Estimated 10-15 million at peak, particularly young women and hunters",
          "history": "Worship from Mycenaean period, Temple at Ephesus burned multiple times",
          "popularity": 80
        },
        {
          "id": "aphrodite",
          "name": "Aphrodite / Venus",
          "type": "Olympian Goddess",
          "domain": "Love, Beauty, Sexuality",
          "parents": [
            "Zeus",
            "Dione"
          ],
          "children": [
            "Eros",
            "Aeneas"
          ],
          "consort": null,
          "symbols": "Dove, Rose, Mirror",
          "significance": "Goddess of love, beauty, desire, and procreation. Represented power of attraction and sexuality.",
          "impact": "Aphrodite worship celebrated sexuality and beauty. Her myths explored love complexities.",
          "dangerLevel": 60,
          "alterEgos": "Venus (Roman form), Goddess of Procreation (fertility aspect), Seductress (desire form)",
          "relationships": "Husband: Hephaestus (arranged). Lover: Ares. Children: Eros, Aeneas.",
          "powers": "Love inducement, beauty enhancement, desire manipulation, fertility granting",
          "temples": "Sanctuary in Paphos (birthplace), temples in Corinth, Athens",
          "worshipers": "Estimated 12-16 million at peak",
          "history": "Worship from Bronze Age, central to Greek and Roman culture",
          "popularity": 85
        },
        {
          "id": "ares",
          "name": "Ares / Mars",
          "type": "Olympian God",
          "domain": "War, Violence, Chaos",
          "parents": [
            "Zeus",
            "Hera"
          ],
          "children": [],
          "consort": null,
          "symbols": "Spear, Blood, Fire",
          "significance": "God of war, violence, and bloodlust. Embodied brutal, chaotic aspects of warfare.",
          "impact": "Ares represented warfare's dark side Greeks tried to minimize. Mars received greater veneration in Rome.",
          "dangerLevel": 95,
          "alterEgos": "Mars (Roman form), Bloodlust personified (primal violent form), Plague-Bringer (disease form)",
          "relationships": "Parents: Zeus and Hera (strained). Lover: Aphrodite. Siblings: Hephaestus (opposed), Athena (rivalry).",
          "powers": "Bloodlust inducement, warfare frenzy granting, battle control, violence inspiration",
          "temples": "Temple of Ares in Athens, temples throughout Greece, Mars temples in Rome",
          "worshipers": "Estimated 5-8 million at peak, primarily warriors",
          "history": "Worship from Mycenaean period, less revered in Greece than Rome",
          "popularity": 60
        },
        {
          "id": "hephaestus",
          "name": "Hephaestus / Vulcan",
          "type": "Olympian God",
          "domain": "Forge, Fire, Craftsmanship",
          "parents": [
            "Zeus",
            "Hera"
          ],
          "children": [
            "Automata"
          ],
          "consort": null,
          "symbols": "Hammer, Anvil, Fire",
          "significance": "God of fire, metalwork, blacksmiths, and craftsmanship. Represented human ingenuity.",
          "impact": "Hephaestus inspired reverence for craftspeople. His myths elevated manual labor as divine.",
          "dangerLevel": 50,
          "alterEgos": "Craftsman Divine (artisan form), Fire Elemental (fire aspect), Master Engineer (inventor)",
          "relationships": "Wife: Aphrodite (unfaithful). Parents: Zeus and Hera (neglectful). Close with Athena.",
          "powers": "Forge mastery, automatic creation, fire control, metalworking magic, invention",
          "temples": "Hephaesteum in Athens, temples throughout Greece",
          "worshipers": "Estimated 3-5 million at peak, particularly blacksmiths",
          "history": "Worship from Mycenaean period",
          "popularity": 55
        },
        {
          "id": "hermes",
          "name": "Hermes / Mercury",
          "type": "Olympian God",
          "domain": "Commerce, Travel, Thieves",
          "parents": [
            "Zeus",
            "Maia"
          ],
          "children": [],
          "consort": null,
          "symbols": "Caduceus, Winged Sandals",
          "significance": "God of messengers, trade, travel, thieves, and boundaries. Represented communication and commerce.",
          "impact": "Hermes's association with commerce made him patron of merchants. His trickster nature provided mythological explanations.",
          "dangerLevel": 50,
          "alterEgos": "Mercury (Roman form), Psychopomp (soul guide), Trickster (clever deceiver)",
          "relationships": "Mother: Maia. Father: Zeus. Mentor: taught Heracles wrestling.",
          "powers": "Instant travel and teleportation, merchant luck granting, theft mastery, soul guide authority",
          "temples": "Herms (simple shrines), temples at Boundaries, throughout Greece",
          "worshipers": "Estimated 8-10 million at peak",
          "history": "Worship from Mycenaean period",
          "popularity": 75
        },
        {
          "id": "hestia",
          "name": "Hestia / Vesta",
          "type": "Olympian Goddess",
          "domain": "Hearth, Home, Family",
          "parents": [
            "Cronus",
            "Rhea"
          ],
          "children": [],
          "consort": null,
          "symbols": "Fire, Hearth",
          "significance": "Goddess of hearth, home, and family. Represented stability and sacred center of every home.",
          "impact": "Every Greek household maintained sacred hearth to Hestia, making her universally worshipped.",
          "dangerLevel": 30,
          "alterEgos": "Vesta (Roman form), Sacred Fire (elemental aspect), Home Guardian (protective)",
          "relationships": "Siblings: Zeus, Hera, Demeter, Poseidon, Hades.",
          "powers": "Home protection, hospitality enforcement, family harmony granting, fire tending",
          "temples": "Sacred hearths in every home, Vestal Temple in Rome",
          "worshipers": "Universal - estimated 15-20 million at peak",
          "history": "Worship from earliest tradition, central to household religion",
          "popularity": 40
        },
        {
          "id": "dionysus",
          "name": "Dionysus / Bacchus",
          "type": "Olympian God",
          "domain": "Wine, Festivity, Theatre",
          "parents": [
            "Zeus",
            "Semele"
          ],
          "children": [],
          "consort": null,
          "symbols": "Grape, Thyrsus, Ivy",
          "significance": "God of wine, festivity, theatre, and ecstatic experience. Represented liberation and celebration.",
          "impact": "Dionysian festivals shaped Greek cultural life. He was patron of theatre and drama.",
          "dangerLevel": 85,
          "alterEgos": "Bacchus (Roman form), Wine Embodied (liquid form), Theater Master (artistic form)",
          "relationships": "Mother: Semele (mortal). Father: Zeus. Stepmother: Hera. Romantic: married Ariadne.",
          "powers": "Madness induction, intoxication granting, ecstatic state creation, grape/wine creation",
          "temples": "Theater of Dionysus in Athens, temples at Delphi, throughout Greece",
          "worshipers": "Estimated 10-15 million at peak",
          "history": "Worship possibly from Thrace or Asia Minor, central to Greek culture",
          "popularity": 75
        },
        {
          "id": "persephone",
          "name": "Persephone / Proserpina",
          "type": "Olympian Goddess",
          "domain": "Spring, Underworld, Innocence",
          "parents": [
            "Demeter",
            "Zeus"
          ],
          "children": [],
          "consort": "Hades",
          "symbols": "Pomegranate, Grain, Torch",
          "significance": "Goddess of spring, underworld, and regeneration. Embodied seasonal cycles.",
          "impact": "Persephone's myth explained seasonal changes and provided solace to grieving.",
          "dangerLevel": 60,
          "alterEgos": "Proserpina (Roman form), Kore (maiden form), Queen of the Dead (underworld)",
          "relationships": "Mother: Demeter (intensely protective). Husband: Hades (grew to love).",
          "powers": "Vegetation control, seasonal manipulation, underworld rule, soul judgment",
          "temples": "Eleusinian Sanctuary, temples at Enna, throughout agricultural regions",
          "worshipers": "Estimated 8-12 million at peak",
          "history": "Worship from Mycenaean period, central to Eleusinian Mysteries",
          "popularity": 65
        },
        {
          "id": "heracles",
          "name": "Heracles / Hercules",
          "type": "Demigod/Hero",
          "domain": "Strength, Heroism, Labors",
          "parents": [
            "Zeus",
            "Alcmene"
          ],
          "children": [
            "Hyllus",
            "Iole"
          ],
          "consort": "Hebe",
          "symbols": "Lion Skin, Club",
          "significance": "Greatest hero of Greek mythology. Son of Zeus and mortal woman. Performed Twelve Labors. Deified after death.",
          "impact": "Heracles represented human strength and perseverance. His labors became moral templates. Most popular hero in Greek culture.",
          "dangerLevel": 85,
          "alterEgos": "Hercules (Roman form), Lion Slayer (after killing Nemean lion), Club-Bearer (weapon form)",
          "relationships": "Father: Zeus. Mother: Alcmene. Wife: Hebe (goddess of youth). Mentor: Athena, Theseus ally.",
          "powers": "Superhuman strength, invulnerability (mostly), lion-slaying, monster-slaying, shape-shifting",
          "temples": "Heracles temples throughout Greece, especially in Thebes, Rome",
          "worshipers": "Estimated 10-15 million at peak, especially warriors and athletes",
          "history": "Worship from Mycenaean period, deified after death, athletic competitions honored him",
          "popularity": 95
        },
        {
          "id": "perseus",
          "name": "Perseus",
          "type": "Demigod/Hero",
          "domain": "Heroism, Wisdom, Slaying",
          "parents": [
            "Zeus",
            "Danaë"
          ],
          "children": [
            "Perses",
            "Andromeda"
          ],
          "consort": "Andromeda",
          "symbols": "Adamantine Sickle, Medusa Head",
          "significance": "Famous hero who slayed Medusa. Son of Zeus. Founder of Mycenae. Rescued Andromeda.",
          "impact": "Perseus myth inspired countless works. His defeat of Medusa became iconic slaying story.",
          "dangerLevel": 70,
          "alterEgos": "Gorgon Slayer (after defeating Medusa), Shield-Bearer (using Medusa's head)",
          "relationships": "Father: Zeus. Mother: Danaë. Wife: Andromeda. Mentor: Athena, Hermes.",
          "powers": "Divine aid from gods, enhanced agility and strength, use of Medusa head (petrification power)",
          "temples": "Temples throughout Greece, especially in Mycenae and Athens",
          "worshipers": "Estimated 5-8 million at peak",
          "history": "Mythological hero, foundational to Greek cultural identity",
          "popularity": 80
        },
        {
          "id": "theseus",
          "name": "Theseus",
          "type": "Demigod/Hero",
          "domain": "Heroism, Labors, Kingship",
          "parents": [
            "Poseidon",
            "Aethra"
          ],
          "children": [
            "Hippolytus"
          ],
          "consort": "Phaedra",
          "symbols": "Sword, Labyrinth Thread",
          "significance": "Hero of Athens. Slayed Minotaur. Founded many cities. Son of Poseidon or Aegeus.",
          "impact": "Theseus became Athens's greatest hero. His labors rivaled Heracles. Symbol of Athenian power.",
          "dangerLevel": 70,
          "alterEgos": "Minotaur Slayer (after defeating the Minotaur), King of Athens (rulership)",
          "relationships": "Father: Poseidon or Aegeus. Mother: Aethra. Ally: Heracles. Wife: Phaedra.",
          "powers": "Enhanced strength and agility, labyrinth navigation, strategic thinking",
          "temples": "Theseum in Athens, temples throughout Greece",
          "worshipers": "Estimated 5-8 million at peak, especially in Athens",
          "history": "Foundational to Athenian identity and Greek heroic tradition",
          "popularity": 75
        },
        {
          "id": "asclepius",
          "name": "Asclepius",
          "type": "Demigod/God",
          "domain": "Medicine, Healing, Resurrection",
          "parents": [
            "Apollo",
            "Coronis"
          ],
          "children": [
            "Hygieia",
            "Panacea"
          ],
          "consort": null,
          "symbols": "Rod of Asclepius, Serpent",
          "significance": "God of medicine and healing. Son of Apollo. Raised by Chiron. Could resurrect the dead.",
          "impact": "Asclepius cults spread throughout Mediterranean. His rod became medical symbol worldwide.",
          "dangerLevel": 70,
          "alterEgos": "The Healer (medicinal form), Asclepion practitioner (at his healing temples)",
          "relationships": "Father: Apollo. Mother: Coronis. Teacher: Chiron (centaur). Daughter: Hygieia.",
          "powers": "Healing magic, resurrection, disease curing, medicine creation",
          "temples": "Asclepieia (healing temples) throughout Greece, especially at Epidaurus",
          "worshipers": "Estimated 8-12 million at peak, especially those seeking healing",
          "history": "Worship from classical period, healing temples became ancient hospitals",
          "popularity": 70
        }
      ],
      "founded": "c. 1200-800 BCE",
      "overview": "Ancient Greek pantheon featuring powerful deities like Zeus, Athena, and Apollo. Rich with myths of heroes, monsters, and cosmic conflicts. Foundation of Western literature and philosophy."
    },
    "norse": {
      "name": "Norse Mythology",
      "description": "Scandinavian mythology featuring the Aesir and Vanir gods, ending in Ragnarok",
      "deities": [
        {
          "id": "odin",
          "name": "Odin",
          "type": "Aesir God",
          "domain": "War, Wisdom, Magic, Death",
          "parents": [
            "Bor"
          ],
          "children": [
            "Thor",
            "Baldur",
            "Vidar",
            "Vali"
          ],
          "consort": "Frigg",
          "symbols": "Runes, Spear, Ravens",
          "significance": "All-Father and king of Aesir gods. God of wisdom, war, death, and magic. Willing to sacrifice anything for knowledge.",
          "impact": "Odin's pursuit of wisdom influenced Norse values. Valkyrie concept came from his domain.",
          "dangerLevel": 85,
          "alterEgos": "Wodan (Germanic form), One-Eyed Wanderer (disguised form), Raven-Rider (animal form)",
          "relationships": "Wife: Frigg. Sons: Thor, Baldur, Vidar, Vali. Allied with Loki despite betrayal. Mentor to warriors.",
          "powers": "Rune magic, prophecy, poetry inspiration, shapeshifting, war and death control",
          "temples": "Uppsala Temple (greatest Norse temple), temples throughout Scandinavia",
          "worshipers": "Estimated 5-10 million during Viking Age",
          "history": "Indo-European warrior deity, worship strong in Viking Age",
          "popularity": 90
        },
        {
          "id": "thor",
          "name": "Thor",
          "type": "Aesir God",
          "domain": "Thunder, Lightning, Strength",
          "parents": [
            "Odin",
            "Frigg"
          ],
          "children": [
            "Modi",
            "Magni"
          ],
          "consort": "Sif",
          "symbols": "Mjolnir, Lightning, Oak",
          "significance": "God of thunder and strength. Immensely popular as protector against chaos. His hammer Mjolnir most powerful weapon.",
          "impact": "Thor worship widespread among Norse. His hammer became iconic symbol.",
          "dangerLevel": 85,
          "alterEgos": "Thunder God (elemental form), Chariot-Rider (vehicle form), Red-Bearded Warrior",
          "relationships": "Father: Odin. Mother: Frigg. Wife: Sif. Children: Modi, Magni. Close ally: Loki.",
          "powers": "Thunder and lightning control, weather summoning, hammer mastery, superhuman strength",
          "temples": "Temples throughout Scandinavia, especially Sweden and Norway",
          "worshipers": "Estimated 6-12 million during Viking Age",
          "history": "Indo-European storm god, worship throughout Viking Age",
          "popularity": 95
        },
        {
          "id": "loki",
          "name": "Loki",
          "type": "Aesir/Giant God",
          "domain": "Trickery, Chaos, Fire",
          "parents": [],
          "children": [
            "Fenrir",
            "Jormungandr",
            "Hel"
          ],
          "consort": "Sigyn",
          "symbols": "Fire, Serpent, Chaos",
          "significance": "Trickster god whose actions lead to Ragnarok. Neither good nor evil, embodied unpredictability.",
          "impact": "Loki's stories explained natural disasters. Complex, unpredictable figure.",
          "dangerLevel": 95,
          "alterEgos": "Salmon (fish form), Seal (marine form), Fly (insect form), Mare (horse form)",
          "relationships": "Blood-brother: Odin. Friend/Rival: Thor. Wife: Sigyn. Children: Fenrir, Jormungandr, Hel.",
          "powers": "Shapeshifting, deception magic, chaos summoning, fire control",
          "temples": "No dedicated temples (feared), occasional small shrines",
          "worshipers": "Limited direct worship, estimated 1-2 million for propitiation",
          "history": "Ancient deity possibly pre-Norse origin, central to Norse mythology",
          "popularity": 85
        },
        {
          "id": "freyja",
          "name": "Freyja",
          "type": "Vanir Goddess",
          "domain": "Love, War, Fertility, Magic",
          "parents": [
            "Njord"
          ],
          "children": [
            "Hnoss",
            "Gersemi"
          ],
          "consort": "Od",
          "symbols": "Falcon, Gold, Cats",
          "significance": "Goddess of love, beauty, fertility, and war. Powerful and independent, claiming own share of slain in battle.",
          "impact": "Freyja cults celebrated female power. Her necklace Brisingamen became symbol of beauty.",
          "dangerLevel": 70,
          "alterEgos": "Vanadis (lady form), Falcon-Flyer (bird form), War-Chooser (valkyrie aspect)",
          "relationships": "Father: Njord. Brother: Freyr. Husband: Od. Children: Hnoss, Gersemi.",
          "powers": "Love and desire inducement, fertility granting, falcon transformation, warrior blessing",
          "temples": "Temples throughout Scandinavia especially Sweden",
          "worshipers": "Estimated 4-8 million during Viking Age",
          "history": "Vanir goddess, worship throughout Viking Age",
          "popularity": 75
        },
        {
          "id": "heimdall",
          "name": "Heimdall",
          "type": "Aesir God",
          "domain": "Dawn, Vigilance, Guardianship",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Gjallarhorn, Gold, Watch",
          "significance": "Guardian of rainbow bridge Bifrost. Eternal watchman of gods. Sounds Gjallarhorn at Ragnarok.",
          "impact": "Heimdall represented constant vigilance. Essential to cosmic order.",
          "dangerLevel": 70,
          "alterEgos": "Gjallarhorn-Blower (herald form), Rainbow-Walker (bridge form), Eternal Watcher",
          "relationships": "Father: Odin. Enemy: Loki (will fight at Ragnarok). Ally: All Aesir gods.",
          "powers": "Universal sight and hearing, Gjallarhorn mastery, bridge protection",
          "temples": "Small shrines at boundaries, few dedicated temples",
          "worshipers": "Estimated 2-4 million, less widely worshipped",
          "history": "Possibly Indo-European origin, became guardian figure",
          "popularity": 50
        },
        {
          "id": "frigg",
          "name": "Frigg",
          "type": "Aesir Goddess",
          "domain": "Marriage, Motherhood, Destiny",
          "parents": [],
          "children": [
            "Baldur"
          ],
          "consort": "Odin",
          "symbols": "Linen, Gold, Birds",
          "significance": "Queen of Aesir and goddess of marriage, motherhood, and household. Had own authority and servants.",
          "impact": "Frigg's prominence showed importance of motherhood. Her fate knowledge made her nearly equal to Odin.",
          "dangerLevel": 50,
          "alterEgos": "Beloved (Odin's wife role), Mother of Baldur (maternal aspect), Fate-Keeper",
          "relationships": "Husband: Odin. Son: Baldur. Handmaidens: served her.",
          "powers": "Fate sight (though cannot prevent), household protection, motherhood power",
          "temples": "Small shrines in villages, domestic worship",
          "worshipers": "Estimated 4-8 million during Viking Age",
          "history": "Possibly pre-Indo-European mother goddess",
          "popularity": 65
        },
        {
          "id": "baldur",
          "name": "Baldur",
          "type": "Aesir God",
          "domain": "Light, Beauty, Joy",
          "parents": [
            "Odin",
            "Frigg"
          ],
          "children": [],
          "consort": "Nanna",
          "symbols": "Light, Beauty, Mistletoe",
          "significance": "Most beautiful and beloved of Aesir. Represented light, purity, and hope. Killed through Loki's trickery.",
          "impact": "Baldur's death was most tragic event in Norse mythology. His return symbolizes renewal.",
          "dangerLevel": 30,
          "alterEgos": "Light Bringer (illumination form), Sacrificial Victim (death role)",
          "relationships": "Parents: Odin and Frigg (deeply loved). Wife: Nanna. Blind brother: Hod (killed him).",
          "powers": "Light radiance, beauty embodiment, joy inspiration",
          "temples": "Few dedicated temples (prophesied to return), primarily religious significance",
          "worshipers": "Estimated 4-6 million, less direct worship due to death and expected return",
          "history": "Central to Norse apocalyptic cycle, death most significant event",
          "popularity": 70
        },
        {
          "id": "tyr",
          "name": "Tyr",
          "type": "Aesir God",
          "domain": "War, Justice, Heroism",
          "parents": [
            "Odin"
          ],
          "children": [],
          "consort": null,
          "symbols": "Sword, One Hand, Justice",
          "significance": "God of war, justice, and heroic glory. Known for fairness and sacrifice for greater good (lost his hand binding Fenrir).",
          "impact": "Tyr worship emphasized justice and fair dealings. Warrior who fights for principles.",
          "dangerLevel": 70,
          "alterEgos": "One-Handed Warrior (wounded form), Just Judge (judicial aspect)",
          "relationships": "Father: Odin. Relationship with Fenrir: bound wolf at cost of hand.",
          "powers": "Warfare mastery, justice enforcement, one-handed warrior strength, combat excellence",
          "temples": "Temples throughout Scandinavia, especially warrior communities",
          "worshipers": "Estimated 3-5 million during Viking Age",
          "history": "Ancient warrior deity, central to justice-based worship",
          "popularity": 60
        }
      ],
      "founded": "c. 1200-400 BCE",
      "overview": "Scandinavian mythology featuring Norse gods like Odin and Thor. Emphasizes honor, warrior culture, and the apocalyptic Ragnarok. Celebrates cosmology of multiple realms connected by Yggdrasil."
    },
    "egyptian": {
      "name": "Egyptian Mythology",
      "description": "Ancient Egyptian pantheon spanning over 3000 years of civilization",
      "deities": [
        {
          "id": "ra",
          "name": "Ra",
          "type": "God",
          "domain": "Sun, Light, Creation",
          "parents": [],
          "children": [
            "Shu",
            "Tefnut",
            "Hathor"
          ],
          "consort": null,
          "symbols": "Sun Disk, Falcon, Eye",
          "significance": "Sun god and creator deity. Traveled across sky daily and through underworld nightly. Central to Egyptian cosmology.",
          "impact": "Ra's daily journey explained sun's movement. Pharaohs claimed incarnation from Ra.",
          "dangerLevel": 85,
          "alterEgos": "Khepri (scarab form - morning), Atum (evening form), Amun-Ra (combined form)",
          "relationships": "Children: Shu and Tefnut. Relationship with Hathor (daughter and Eye). Battles with Apophis.",
          "powers": "Solar radiation and heat control, light creation, daily sky journey, omniscient sight",
          "temples": "Great Temple of Ra at Heliopolis (most important), temples throughout Egypt",
          "worshipers": "Universal in ancient Egypt - estimated 8-10 million at peak",
          "history": "Worship from Old Kingdom (2686-2181 BCE) through Greco-Roman period",
          "popularity": 95
        },
        {
          "id": "osiris",
          "name": "Osiris",
          "type": "God",
          "domain": "Afterlife, Resurrection, Agriculture",
          "parents": [
            "Geb",
            "Nut"
          ],
          "children": [
            "Horus",
            "Anubis"
          ],
          "consort": "Isis",
          "symbols": "Staff, Crook, Flail",
          "significance": "God of afterlife, resurrection, and agriculture. Died and resurrected, becoming template for Egyptian afterlife beliefs.",
          "impact": "Osiris's resurrection myth gave Egyptians hope for life after death. All pharaohs identified with Osiris.",
          "dangerLevel": 50,
          "alterEgos": "Khenti-Amenitiu (foremost of the Westerners), Green God (vegetation form)",
          "relationships": "Wife: Isis (devoted partnership). Brother: Set (murdered him). Son: Horus.",
          "powers": "Death control, soul judgment, resurrection teaching, fertility promotion",
          "temples": "Temple at Abydos (primary pilgrimage site), temples at Karnak, Luxor",
          "worshipers": "Estimated 10-15 million at peak",
          "history": "Worship from Old Kingdom through Greco-Roman period",
          "popularity": 90
        },
        {
          "id": "isis",
          "name": "Isis",
          "type": "Goddess",
          "domain": "Magic, Motherhood, Healing",
          "parents": [
            "Geb",
            "Nut"
          ],
          "children": [
            "Horus"
          ],
          "consort": "Osiris",
          "symbols": "Throne, Wings, Ankh",
          "significance": "Goddess of magic, healing, motherhood, and fertility. Devoted to Osiris, used magic to restore him.",
          "impact": "Isis worship spread throughout Mediterranean, becoming most popular deity.",
          "dangerLevel": 70,
          "alterEgos": "Great of Magic (sorcerer form), Mother of Horus (protector form)",
          "relationships": "Husband: Osiris. Son: Horus. Sister: Nephthys. Brother: Set (enemy).",
          "powers": "Magic mastery, healing abilities, resurrection magic, child protection",
          "temples": "Temple at Dendera, temples at Philae, Luxor, throughout Egypt and Mediterranean",
          "worshipers": "Estimated 12-18 million at peak including Mediterranean",
          "history": "Worship from Old Kingdom through Roman period",
          "popularity": 95
        },
        {
          "id": "horus",
          "name": "Horus",
          "type": "God",
          "domain": "Sky, Falcon, Royal Power",
          "parents": [
            "Osiris",
            "Isis"
          ],
          "children": [],
          "consort": null,
          "symbols": "Falcon, Eye of Horus",
          "significance": "Falcon god and son of Osiris. Fought uncle Set for throne. His Eye became symbol of wholeness.",
          "impact": "Horus's claim justified pharaonic rule. His eye symbolism became protective amulets.",
          "dangerLevel": 70,
          "alterEgos": "Horus the Elder (sky form), Young Horus (child form), Falcon-Warrior",
          "relationships": "Father: Osiris. Mother: Isis. Uncle: Set (bitter enemy).",
          "powers": "Falcon sight mastery, sky control, eye symbolism and healing, royal authority",
          "temples": "Horus Temple at Edfu, temples throughout Egypt",
          "worshipers": "Estimated 8-12 million at peak",
          "history": "Worship from Old Kingdom, Edfu temple major pilgrimage destination",
          "popularity": 85
        },
        {
          "id": "anubis",
          "name": "Anubis",
          "type": "God",
          "domain": "Mummification, Death, Jackals",
          "parents": [
            "Osiris",
            "Nephthys"
          ],
          "children": [],
          "consort": null,
          "symbols": "Jackal, Mummy, Staff",
          "significance": "God of mummification, embalming, and the dead. Originally primary god of dead before Osiris.",
          "impact": "Anubis's role in mummification made him essential to burial practices.",
          "dangerLevel": 50,
          "alterEgos": "Inpu (original form), Guardian of Tombs (protective role), Jackal-Form",
          "relationships": "Father: Osiris. Mother: Nephthys. Ally: Isis (worked in mummification).",
          "powers": "Mummification magic, tomb protection, corpse preservation, afterlife guidance",
          "temples": "Temples at Abydos, Saqqara, throughout Egypt in necropolises",
          "worshipers": "Estimated 6-10 million at peak",
          "history": "Worship from Old Kingdom through Greco-Roman period",
          "popularity": 80
        },
        {
          "id": "thoth",
          "name": "Thoth",
          "type": "God",
          "domain": "Wisdom, Writing, Magic",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Ibis, Moon, Book",
          "significance": "God of wisdom, writing, and magic. Divine scribe and record-keeper. Invented writing and mathematics.",
          "impact": "Thoth's association with writing made him patron of scribes and scholars.",
          "dangerLevel": 50,
          "alterEgos": "Ibis-Headed Scribe (bird form), Lunar Deity (moon aspect)",
          "relationships": "Judge of the dead. Ally: other wisdom deities. Relationship with Seshat (goddess of writing).",
          "powers": "Magic mastery, writing and knowledge granting, judgment authority, record-keeping power",
          "temples": "Temples at Hermopolis, throughout Egypt especially in writing centers",
          "worshipers": "Estimated 5-8 million at peak, especially scribes",
          "history": "Worship from Old Kingdom, remained central throughout Egyptian history",
          "popularity": 65
        },
        {
          "id": "sekhmet",
          "name": "Sekhmet",
          "type": "Goddess",
          "domain": "War, Pestilence, Healing",
          "parents": [
            "Ra"
          ],
          "children": [],
          "consort": null,
          "symbols": "Lioness, Eye of Ra, Sun",
          "significance": "Fierce lioness goddess of war, plague, and healing. Destructive aspect of Ra's power. Healer and destroyer.",
          "impact": "Sekhmet worship involved careful propitiation to avoid wrath. Role as healer made her accessible.",
          "dangerLevel": 95,
          "alterEgos": "Lioness Warrior (predatory form), Plague-Bringer (disease form), Healer (medicinal)",
          "relationships": "Father: Ra. Aspect of: Hathor (gentler version).",
          "powers": "War mastery, plague generation and curing, heat and fire control, healing magic",
          "temples": "Temples at Karnak, Memphis, throughout Egypt",
          "worshipers": "Estimated 4-7 million at peak",
          "history": "Worship from Old Kingdom, remained important throughout history",
          "popularity": 70
        },
        {
          "id": "bastet",
          "name": "Bastet",
          "type": "Goddess",
          "domain": "Cats, Fertility, Protection",
          "parents": [
            "Ra"
          ],
          "children": [],
          "consort": null,
          "symbols": "Cat, Sistrum, Joy",
          "significance": "Goddess of cats, fertility, and protection. Originally lion/lioness, later associated with domestic cats.",
          "impact": "Bastet worship popular and beloved. Killing a cat was capital offense.",
          "dangerLevel": 50,
          "alterEgos": "Sekhmet (lion warrior form), Gentle Cat (domestic form), Mother Cat (protective)",
          "relationships": "Father: Ra. Protective of households and mothers.",
          "powers": "Cat communication, fertility granting, household protection, joy and music granting",
          "temples": "Major temple at Bubastis, temples throughout Egypt",
          "worshipers": "Estimated 5-8 million at peak",
          "history": "Worship particularly prominent in Late Period",
          "popularity": 75
        }
      ],
      "founded": "c. 3100-30 BCE",
      "overview": "Ancient Egyptian religion centered on gods like Ra, Osiris, and Isis. Emphasizes afterlife, mummification, and cosmic order (Ma'at). Reflects civilization's reverence for the Nile and eternal life."
    },
    "hindu": {
      "name": "Hindu/Vedic Mythology",
      "description": "One of the world's oldest and most complex mythological systems with hundreds of deities",
      "deities": [
        {
          "id": "brahma",
          "name": "Brahma",
          "type": "God",
          "domain": "Creation, Universe",
          "parents": [],
          "children": [
            "Saraswati"
          ],
          "consort": null,
          "symbols": "Lotus, Vedas, Swan",
          "significance": "Creator god and first of Trimurti (trinity). Created universe and all living beings.",
          "impact": "Brahma temples rare compared to other deities. His creation association gave importance.",
          "dangerLevel": 50,
          "alterEgos": "Self-Born (Svayambhu form), Grandsire (elder aspect), Knowledge-Keeper",
          "relationships": "Partner in Trimurti: with Vishnu and Shiva. Daughter: Saraswati.",
          "powers": "Universe creation, life creation, Vedas knowledge, deity creation",
          "temples": "Brahma Temple in Pushkar (one of few), scattered temples in India",
          "worshipers": "Limited direct worship - estimated few million focus on him, billions acknowledge",
          "history": "Vedic deity from 1500 BCE, worship declined after classical period",
          "popularity": 50
        },
        {
          "id": "vishnu",
          "name": "Vishnu",
          "type": "God",
          "domain": "Preservation, Protection",
          "parents": [],
          "children": [
            "Krishna",
            "Rama"
          ],
          "consort": "Lakshmi",
          "symbols": "Chakra, Conch, Lotus",
          "significance": "Preserver god and maintainer of cosmic order (dharma). Descends in avatars when dharma threatened.",
          "impact": "Vishnu worship widespread and beloved. His avatars provide ideal behavior templates.",
          "dangerLevel": 70,
          "alterEgos": "Narasimha (man-lion form), Kurma (tortoise form), Varaha (boar form), Rama, Krishna",
          "relationships": "Wife: Lakshmi. Partner in Trimurti: with Brahma and Shiva.",
          "powers": "Universe preservation, avatar incarnation, dharma protection, divine intervention",
          "temples": "Temples throughout India, especially at Mathura, Vrindavan, Ayodhya",
          "worshipers": "Estimated 800+ million at peak and through history",
          "history": "Vedic deity from 1500 BCE, became central to Hinduism",
          "popularity": 95
        },
        {
          "id": "shiva",
          "name": "Shiva",
          "type": "God",
          "domain": "Destruction, Transformation",
          "parents": [],
          "children": [
            "Ganesha",
            "Skanda"
          ],
          "consort": "Parvati",
          "symbols": "Trident, Lingam, Drum",
          "significance": "Destroyer and transformer god. Destruction necessary for renewal. Cosmic dance (Nataraja) symbolizes cycles.",
          "impact": "Shiva worship emphasizes yoga, meditation, asceticism. Destruction understood as necessary.",
          "dangerLevel": 85,
          "alterEgos": "Nataraja (cosmic dancer form), Mahakala (great time/death form), Rudra (fearsome form)",
          "relationships": "Wife: Parvati. Children: Ganesha, Skanda. Partner in Trimurti.",
          "powers": "Destruction and transformation, cosmic dance power, yoga mastery, third eye power",
          "temples": "Temples throughout India especially Varanasi, Rameswaram, Kedarnath",
          "worshipers": "Estimated 800+ million at peak and through history",
          "history": "Vedic deity from 1500 BCE, became central to Hinduism",
          "popularity": 95
        },
        {
          "id": "ganesha",
          "name": "Ganesha",
          "type": "God",
          "domain": "Obstacles, Wisdom, Beginnings",
          "parents": [
            "Shiva",
            "Parvati"
          ],
          "children": [],
          "consort": null,
          "symbols": "Elephant, Sweetness",
          "significance": "Elephant-headed god of obstacles and new beginnings. Removes obstacles, invoked at venture start.",
          "impact": "Ganesha worship nearly universal in Hinduism. Festivals are joyful celebrations.",
          "dangerLevel": 40,
          "alterEgos": "Elephant-Headed Remover (obstacle form), Sweet-Toothed Lover (playful)",
          "relationships": "Parents: Shiva and Parvati. Brother: Skanda.",
          "powers": "Obstacle removal, wisdom granting, auspiciousness granting, elephant communication",
          "temples": "Ganesha temples throughout India, household shrines (most common)",
          "worshipers": "Estimated 1+ billion at peak, nearly universal in Hindu households",
          "history": "Became prominent deity during medieval period",
          "popularity": 95
        },
        {
          "id": "durga",
          "name": "Durga",
          "type": "Goddess",
          "domain": "War, Protection, Shakti",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Lion, Sword, Power",
          "significance": "Warrior goddess and manifestation of shakti (divine feminine power). Battles demons.",
          "impact": "Durga Puja major festival. Her warrior nature challenged gender norms.",
          "dangerLevel": 85,
          "alterEgos": "Kali (destroyer form), Lakshmi (prosperity form), Uma (gentle form)",
          "relationships": "Manifestation of: Shakti (divine feminine). Mount: Lion.",
          "powers": "Warfare mastery, demon-slaying, protection granting, shakti manifestation",
          "temples": "Durga temples throughout India",
          "worshipers": "Estimated 800+ million at peak",
          "history": "Became prominent deity, nearly universal worship",
          "popularity": 90
        },
        {
          "id": "lakshmi",
          "name": "Lakshmi",
          "type": "Goddess",
          "domain": "Wealth, Fortune, Prosperity",
          "parents": [],
          "children": [],
          "consort": "Vishnu",
          "symbols": "Lotus, Gold, Coins",
          "significance": "Goddess of wealth, fortune, and prosperity. Consort of Vishnu, invoked for abundance.",
          "impact": "Lakshmi worship universal at festivals. Diwali celebrates her return.",
          "dangerLevel": 30,
          "alterEgos": "Padma (lotus form), Wealth-Bringer (prosperity form)",
          "relationships": "Wife/Partner: Vishnu.",
          "powers": "Wealth granting, fortune bestowal, prosperity blessing",
          "temples": "Lakshmi temples throughout India, household shrines",
          "worshipers": "Estimated 1+ billion at peak",
          "history": "Vedic roots, became prominent in classical period",
          "popularity": 95
        },
        {
          "id": "krishna",
          "name": "Krishna",
          "type": "Avatar/God",
          "domain": "Love, Dharma, Divinity",
          "parents": [
            "Vasudeva",
            "Devaki"
          ],
          "children": [],
          "consort": "Radha",
          "symbols": "Flute, Peacock, Lotus",
          "significance": "Avatar of Vishnu. Eighth incarnation of Vishnu in human form. Central to Bhagavad Gita.",
          "impact": "Krishna cults spread throughout Hindu world. Most beloved deity for many Hindus.",
          "dangerLevel": 70,
          "alterEgos": "Cowherd (pastoral form), Charioteer (Arjuna's guide), Divine Lover (romantic form)",
          "relationships": "Avatar of: Vishnu. Lover: Radha (divine feminine aspect). Ally: Arjuna.",
          "powers": "Divine knowledge, flute magic, avatar powers, cosmic vision (Virata form)",
          "temples": "Temples throughout India especially Mathura, Vrindavan, Dwaraka",
          "worshipers": "Estimated 500+ million at peak, most beloved for many",
          "history": "Central figure in Bhagavad Gita and Mahabharata",
          "popularity": 95
        },
        {
          "id": "rama",
          "name": "Rama",
          "type": "Avatar/God",
          "domain": "Dharma, Heroism, Kingship",
          "parents": [
            "Dasharatha",
            "Kaushalya"
          ],
          "children": [
            "Kusha",
            "Lava"
          ],
          "consort": "Sita",
          "symbols": "Bow, Arrow, Lotus",
          "significance": "Avatar of Vishnu. Seventh incarnation. Hero of Ramayana. Ideal ruler and person.",
          "impact": "Rama cults spread throughout Hindu world. Ramayana among most influential texts.",
          "dangerLevel": 70,
          "alterEgos": "Prince of Ayodhya (royal form), Bowhunter (warrior form)",
          "relationships": "Avatar of: Vishnu. Wife: Sita (abducted by Ravana). Sons: Kusha and Lava.",
          "powers": "Dharma power, bow mastery, divine strength, cosmic knowledge",
          "temples": "Temples throughout India especially Ayodhya, Varanasi",
          "worshipers": "Estimated 500+ million at peak",
          "history": "Central figure in Ramayana epic, ideal Hindu model",
          "popularity": 95
        }
      ],
      "founded": "c. 1500 BCE onwards",
      "overview": "Hindu mythology featuring the Trimurti (Brahma, Vishnu, Shiva) and their avatars. Rich with epics like Ramayana and Mahabharata. Explores dharma, karma, and the cycle of creation."
    },
    "japanese": {
      "name": "Japanese/Shinto Mythology",
      "description": "Japanese mythology featuring kami (spirits/deities) and the creation of the islands of Japan",
      "deities": [
        {
          "id": "izanagi",
          "name": "Izanagi",
          "type": "Primordial God",
          "domain": "Creation, Life",
          "parents": [],
          "children": [
            "Islands of Japan",
            "Amaterasu",
            "Tsukuyomi",
            "Susanoo"
          ],
          "consort": "Izanami",
          "symbols": "Spear, Creation",
          "significance": "Creator god who created the islands of Japan with wife Izanami using sacred spear.",
          "impact": "Izanagi creation myth fundamental to Japanese identity and Shinto.",
          "dangerLevel": 70,
          "alterEgos": "The Creator (creation aspect), Primordial Male (gender aspect)",
          "relationships": "Wife: Izanami (journeyed to underworld to retrieve her). Children: Islands, major deities.",
          "powers": "Island creation, deity creation, life granting",
          "temples": "Izanagi Shrine in Hyogo (primary shrine)",
          "worshipers": "Estimated 100+ million through Japanese history",
          "history": "Foundational to Shinto creation mythology",
          "popularity": 60
        },
        {
          "id": "amaterasu",
          "name": "Amaterasu",
          "type": "Goddess",
          "domain": "Sun, Imperial Rule",
          "parents": [
            "Izanagi",
            "Izanami"
          ],
          "children": [],
          "consort": null,
          "symbols": "Sun Disk, Mirror, Jewels",
          "significance": "Goddess of the sun. Most important kami in Shinto. Divine ancestor of Japanese imperial family.",
          "impact": "Amaterasu worship central to Japanese identity and imperial legitimacy.",
          "dangerLevel": 70,
          "alterEgos": "The Hidden Goddess (when retreating into cave)",
          "relationships": "Parents: Izanagi and Izanami. Siblings: Tsukuyomi, Susanoo.",
          "powers": "Sun control, imperial blessing, divine radiance",
          "temples": "Ise Grand Shrine (most sacred Shinto shrine in Japan)",
          "worshipers": "Estimated 100+ million, central to Japanese religious identity",
          "history": "Central to Shinto and Japanese imperial tradition",
          "popularity": 90
        },
        {
          "id": "susanoo",
          "name": "Susanoo",
          "type": "God",
          "domain": "Storm, Wind, Heroism",
          "parents": [
            "Izanagi",
            "Izanami"
          ],
          "children": [
            "Okuninushi"
          ],
          "consort": "Kusanada-hime",
          "symbols": "Sword (Kusanagi), Storm",
          "significance": "God of storm, wind, and the sea. Slayed the serpent Yamata no Orochi.",
          "impact": "Susanoo worship widespread, particularly for storm protection.",
          "dangerLevel": 85,
          "alterEgos": "The Storm God (weather form), Serpent Slayer (hero form)",
          "relationships": "Parents: Izanagi and Izanami. Sister: Amaterasu. Son: Okuninushi.",
          "powers": "Storm summoning, wind control, serpent-slaying, sword mastery",
          "temples": "Susanoo shrines throughout Japan, especially Izumo",
          "worshipers": "Estimated 50+ million through Japanese history",
          "history": "Important kami in Shinto, patron of warriors",
          "popularity": 75
        },
        {
          "id": "inari",
          "name": "Inari",
          "type": "Goddess/Deity",
          "domain": "Agriculture, Prosperity, Foxes",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Fox, Rice, Key",
          "significance": "Goddess of agriculture, prosperity, and rice. One of most widely worshipped kami in Japan.",
          "impact": "Inari worship extremely widespread. Inari shrines most common in Japan.",
          "dangerLevel": 50,
          "alterEgos": "Fox Deity (kitsune form), Fertility Bringer (agriculture form)",
          "relationships": "Associated with: Foxes (kitsune) as messengers.",
          "powers": "Crop blessing, prosperity granting, fox communication",
          "temples": "Fushimi Inari Shrine (most famous with thousands of torii gates), thousands of shrines nationwide",
          "worshipers": "Estimated 100+ million, most widely worshipped kami",
          "history": "Originally agricultural deity, became merchant patron",
          "popularity": 90
        }
      ],
      "founded": "c. 300 BCE onwards",
      "overview": "Japanese mythology featuring kami spirits and primordial deities. Celebrates creation myths, nature spirits, and imperial lineage. Foundation of Shinto tradition."
    },
    "chinese": {
      "name": "Chinese Mythology",
      "description": "One of the world's oldest continuous mythologies spanning thousands of years",
      "deities": [
        {
          "id": "pangu",
          "name": "Pangu",
          "type": "Primordial Being",
          "domain": "Creation, Universe",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Axe, Cosmic Egg",
          "significance": "Primordial being who created the universe from cosmic egg. His body became the world.",
          "impact": "Pangu creation myth foundational to Chinese cosmology.",
          "dangerLevel": 95,
          "alterEgos": "The Universe Embodied (cosmic form)",
          "relationships": "Created: the entire universe and cosmos.",
          "powers": "Universe creation, cosmic force",
          "temples": "Pangu temples in China, particularly in Guangdong",
          "worshipers": "Estimated 50+ million through Chinese history",
          "history": "Central to Chinese creation mythology",
          "popularity": 70
        },
        {
          "id": "jade_emperor",
          "name": "Jade Emperor (Yuhuang Dadi)",
          "type": "God",
          "domain": "Heaven, Earth, Underworld Rule",
          "parents": [],
          "children": [],
          "consort": "Jade Empress",
          "symbols": "Dragon Throne, Jade",
          "significance": "Ruler of heaven, earth, and underworld. Most important deity in Chinese popular religion.",
          "impact": "Jade Emperor worship central to Chinese religious practice.",
          "dangerLevel": 95,
          "alterEgos": "Celestial Emperor (cosmic rule form)",
          "relationships": "Rules over: Heaven, Earth, Underworld and all beings within them.",
          "powers": "Universal rule, life and death authority, cosmic governance",
          "temples": "Jade Emperor temples throughout China, especially Beijing",
          "worshipers": "Estimated 100+ million at peak",
          "history": "Central to Chinese cosmology and religious practice",
          "popularity": 85
        },
        {
          "id": "xi_wangmu",
          "name": "Xi Wangmu (Queen Mother of the West)",
          "type": "Goddess",
          "domain": "Immortality, Death, Joy",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Peach of Immortality, Tiger",
          "significance": "Ancient goddess ruling Mount Kunlun. Source of immortality through peaches. Associated with both death and immortality.",
          "impact": "Xi Wangmu worship very ancient. Central to Daoist immortality concepts.",
          "dangerLevel": 70,
          "alterEgos": "Mother of Immortality (immortal aspect), Death Bringer (mortality aspect)",
          "relationships": "Rules: Mount Kunlun and western paradise.",
          "powers": "Immortality granting, peach magic, Mount Kunlun rule, tiger communication",
          "temples": "Xi Wangmu temples throughout China",
          "worshipers": "Estimated 50+ million through Chinese history",
          "history": "One of oldest Chinese deities, central to immortality beliefs",
          "popularity": 75
        },
        {
          "id": "guanyu",
          "name": "Guanyu",
          "type": "Deified Human/God",
          "domain": "War, Loyalty, Righteousness",
          "parents": [
            "Guan He",
            "Lady Ding"
          ],
          "children": [],
          "consort": null,
          "symbols": "Halberd, Red Face",
          "significance": "Deified historical general. Symbol of loyalty, righteousness, and martial prowess. Worshipped as a god.",
          "impact": "Guanyu worship extremely widespread. One of most popular deities in Chinese culture.",
          "dangerLevel": 85,
          "alterEgos": "God of War (martial aspect), Righteous Saint (virtue aspect)",
          "relationships": "Brother-in-arms: with Liu Bei and Zhang Fei (sworn brothers).",
          "powers": "Warfare mastery, righteous judgment, fate guidance",
          "temples": "Guanyu temples throughout China, Asia, and Chinese diaspora",
          "worshipers": "Estimated 100+ million at peak and through history",
          "history": "Historical figure (160-219 CE) deified and worshipped as god",
          "popularity": 80
        }
      ],
      "founded": "c. 2000 BCE onwards",
      "overview": "Chinese mythology blending folk traditions, philosophy, and history. Features jade emperors, immortals, and dragons. Reflects Confucian and Taoist values of harmony and cosmic balance."
    },
    "mesoamerican": {
      "name": "Mesoamerican Mythology",
      "description": "Mythology of the Aztec, Maya, and other Mesoamerican civilizations",
      "deities": [
        {
          "id": "quetzalcoatl",
          "name": "Quetzalcoatl",
          "type": "God",
          "domain": "Wind, Air, Civilization, Learning",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Feathered Serpent, Wind",
          "significance": "Feathered serpent god. Creator deity associated with wind, air, and knowledge. Divine mentor to humanity.",
          "impact": "Quetzalcoatl worship central to Mesoamerican civilization.",
          "dangerLevel": 70,
          "alterEgos": "Feathered Serpent (creation form), Wind God (Ehecatl form), The Returning God",
          "relationships": "Creator of: humanity and civilization. Allied with: Tezcatlipoca (dual creator).",
          "powers": "Wind mastery, knowledge granting, civilization creation, shapeshifting",
          "temples": "Temple of Quetzalcoatl at Teotihuacan, temples throughout Mesoamerica",
          "worshipers": "Estimated 10+ million at peak",
          "history": "Worship from Toltec period through Aztec era",
          "popularity": 85
        },
        {
          "id": "tezcatlipoca",
          "name": "Tezcatlipoca",
          "type": "God",
          "domain": "Night, Sorcery, War, Destiny",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Obsidian Mirror, Jaguar",
          "significance": "Smoking Mirror god. Associated with night, sorcery, and destiny. Powerful and unpredictable.",
          "impact": "Tezcatlipoca worship central to Aztec cosmology.",
          "dangerLevel": 95,
          "alterEgos": "Smoking Mirror (sorcery form), Jaguar God (animal form), Night Lord (nocturnal form)",
          "relationships": "Dual creator with: Quetzalcoatl. Adversarial relationship with multiple deities.",
          "powers": "Sorcery mastery, fate control, obsidian magic, jaguar summoning",
          "temples": "Temples throughout Mesoamerica, especially Aztec capital",
          "worshipers": "Estimated 10+ million at peak",
          "history": "Central to Aztec religion and cosmology",
          "popularity": 80
        },
        {
          "id": "huitzilopochtli",
          "name": "Huitzilopochtli",
          "type": "God",
          "domain": "War, Sun, Humming Bird",
          "parents": [
            "Coatlicue"
          ],
          "children": [],
          "consort": null,
          "symbols": "Hummingbird, Sun, Arrow",
          "significance": "Hummingbird of the left god. Aztec patron deity and god of war and the sun.",
          "impact": "Huitzilopochtli worship central to Aztec identity. Led Aztecs to build Tenochtitlan.",
          "dangerLevel": 85,
          "alterEgos": "Hummingbird (swift form), Sun God (solar form), War Leader (military form)",
          "relationships": "Mother: Coatlicue. Led the Aztecs: to Tenochtitlan as promised.",
          "powers": "War mastery, sun power, swift movement, hummingbird communication",
          "temples": "Great Temple (Templo Mayor) in Tenochtitlan",
          "worshipers": "Estimated 10+ million at peak among Aztecs",
          "history": "Central to Aztec civilization and empire",
          "popularity": 75
        },
        {
          "id": "xibalba_lords",
          "name": "Xibalba Lords (Underworld Deities)",
          "type": "Collective Gods",
          "domain": "Underworld, Death, Disease",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Death, Decay, Disease",
          "significance": "Collective lords ruling Xibalba (Mayan underworld). Associated with death and suffering.",
          "impact": "Central to Mayan cosmology and underworld beliefs.",
          "dangerLevel": 95,
          "alterEgos": "Death Lords (collective manifestation), Disease Bringers (plague aspect)",
          "relationships": "Rules: Xibalba and all dead within. Opposed by: Hero Twins (Hunahpu and Xbalanque).",
          "powers": "Death authority, underworld rule, disease spreading",
          "temples": "Mayan temples throughout Mesoamerica, especially at Chichen Itza",
          "worshipers": "Estimated 5+ million among Mayans",
          "history": "Central to Mayan cosmology documented in Popol Vuh",
          "popularity": 50
        }
      ],
      "founded": "c. 1500 BCE onwards",
      "overview": "Aztec and Mayan mythology featuring complex pantheons and cosmologies. Emphasizes human sacrifice, calendar cycles, and deity interactions. Rich astronomical knowledge embedded in myths."
    },
    "celtic": {
      "name": "Celtic Mythology",
      "description": "Mythology of the Celtic peoples of Europe, particularly Ireland, Wales, and Brittany",
      "deities": [
        {
          "id": "dagda",
          "name": "The Dagda",
          "type": "God",
          "domain": "Magic, Fertility, War, Wisdom",
          "parents": [],
          "children": [
            "Brigid",
            "Aengus"
          ],
          "consort": "Mór-Ríghan",
          "symbols": "Cauldron, Club, Harp",
          "significance": "All-father figure in Irish mythology. God of magic, fertility, and war. Wielder of magical cauldron.",
          "impact": "Dagda worship central to Irish pagan religion.",
          "dangerLevel": 85,
          "alterEgos": "The Good God (benevolent form), Druid (magical form)",
          "relationships": "Children: Brigid, Aengus. Wife: Mór-Ríghan.",
          "powers": "Magic mastery, weather control, fertility granting, cauldron summoning",
          "temples": "Sacred sites throughout Ireland, especially Tara",
          "worshipers": "Estimated 5+ million among Celtic peoples",
          "history": "Central to Irish mythology and pagan beliefs",
          "popularity": 65
        },
        {
          "id": "brigid",
          "name": "Brigid",
          "type": "Goddess",
          "domain": "Fire, Poetry, Healing, Smithcraft",
          "parents": [
            "The Dagda"
          ],
          "children": [],
          "consort": null,
          "symbols": "Fire, Flame, Well",
          "significance": "Triple goddess of fire, poetry, healing, and smithcraft. One of most important Celtic deities.",
          "impact": "Brigid worship extremely widespread. Later merged with St. Brigid in Christianity.",
          "dangerLevel": 70,
          "alterEgos": "Triple Goddess (three aspects), Healer (medicinal form), Smith (craft form)",
          "relationships": "Father: The Dagda. Revered by: poets, smiths, healers.",
          "powers": "Fire control, poetry inspiration, healing magic, smithcraft enhancement",
          "temples": "Sacred wells throughout Ireland, temples at Kildare",
          "worshipers": "Estimated 10+ million through Celtic history",
          "history": "One of most important Celtic deities, survived Christianization",
          "popularity": 75
        },
        {
          "id": "lugh",
          "name": "Lugh",
          "type": "God",
          "domain": "Light, Crafts, War, Magic",
          "parents": [],
          "children": [
            "Cu Chulainn"
          ],
          "consort": null,
          "symbols": "Spear, Light, Raven",
          "significance": "God of light, crafts, and war. Master of many skills. Father of great hero Cu Chulainn.",
          "impact": "Lugh worship widespread among Celtic peoples.",
          "dangerLevel": 70,
          "alterEgos": "The Bright One (light form), Master of All Arts (craft form)",
          "relationships": "Father of: Cu Chulainn (greatest Celtic hero).",
          "powers": "Light mastery, craft enhancement, war prowess, magic mastery",
          "temples": "Temples throughout Celtic lands, festival sites",
          "worshipers": "Estimated 5+ million among Celtic peoples",
          "history": "Widely worshipped Celtic deity",
          "popularity": 70
        }
      ],
      "founded": "c. 800-100 BCE",
      "overview": "Celtic mythology from Ireland, Wales, and Brittany. Features gods, fairies, and heroes in mystical landscapes. Celebrates cycles of nature, warrior culture, and spiritual wisdom."
    },
    "mesopotamian": {
      "name": "Mesopotamian Mythology",
      "description": "Mythology of ancient Sumer, Akkad, Babylon, and Assyria",
      "deities": [
        {
          "id": "marduk",
          "name": "Marduk",
          "type": "God",
          "domain": "Creation, Kingship, Magic, Babylon",
          "parents": [
            "Enuma Elish (generated via conflict)"
          ],
          "children": [],
          "consort": "Sarpanitum",
          "symbols": "Dragon (Tiamat), Tablet of Destinies",
          "significance": "Chief god of Babylon. Creator deity in Enuma Elish. Slayer of primordial chaos.",
          "impact": "Marduk worship became central to Babylonian civilization.",
          "dangerLevel": 95,
          "alterEgos": "King of Gods (rulership form), Dragon Slayer (hero form), Destiny Keeper",
          "relationships": "Created: the world and humanity. Rules: Babylon and cosmos.",
          "powers": "Creation magic, chaos control, kingship granting, destiny determination",
          "temples": "Esagila Temple in Babylon (most important Mesopotamian temple)",
          "worshipers": "Estimated 10+ million at peak among Babylonians",
          "history": "Worship became dominant in Babylonian period",
          "popularity": 70
        },
        {
          "id": "enuma_elish_gods",
          "name": "Primordial Gods (Tiamat, Apsu, Mummu)",
          "type": "Primordial Beings",
          "domain": "Creation, Chaos, Primordial Forces",
          "parents": [],
          "children": [
            "Younger Gods"
          ],
          "consort": "Self-generating",
          "symbols": "Chaos, Primordial Waters, Void",
          "significance": "Primordial forces in Enuma Elish creation myth. Tiamat represents chaos overcome.",
          "impact": "Central to Mesopotamian creation cosmology.",
          "dangerLevel": 95,
          "alterEgos": "Primordial Chaos (manifest form), Saltwaters (oceanic form)",
          "relationships": "Generate: all younger gods through conflict.",
          "powers": "Primordial force, creation power, chaos manifestation",
          "temples": "Part of creation mythology, limited direct worship",
          "worshipers": "Acknowledged in creation ritual practices",
          "history": "Central to Enuma Elish myth",
          "popularity": 60
        },
        {
          "id": "ishtar",
          "name": "Ishtar",
          "type": "Goddess",
          "domain": "Love, War, Fertility, Sexuality",
          "parents": [
            "Sin"
          ],
          "children": [],
          "consort": "Tammuz",
          "symbols": "Star, Lion, Butterfly",
          "significance": "Goddess of love, war, and sexuality. Most important female deity in Mesopotamia.",
          "impact": "Ishtar worship widespread and important.",
          "dangerLevel": 85,
          "alterEgos": "Morning Star (Venus form), War Goddess (military form)",
          "relationships": "Husband: Tammuz. Lover of multiple gods.",
          "powers": "Love magic, warfare prowess, sexuality power, star control",
          "temples": "Ishtar temples throughout Mesopotamia",
          "worshipers": "Estimated 10+ million at peak",
          "history": "Widely worshipped throughout Mesopotamian history",
          "popularity": 75
        }
      ],
      "founded": "c. 2100 BCE onwards",
      "overview": "Ancient Sumerian and Babylonian mythology with gods like Marduk and Inanna. Features creation myths and divine councils. Foundation of written mythology and cuneiform records."
    },
    "polynesian": {
      "name": "Polynesian Mythology",
      "description": "Mythology of the Hawaiian, Samoan, Maori, Tahitian, and other Pacific Island peoples",
      "deities": [
        {
          "id": "maui",
          "name": "Maui",
          "type": "Demigod/Cultural Hero",
          "domain": "Trickery, Fire, Fishing, Heroism",
          "parents": [
            "Hina",
            "Makea"
          ],
          "children": [],
          "consort": null,
          "symbols": "Fish Hook, Fire, Lasso",
          "significance": "Greatest Polynesian cultural hero. Pulled islands from the sea, slowed the sun, discovered fire.",
          "impact": "Maui stories central to all Polynesian cultures. Most famous Polynesian figure.",
          "dangerLevel": 70,
          "alterEgos": "The Trickster (cunning form), Sun-Slayer (heroic form), Island-Fisher (creation aspect)",
          "relationships": "Mother: Hina. Rivals with: Sun (Maui slowed its descent). Allies: Polynesian peoples.",
          "powers": "Trickery mastery, fire discovery, island pulling, sun manipulation, transformation",
          "temples": "Sacred sites throughout Pacific Islands",
          "worshipers": "Estimated 10+ million across Polynesian cultures",
          "history": "Central to Hawaiian, Maori, Samoan, and Tahitian cultures",
          "popularity": 85
        },
        {
          "id": "pele",
          "name": "Pele",
          "type": "Goddess",
          "domain": "Fire, Volcanoes, Creation, Destruction",
          "parents": [
            "Haumea"
          ],
          "children": [
            "Namaka",
            "Kapo"
          ],
          "consort": "Lohi'au",
          "symbols": "Fire, Volcano, Lava",
          "significance": "Hawaiian volcano goddess. Creator and destroyer. Lives in Kilauea volcano.",
          "impact": "Pele worship central to Hawaiian culture and beliefs.",
          "dangerLevel": 95,
          "alterEgos": "The Fire Goddess (volcanic form), Destroyer (lava aspect), Creator (island-building form)",
          "relationships": "Mother: Haumea. Children: Namaka, Kapo. Love interest: Lohi'au.",
          "powers": "Fire control, volcano mastery, lava creation, destruction and creation",
          "temples": "Crater of Kilauea (primary sacred site), temples throughout Hawaii",
          "worshipers": "Estimated 5+ million among Hawaiian peoples",
          "history": "Central to Hawaiian mythology and volcano worship",
          "popularity": 75
        },
        {
          "id": "tangaroa",
          "name": "Tangaroa",
          "type": "God",
          "domain": "Sea, Fish, Ocean",
          "parents": [
            "Rangi and Papa (Sky and Earth)"
          ],
          "children": [
            "All sea creatures"
          ],
          "consort": null,
          "symbols": "Ocean, Fish, Waves",
          "significance": "Polynesian sea god. Ruler of all oceans and marine life. Creator of fish.",
          "impact": "Tangaroa worship important for fishing cultures.",
          "dangerLevel": 70,
          "alterEgos": "The Ocean God (marine form), Fish Creator (fertility form)",
          "relationships": "Created: all fish and sea creatures. Rules: all oceans.",
          "powers": "Ocean control, fish creation, storm summoning, tide manipulation",
          "temples": "Ocean-side temples throughout Polynesia",
          "worshipers": "Estimated 5+ million among Polynesian seafaring peoples",
          "history": "Important to seafaring Polynesian cultures",
          "popularity": 60
        },
        {
          "id": "hina",
          "name": "Hina",
          "type": "Goddess",
          "domain": "Moon, Women, Fertility, Crafts",
          "parents": [],
          "children": [
            "Maui"
          ],
          "consort": null,
          "symbols": "Moon, Tapa cloth, Woman",
          "significance": "Moon goddess and mother of Maui. Associated with feminine power and crafts.",
          "impact": "Hina worship widespread among Polynesian peoples.",
          "dangerLevel": 50,
          "alterEgos": "The Moon Goddess (lunar form), Mother of Maui (maternal form)",
          "relationships": "Son: Maui (great hero). Revered by: women, crafters.",
          "powers": "Moon control, craft inspiration, feminine power, fertility granting",
          "temples": "Moon shrines throughout Polynesia",
          "worshipers": "Estimated 5+ million among Polynesian peoples",
          "history": "Important goddess across Polynesian cultures",
          "popularity": 65
        }
      ],
      "founded": "c. 1000 BCE onwards",
      "overview": "Pacific Islander mythology featuring gods like Maui and Pele. Celebrates ocean voyages, natural forces, and ancestral connections. Rich oral tradition across island cultures."
    },
    "native_american": {
      "name": "Native American Mythology",
      "description": "Mythology of various Native American tribes and peoples (Navajo, Cherokee, Lakota, Pacific Northwest, etc.)",
      "deities": [
        {
          "id": "coyote",
          "name": "Coyote",
          "type": "Trickster/Creator",
          "domain": "Trickery, Creation, Chaos, Wisdom",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Coyote, Cunning, Wildfire",
          "significance": "Trickster figure across many Native American cultures. Creator, chaos-bringer, and wise teacher.",
          "impact": "Coyote stories central to Native American oral traditions across many tribes.",
          "dangerLevel": 70,
          "alterEgos": "The Trickster (cunning form), Creator (world-making form), Teacher (wisdom aspect)",
          "relationships": "Interacts with: all creatures and peoples. Neither wholly good nor evil.",
          "powers": "Trickery mastery, shapeshifting, creation magic, chaos summoning, wisdom granting",
          "temples": "Sacred coyote sites throughout North America",
          "worshipers": "Estimated 10+ million across many Native American tribes",
          "history": "Trickster figure in Southwest, Pacific Northwest, Great Plains cultures",
          "popularity": 80
        },
        {
          "id": "raven",
          "name": "Raven",
          "type": "Creator/Trickster",
          "domain": "Creation, Trickery, Light, Transformation",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Raven, Light, Transformation",
          "significance": "Pacific Northwest creator figure. Brought light to the world. Master trickster.",
          "impact": "Raven stories central to Pacific Northwest tribal traditions.",
          "dangerLevel": 70,
          "alterEgos": "The Light-Bringer (creation form), The Trickster (cunning form), The Transformer",
          "relationships": "Created: light, brought transformation to world.",
          "powers": "Light creation, shapeshifting, trickery, transformation magic",
          "temples": "Sacred raven sites in Pacific Northwest",
          "worshipers": "Estimated 5+ million among Pacific Northwest tribes",
          "history": "Central to Haida, Tlingit, and other Pacific Northwest cultures",
          "popularity": 75
        },
        {
          "id": "earth_mother",
          "name": "Mother Earth / Pachamama",
          "type": "Goddess",
          "domain": "Earth, Fertility, Life, Abundance",
          "parents": [],
          "children": [
            "All living things"
          ],
          "consort": null,
          "symbols": "Earth, Growing Things, Fertility",
          "significance": "Earth mother goddess revered across Native American cultures. Giver of life and abundance.",
          "impact": "Earth Mother worship fundamental to Native American spirituality.",
          "dangerLevel": 50,
          "alterEgos": "The Nurturer (fertility form), The Provider (abundance form)",
          "relationships": "Mother to: all living things. Sustains: all life.",
          "powers": "Life creation, fertility granting, abundance provision, earth control",
          "temples": "Natural sacred sites throughout Americas",
          "worshipers": "Estimated 15+ million across Native American peoples",
          "history": "Central to most Native American cultures",
          "popularity": 80
        },
        {
          "id": "thunderbird",
          "name": "Thunderbird",
          "type": "Spirit/God",
          "domain": "Thunder, Lightning, Storm, Power",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Thunder, Lightning, Eagle, Storm",
          "significance": "Powerful spirit bird controlling thunder and lightning. Symbol of power and dominion.",
          "impact": "Thunderbird worship widespread across many tribes.",
          "dangerLevel": 85,
          "alterEgos": "The Storm Bringer (weather form), The Great Eagle (flight form)",
          "relationships": "Controls: storms and weather. Revered by: warriors and hunters.",
          "powers": "Thunder summoning, lightning control, storm mastery, divine power",
          "temples": "Mountain and sky sacred sites throughout North America",
          "worshipers": "Estimated 10+ million across multiple tribes",
          "history": "Important across many Native American cultures",
          "popularity": 75
        }
      ],
      "founded": "Pre-historical"
    },
    "african": {
      "name": "African Mythology",
      "description": "Mythology of various African peoples, particularly West and Central African Yoruba and other groups",
      "deities": [
        {
          "id": "oshun",
          "name": "Oshun",
          "type": "Goddess",
          "domain": "Love, Beauty, Fertility, Rivers",
          "parents": [
            "Yemaya"
          ],
          "children": [],
          "consort": "Shango",
          "symbols": "River, Gold, Honey",
          "significance": "Yoruba goddess of love, beauty, fertility, and rivers. One of most beloved Orisha.",
          "impact": "Oshun worship spread throughout African diaspora and Americas.",
          "dangerLevel": 50,
          "alterEgos": "The River Goddess (water form), The Golden One (beauty form)",
          "relationships": "Mother: Yemaya. Lover/Wife: Shango. Revered by: women, lovers.",
          "powers": "Love and desire inducement, beauty enhancement, river control, fertility granting",
          "temples": "River shrines throughout Africa and Americas",
          "worshipers": "Estimated 10+ million through African diaspora",
          "history": "Central to Yoruba religion, survived through slavery in Americas",
          "popularity": 80
        },
        {
          "id": "shango",
          "name": "Shango",
          "type": "God",
          "domain": "Thunder, Lightning, War, Justice",
          "parents": [
            "Yemaya",
            "Aganju"
          ],
          "children": [],
          "consort": "Oshun",
          "symbols": "Thunder, Lightning, Axe, Fire",
          "significance": "Yoruba god of thunder, lightning, war, and justice. Powerful warrior king deified.",
          "impact": "Shango worship spread throughout African diaspora.",
          "dangerLevel": 85,
          "alterEgos": "The Thunder God (storm form), The Warrior King (military form)",
          "relationships": "Parents: Yemaya and Aganju. Wife: Oshun. Warrior: legendary fighter.",
          "powers": "Thunder summoning, lightning control, warfare mastery, justice enforcement",
          "temples": "Shango shrines throughout Africa and Americas",
          "worshipers": "Estimated 10+ million through African diaspora",
          "history": "Central to Yoruba religion, deified historical figure",
          "popularity": 80
        },
        {
          "id": "anansi",
          "name": "Anansi",
          "type": "Trickster/Spider",
          "domain": "Trickery, Stories, Wisdom, Cunning",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Spider, Web, Stories",
          "significance": "West African spider trickster. Master of stories and cunning. Survived slavery through folklore.",
          "impact": "Anansi stories spread throughout African diaspora and Caribbean.",
          "dangerLevel": 50,
          "alterEgos": "The Trickster (cunning form), The Storyteller (oral form), The Spider",
          "relationships": "Outwits: gods, humans, animals. Revered by: storytellers.",
          "powers": "Trickery mastery, web weaving, story magic, cunning intelligence",
          "temples": "Oral tradition temples (storytelling circles)",
          "worshipers": "Estimated 10+ million through African diaspora",
          "history": "Central to many West African cultures, survived through diaspora",
          "popularity": 75
        },
        {
          "id": "yemaya",
          "name": "Yemaya",
          "type": "Goddess",
          "domain": "Ocean, Motherhood, Protection, Fertility",
          "parents": [],
          "children": [
            "Shango",
            "Oshun",
            "Many Orisha"
          ],
          "consort": "Aganju",
          "symbols": "Ocean, Waves, Mother, Fish",
          "significance": "Yoruba mother goddess and ocean deity. Mother of many Orisha. Protector of children.",
          "impact": "Yemaya worship spread throughout African diaspora.",
          "dangerLevel": 70,
          "alterEgos": "The Ocean Mother (oceanic form), The Great Mother (maternal form)",
          "relationships": "Mother to: many Orisha and peoples. Protector: of children and women.",
          "powers": "Ocean control, motherhood power, protection granting, fertility blessing",
          "temples": "Ocean-side shrines throughout Africa and Americas",
          "worshipers": "Estimated 15+ million through African diaspora",
          "history": "Central to Yoruba religion, survived through diaspora",
          "popularity": 85
        }
      ],
      "founded": "Pre-historical"
    },
    "slavic": {
      "name": "Slavic Mythology",
      "description": "Mythology of Slavic peoples of Eastern Europe before Christianization",
      "deities": [
        {
          "id": "perun",
          "name": "Perun",
          "type": "God",
          "domain": "Thunder, Lightning, War, Sky",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Thunder, Lightning, Oak, Axe",
          "significance": "Slavic sky god and god of thunder. Ruler of sky and weather. Chief Slavic deity.",
          "impact": "Perun worship central to Slavic pagan religion.",
          "dangerLevel": 85,
          "alterEgos": "The Thunder God (storm form), The Sky Father (primordial form)",
          "relationships": "Rules: sky and weather. Revered by: warriors.",
          "powers": "Thunder summoning, lightning control, weather mastery, war prowess",
          "temples": "Oak groves and mountain temples throughout Slavic lands",
          "worshipers": "Estimated 10+ million before Christianization",
          "history": "Chief Slavic deity until Christianization (10th-12th centuries)",
          "popularity": 70
        },
        {
          "id": "veles",
          "name": "Veles",
          "type": "God",
          "domain": "Earth, Cattle, Underworld, Wealth",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Underworld, Cattle, Serpent, Wealth",
          "significance": "God of earth, cattle, wealth, and underworld. Fertility and prosperity deity.",
          "impact": "Veles worship important to agricultural Slavic societies.",
          "dangerLevel": 70,
          "alterEgos": "The Earth God (terrestrial form), The Wealth Giver (prosperity form)",
          "relationships": "Rules: earth and underworld. Rival: Perun (sky god).",
          "powers": "Earth control, cattle blessing, wealth granting, underworld mastery",
          "temples": "Earth and forest shrines throughout Slavic lands",
          "worshipers": "Estimated 10+ million before Christianization",
          "history": "Important Slavic fertility and prosperity deity",
          "popularity": 65
        },
        {
          "id": "marzanna",
          "name": "Marzanna",
          "type": "Goddess",
          "domain": "Winter, Death, Rebirth",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Winter, Snow, Death, Rebirth",
          "significance": "Slavic goddess of winter, death, and rebirth. Embodied winter's harshness and renewal.",
          "impact": "Marzanna worship tied to seasonal cycles.",
          "dangerLevel": 70,
          "alterEgos": "The Winter Goddess (cold form), Death Bringer (mortality form)",
          "relationships": "Rules: winter season. Cycles: with spring rebirth.",
          "powers": "Winter control, death bringing, rebirth granting, seasonal cycle influence",
          "temples": "Winter sites and sacred groves",
          "worshipers": "Estimated 5+ million before Christianization",
          "history": "Seasonal deity in Slavic mythology",
          "popularity": 55
        },
        {
          "id": "dazhbog",
          "name": "Dazhbog",
          "type": "God",
          "domain": "Sun, Light, Wealth, Fortune",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Sun, Light, Gold, Fortune",
          "significance": "Slavic sun god. Giver of light and wealth. Associated with fortune and prosperity.",
          "impact": "Dazhbog worship important to Slavic sun worship.",
          "dangerLevel": 50,
          "alterEgos": "The Sun God (solar form), The Wealth Giver (prosperity form)",
          "relationships": "Rules: sun and light. Giver: of wealth and fortune.",
          "powers": "Sun control, light creation, wealth granting, fortune bestowing",
          "temples": "Sun temples throughout Slavic lands",
          "worshipers": "Estimated 5+ million before Christianization",
          "history": "Important Slavic solar deity",
          "popularity": 50
        }
      ],
      "founded": "c. 1000-1200 CE"
    },
    "korean": {
      "name": "Korean Mythology",
      "description": "Mythology of the Korean peninsula including shamanism and early kingdom legends",
      "deities": [
        {
          "id": "hwanung",
          "name": "Hwanung",
          "type": "Divine Being",
          "domain": "Civilization, Culture, Earthly Realm",
          "parents": [
            "Hananim (Supreme Being)"
          ],
          "children": [
            "Dangun (founder of Gojoseon)"
          ],
          "consort": null,
          "symbols": "Civilization, Culture, Founding",
          "significance": "Divine being who descended to earth to establish civilization. Father of Korean people.",
          "impact": "Hwanung legend foundational to Korean cultural identity.",
          "dangerLevel": 70,
          "alterEgos": "The Heavenly Prince (divine form), Civilization Bringer (cultural form)",
          "relationships": "Father: Hananim. Son: Dangun (founder of first Korean kingdom).",
          "powers": "Civilization creation, cultural establishment, divine blessing",
          "temples": "Shrine of Hwanung throughout Korea",
          "worshipers": "Estimated 10+ million through Korean history",
          "history": "Foundational to Korean mythology and identity",
          "popularity": 70
        },
        {
          "id": "dangun",
          "name": "Dangun Wanggeom",
          "type": "Demigod/Founder",
          "domain": "Kingship, Foundation, Korean People",
          "parents": [
            "Hwanung"
          ],
          "children": [],
          "consort": null,
          "symbols": "Founding, Kingship, Korean Nation",
          "significance": "Legendary founder of Gojoseon, first Korean kingdom. Son of Hwanung.",
          "impact": "Dangun worship central to Korean national and cultural identity.",
          "dangerLevel": 50,
          "alterEgos": "The Founder (founding form), King (royal form)",
          "relationships": "Father: Hwanung. Founded: Gojoseon (first Korean kingdom).",
          "powers": "Kingdom creation, nation founding, royal blessing",
          "temples": "Tangun temples and shrines throughout Korea",
          "worshipers": "Estimated 10+ million throughout Korean history",
          "history": "Central to Korean national mythology",
          "popularity": 75
        }
      ],
      "founded": "c. 2300 BCE onwards"
    },
    "germanic": {
      "name": "Germanic Mythology",
      "description": "Mythology of Germanic peoples (distinct from Norse, though related)",
      "deities": [
        {
          "id": "donar",
          "name": "Donar",
          "type": "God",
          "domain": "Thunder, Lightning, Oak, Protection",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Thunder, Oak, Hammer",
          "significance": "Germanic god of thunder and protection. Similar to Norse Thor.",
          "impact": "Donar worship widespread among Germanic peoples.",
          "dangerLevel": 85,
          "alterEgos": "The Thunder God (storm form), Oak God (tree form)",
          "relationships": "Revered by: warriors and farmers.",
          "powers": "Thunder summoning, lightning control, oak mastery, protection granting",
          "temples": "Oak groves and mountain sites throughout Germanic lands",
          "worshipers": "Estimated 5+ million before Christianization",
          "history": "Central to Germanic pagan religion",
          "popularity": 60
        },
        {
          "id": "wodan",
          "name": "Wodan",
          "type": "God",
          "domain": "War, Wisdom, Death, Magic",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Rune, Spear, Raven",
          "significance": "Germanic god of war, wisdom, and magic. Similar to Norse Odin.",
          "impact": "Wodan worship important to Germanic religion.",
          "dangerLevel": 85,
          "alterEgos": "The All-Father (primordial form), The Wise One (wisdom form)",
          "relationships": "Rules: war and wisdom. Mentor: to warriors.",
          "powers": "War mastery, wisdom granting, magic power, death authority",
          "temples": "Sacred groves throughout Germanic lands",
          "worshipers": "Estimated 5+ million before Christianization",
          "history": "Central to Germanic pagan religion",
          "popularity": 75
        },
        {
          "id": "frija",
          "name": "Frija",
          "type": "Goddess",
          "domain": "Marriage, Motherhood, Home",
          "parents": [],
          "children": [],
          "consort": "Wodan",
          "symbols": "Marriage, Home, Woman",
          "significance": "Germanic goddess of marriage, motherhood, and home. Similar to Norse Frigg.",
          "impact": "Frija worship important to Germanic household religion.",
          "dangerLevel": 50,
          "alterEgos": "The Beloved (marital form), Mother (maternal form)",
          "relationships": "Husband: Wodan. Revered by: women and families.",
          "powers": "Marriage blessing, motherhood power, home protection",
          "temples": "Household shrines and sacred groves",
          "worshipers": "Estimated 5+ million before Christianization",
          "history": "Important to Germanic household religion",
          "popularity": 55
        }
      ],
      "founded": "c. 1-500 CE"
    },
    "persian": {
      "name": "Persian/Zoroastrian Mythology",
      "description": "Ancient Persian mythology and Zoroastrian religious figures",
      "deities": [
        {
          "id": "ahura_mazda",
          "name": "Ahura Mazda",
          "type": "Supreme God",
          "domain": "Wisdom, Good, Light, Creation",
          "parents": [],
          "children": [
            "Amesha Spentas"
          ],
          "consort": null,
          "symbols": "Fire, Light, Wisdom",
          "significance": "Supreme god of Zoroastrianism. Creator of all good things. Embodies wisdom and light.",
          "impact": "Ahura Mazda worship central to Zoroastrian faith, one of world's oldest monotheistic religions.",
          "dangerLevel": 70,
          "alterEgos": "The Wise Lord (wisdom form), Creator (creative form), Light Bringer",
          "relationships": "Creator of: Amesha Spentas (divine attributes). Opponent of: Ahriman (evil).",
          "powers": "Creation mastery, wisdom granting, light control, good manifestation",
          "temples": "Fire temples throughout Persia and Zoroastrian communities",
          "worshipers": "Estimated 5+ million at peak, millions remain today",
          "history": "Central to Zoroastrianism (700 BCE to modern era)",
          "popularity": 80
        },
        {
          "id": "ahriman",
          "name": "Ahriman",
          "type": "Evil Spirit/Opposing Force",
          "domain": "Darkness, Evil, Destruction, Chaos",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Darkness, Evil, Chaos",
          "significance": "Spirit of evil and destruction in Zoroastrianism. Opposes Ahura Mazda.",
          "impact": "Ahriman concept influenced dualistic religions and Western concepts of Satan.",
          "dangerLevel": 95,
          "alterEgos": "The Destructive Spirit (destructive form), Darkness Embodied",
          "relationships": "Opposes: Ahura Mazda. Spreads: evil, disease, death.",
          "powers": "Evil manifestation, darkness control, destruction spreading, corruption",
          "temples": "No temples (opposition figure)",
          "worshipers": "Not worshipped, only opposed and resisted",
          "history": "Central opposing force in Zoroastrian cosmology",
          "popularity": 70
        },
        {
          "id": "mithra",
          "name": "Mithra",
          "type": "God",
          "domain": "Contracts, Oath-Keeping, Sun, Justice",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Sun, Fire, Contracts",
          "significance": "God of contracts, oaths, and the sun. Guardian of justice and loyalty.",
          "impact": "Mithra worship spread throughout Persian Empire and Mediterranean.",
          "dangerLevel": 70,
          "alterEgos": "The Sun God (solar form), The Just Judge (judicial form)",
          "relationships": "Enforces: contracts and oaths. Associated with: Ahura Mazda.",
          "powers": "Contract enforcement, oath power, sun control, justice granting",
          "temples": "Mithraic temples throughout Persian Empire and Roman territories",
          "worshipers": "Estimated 5+ million at peak",
          "history": "Worship spread to Roman Empire, influenced Christianity",
          "popularity": 75
        }
      ],
      "founded": "c. 1500-600 BCE"
    },
    "sumerian": {
      "name": "Sumerian Mythology",
      "description": "Mythology of ancient Sumer, one of humanity's oldest civilizations",
      "deities": [
        {
          "id": "anu",
          "name": "Anu",
          "type": "God",
          "domain": "Sky, Heaven, Primordial Forces",
          "parents": [],
          "children": [
            "Enlil",
            "Enki",
            "Ninhursag"
          ],
          "consort": null,
          "symbols": "Sky, Heaven, Stars",
          "significance": "Sumerian sky god. Primordial force and father of gods.",
          "impact": "Anu worship foundational to Sumerian civilization.",
          "dangerLevel": 95,
          "alterEgos": "The Sky Father (paternal form), Heaven Embodied",
          "relationships": "Father to: many gods. Rules: the heavens.",
          "powers": "Sky mastery, heaven rule, cosmic force",
          "temples": "Sky temples throughout Sumer",
          "worshipers": "Estimated 5+ million in ancient Sumer",
          "history": "Central to Sumerian cosmology",
          "popularity": 70
        },
        {
          "id": "enlil",
          "name": "Enlil",
          "type": "God",
          "domain": "Wind, Air, Storm, Authority",
          "parents": [
            "Anu"
          ],
          "children": [
            "Ninurta",
            "Ninhursag"
          ],
          "consort": "Ninlil",
          "symbols": "Wind, Air, Storm",
          "significance": "God of wind, air, and storm. Chief god of Nippur. Wielder of authority.",
          "impact": "Enlil worship central to Sumerian religion.",
          "dangerLevel": 85,
          "alterEgos": "The Storm God (weather form), Authority Bringer (command form)",
          "relationships": "Father: Anu. Children: Ninurta and others. Wielder of: authority.",
          "powers": "Wind control, storm summoning, authority granting, cosmic order maintenance",
          "temples": "Great temple at Nippur",
          "worshipers": "Estimated 5+ million in ancient Sumer",
          "history": "Chief deity of Nippur and Sumerian civilization",
          "popularity": 75
        },
        {
          "id": "enki",
          "name": "Enki",
          "type": "God",
          "domain": "Water, Wisdom, Magic, Creation",
          "parents": [
            "Anu"
          ],
          "children": [
            "Marduk",
            "Many others"
          ],
          "consort": "Ninhursag",
          "symbols": "Water, Wisdom, Magic",
          "significance": "God of fresh water, wisdom, and magic. Creator of humans.",
          "impact": "Enki worship important to Sumerian civilization.",
          "dangerLevel": 70,
          "alterEgos": "The Wise One (wisdom form), Water Master (aquatic form)",
          "relationships": "Father: Anu. Children: Marduk and others. Partner: Ninhursag.",
          "powers": "Water control, wisdom granting, magic mastery, human creation",
          "temples": "Temple at Eridu (oldest Sumerian temple)",
          "worshipers": "Estimated 5+ million in ancient Sumer",
          "history": "Central to Sumerian creation and civilization myths",
          "popularity": 80
        }
      ],
      "founded": "c. 3500-1900 BCE"
    },
    "inca": {
      "name": "Incan Mythology",
      "description": "Mythology of the Incan Empire of South America",
      "deities": [
        {
          "id": "inti",
          "name": "Inti",
          "type": "God",
          "domain": "Sun, Light, Royalty, Prosperity",
          "parents": [],
          "children": [
            "Manco Capac",
            "Mama Ocllo"
          ],
          "consort": "Mama Quilla",
          "symbols": "Sun, Gold, Fire",
          "significance": "Incan sun god. Divine ancestor of Incan royal family.",
          "impact": "Inti worship central to Incan civilization and identity.",
          "dangerLevel": 70,
          "alterEgos": "The Sun God (solar form), Divine Ancestor (royal form)",
          "relationships": "Children: Manco Capac and Mama Ocllo (founders of Cusco). Divine ancestor of: Incan emperors.",
          "powers": "Sun control, light creation, royal blessing, prosperity granting",
          "temples": "Temple of the Sun in Cusco (Coricancha)",
          "worshipers": "Estimated 5+ million in Incan Empire",
          "history": "Central to Incan civilization and empire",
          "popularity": 75
        },
        {
          "id": "mama_quilla",
          "name": "Mama Quilla",
          "type": "Goddess",
          "domain": "Moon, Women, Fertility, Time",
          "parents": [],
          "children": [],
          "consort": "Inti",
          "symbols": "Moon, Silver, Fertility",
          "significance": "Incan moon goddess. Protective of women and fertility.",
          "impact": "Mama Quilla worship important to Incan women.",
          "dangerLevel": 50,
          "alterEgos": "The Moon Goddess (lunar form), Fertility Bringer (fertility form)",
          "relationships": "Husband: Inti. Protector: of women and children.",
          "powers": "Moon control, fertility granting, protection of women, time influence",
          "temples": "Moon temples throughout Incan Empire",
          "worshipers": "Estimated 5+ million in Incan Empire",
          "history": "Important to Incan women and fertility beliefs",
          "popularity": 65
        },
        {
          "id": "viracocha",
          "name": "Viracocha",
          "type": "Creator God",
          "domain": "Creation, Civilization, Primordial Forces",
          "parents": [],
          "children": [
            "All creation"
          ],
          "consort": null,
          "symbols": "Creation, Civilization, Primordial",
          "significance": "Supreme creator god in Incan mythology. Created the world and civilization.",
          "impact": "Viracocha worship foundational to pre-Incan civilizations.",
          "dangerLevel": 95,
          "alterEgos": "The Creator (creation form), Civilization Bringer (cultural form)",
          "relationships": "Creator of: all existence and civilization.",
          "powers": "Creation mastery, civilization establishment, universe control",
          "temples": "Temples throughout Incan Empire, especially at Lake Titicaca",
          "worshipers": "Estimated 5+ million through pre-Incan and Incan periods",
          "history": "Supreme creator deity in Incan cosmology",
          "popularity": 80
        }
      ]
    },
    "mayan": {
      "name": "Mayan Mythology",
      "description": "Mythology of the Maya civilization of Mesoamerica",
      "deities": [
        {
          "id": "hunab_ku",
          "name": "Hunab Ku",
          "type": "Supreme God",
          "domain": "Creation, Supreme Being, Cosmic Force",
          "parents": [],
          "children": [
            "All gods"
          ],
          "consort": null,
          "symbols": "Creation, Cosmic Force",
          "significance": "Supreme Mayan creator god. Source of all life and cosmic order.",
          "impact": "Hunab Ku concept central to Mayan cosmology.",
          "dangerLevel": 95,
          "alterEgos": "The Creator (creation form), Cosmic Force (universal form)",
          "relationships": "Creator of: all gods and existence.",
          "powers": "Creation mastery, cosmic order establishment, universe control",
          "temples": "Sacred temples throughout Mayan lands",
          "worshipers": "Estimated 5+ million throughout Mayan history",
          "history": "Supreme creator in Mayan cosmology",
          "popularity": 70
        },
        {
          "id": "kukulkan",
          "name": "Kukulkan",
          "type": "God",
          "domain": "Wind, Rain, Feathered Serpent, Creation",
          "parents": [],
          "children": [],
          "consort": null,
          "symbols": "Feathered Serpent, Wind, Rain",
          "significance": "Feathered serpent god. Associated with wind and rain. Bringer of civilization.",
          "impact": "Kukulkan worship widespread among Maya. Equated with Quetzalcoatl.",
          "dangerLevel": 70,
          "alterEgos": "Feathered Serpent (creation form), Wind God (weather form)",
          "relationships": "Creator of: civilization and knowledge.",
          "powers": "Wind control, rain summoning, feathered serpent manifestation, civilization granting",
          "temples": "Temple of Kukulkan at Chichen Itza (iconic pyramid)",
          "worshipers": "Estimated 5+ million throughout Mayan history",
          "history": "Central to Mayan religion and pyramid worship",
          "popularity": 80
        },
        {
          "id": "hero_twins",
          "name": "Hero Twins (Hunahpu and Xbalanque)",
          "type": "Demigods/Heroes",
          "domain": "Heroism, Underworld, Ball Game, Creation",
          "parents": [
            "Hun Hunahpu"
          ],
          "children": [],
          "consort": null,
          "symbols": "Ball Game, Hero, Underworld",
          "significance": "Twin heroes of Popol Vuh. Defeated Xibalba Lords. Creators of humans.",
          "impact": "Hero Twin myth central to Mayan cosmology and creation.",
          "dangerLevel": 70,
          "alterEgos": "Ball Players (sports form), Underworld Heroes (adventurer form)",
          "relationships": "Father: Hun Hunahpu. Defeated: Xibalba Lords. Created: humans.",
          "powers": "Heroic prowess, underworld navigation, ball game mastery, creation power",
          "temples": "Ball courts throughout Mayan lands",
          "worshipers": "Estimated 5+ million throughout Mayan history",
          "history": "Central figures in Popol Vuh creation myth",
          "popularity": 70
        }
      ],
      "founded": "c. 2000 BCE onwards"
    }
  },
  "religions": {
    "christianity": {
      "name": "Christianity",
      "description": "Monotheistic religion based on life and teachings of Jesus Christ, centered on the Trinity",
      "founded": "1st century CE",
      "founders": [
        "Jesus Christ"
      ],
      "holyFigures": [
        {
          "name": "Jesus Christ",
          "role": "Son of God, Messiah, Savior",
          "popularity": 95,
          "significance": "Central figure of Christianity. Believed to be God incarnate. Crucified and resurrected for humanity's salvation. Founder and focus of Christian faith.",
          "domain": "Salvation, Redemption, Divine Compassion, Sacrifice",
          "history": "Born ~4 BCE in Bethlehem, crucified ~30 CE in Jerusalem, resurrection celebrated at Easter",
          "lifespan": "~4 BCE - ~30 CE",
          "key_teachings": [
            "The Kingdom of God is at hand",
            "Love your neighbor as yourself",
            "Forgiveness and grace",
            "Salvation through faith"
          ],
          "impact": "Founded Christianity, most influential figure in Western civilization",
          "symbols": [
            "Cross",
            "Fish",
            "Lamb of God"
          ],
          "celebrations": "Christmas (birth), Easter (resurrection)"
        },
        {
          "name": "God (The Father)",
          "role": "Supreme Creator, Almighty",
          "popularity": 95,
          "significance": "Supreme being and creator of all existence. Part of the Trinity. Omnipotent, omniscient, and eternal. Represents authority, judgment, and unconditional love.",
          "domain": "Creation, Divine Authority, Justice, Love",
          "history": "Eternal being transcending time and space"
        },
        {
          "name": "The Holy Spirit",
          "role": "Divine Spirit, Comforter, Sanctifier",
          "popularity": 85,
          "significance": "Third person of the Trinity. Divine presence indwelling believers. Provides spiritual guidance, comfort, and empowerment. Active in salvation and sanctification.",
          "domain": "Divine Presence, Spiritual Empowerment, Guidance, Comfort",
          "history": "Eternal, sent by God after Jesus ascension"
        },
        {
          "name": "Mary (Mother of Jesus)",
          "role": "Mother of God, Virgin Mary",
          "popularity": 80,
          "significance": "Mother of Jesus Christ. Perpetual virgin (Catholic/Orthodox). Venerated as intercessor. Model of faith and obedience. Immaculately conceived (Catholic doctrine).",
          "domain": "Motherhood, Divine Mercy, Intercession, Compassion",
          "history": "Born ~20 BCE, virgin birth of Jesus ~4 BCE, bodily assumption (Catholic/Orthodox)"
        }
      ],
      "majorBranches": [
        "Roman Catholic (1.2+ billion)",
        "Protestant (800+ million)",
        "Eastern Orthodox (250+ million)"
      ],
      "holySites": [
        "Vatican City",
        "Jerusalem (Church of the Holy Sepulchre)",
        "Santiago de Compostela",
        "Rome",
        "Lourdes",
        "Fatima"
      ],
      "holyText": "The Bible (Old Testament and New Testament), Church Traditions",
      "centralBeliefs": "Salvation through Jesus Christ, Resurrection, Trinity (Father, Son, Holy Spirit), Eternal life, Divine grace, Redemption through faith",
      "practices": "Prayer, Bible reading, Church attendance, Sacraments, Worship services, Confession, Fasting, Pilgrimage",
      "followers": "2.4+ billion (largest religion)",
      "denominations": [
        {
          "name": "Catholicism",
          "founded": "33 CE (formalized 1054 CE)",
          "followers": "1.3 billion",
          "characteristics": "Papal authority, Mary veneration, sacraments, apostolic succession",
          "practices": "Mass, confession, penance, rosary"
        },
        {
          "name": "Protestantism",
          "founded": "1517 CE",
          "followers": "900 million",
          "characteristics": "Sola scriptura (scripture alone), faith alone, priest of all believers",
          "practices": "Bible study, baptism, communion"
        },
        {
          "name": "Eastern Orthodox",
          "founded": "1054 CE (split from Catholicism)",
          "followers": "260 million",
          "characteristics": "Icon veneration, liturgical tradition, apostolic succession",
          "practices": "Divine Liturgy, veneration of icons, fasting"
        },
        {
          "name": "Baptist",
          "founded": "1609 CE",
          "followers": "170 million",
          "characteristics": "Adult baptism, congregational autonomy, individual conscience",
          "practices": "Believer's baptism, congregational governance, Bible-centered"
        },
        {
          "name": "Pentecostal",
          "founded": "1901 CE",
          "followers": "280 million",
          "characteristics": "Holy Spirit baptism, speaking in tongues, divine healing",
          "practices": "Spirit-filled worship, glossolalia, prophecy"
        },
        {
          "name": "Methodist",
          "founded": "1739 CE",
          "followers": "80 million",
          "characteristics": "Methodical approach to holiness, social justice",
          "practices": "Class meetings, emphasis on sanctification"
        }
      ],
      "overview": "Monotheistic faith centered on Jesus Christ as the Son of God and Savior. Emphasizes salvation through faith, grace, redemption, and the Trinity (Father, Son, Holy Spirit). World's largest religion with billions of followers.",
      "branches": [
        {
          "name": "Western Christianity",
          "description": "Includes Catholic and Protestant traditions that developed in Western Europe and the Americas"
        },
        {
          "name": "Eastern Christianity",
          "description": "Includes Orthodox and Eastern Catholic churches with distinct theology and practices"
        },
        {
          "name": "Pentecostal/Charismatic",
          "description": "Modern movements emphasizing Holy Spirit baptism, speaking in tongues, and divine healing"
        }
      ]
    },
    "islam": {
      "name": "Islam",
      "description": "Monotheistic religion based on teachings of Prophet Muhammad revealed through the Quran",
      "founded": "7th century CE (610 CE)",
      "founders": [
        "Prophet Muhammad"
      ],
      "holyFigures": [
        {
          "name": "Allah",
          "role": "Supreme God, The One",
          "popularity": 95,
          "significance": "The one God of Islam. Creator of universe and all existence. Omnipotent, omniscient, and merciful. Transcendent yet close to believers. Central to all Islamic faith and practice.",
          "domain": "Creation, Divine Unity, Justice, Mercy, Guidance",
          "history": "Eternal being revealed throughout Islamic history"
        },
        {
          "name": "Prophet Muhammad",
          "role": "Final Prophet, Seal of the Prophets",
          "popularity": 95,
          "significance": "Final and greatest prophet of Islam. Received the Quran from Allah. Model of perfect human behavior (Sunnah). Founded Islamic state and community. Established principles of Islamic law.",
          "domain": "Prophecy, Divine Revelation, Spiritual Leadership, Justice",
          "history": "Born 570 CE in Mecca, received first revelation 610 CE, died 632 CE"
        },
        {
          "name": "Abraham (Ibrahim)",
          "role": "Patriarch, Friend of Allah",
          "popularity": 90,
          "significance": "Patriarch and father of monotheism in Islam. Tested by Allah with ultimate trial. Built the Kaaba with Ishmael. Model of faith and obedience. Called 'Friend of Allah'.",
          "domain": "Faith, Obedience, Patriarchy, Monotheism",
          "history": "Ancient patriarch recognized as forefather of Arab peoples through Ishmael"
        }
      ],
      "majorBranches": [
        "Sunni (85%, 1.53+ billion)",
        "Shia (15%, 230+ million)",
        "Sufism (mystical Islam)"
      ],
      "holySites": [
        "Mecca (Kaaba)",
        "Medina (Prophet's Mosque)",
        "Jerusalem (Al-Aqsa Mosque, Dome of the Rock)"
      ],
      "holyText": "The Quran, Hadith, Sunnah",
      "centralBeliefs": "Monotheism (Tawhid), Five Pillars, Muhammad as final prophet, Resurrection, Judgment Day, Divine predestination",
      "practices": "Prayer (5 times daily), Fasting (Ramadan), Pilgrimage (Hajj), Charity (Zakat), Testimony of faith (Shahada)",
      "followers": "1.8+ billion (2nd largest religion)",
      "denominations": [
        {
          "name": "Sunni",
          "founded": "632 CE (after Prophet Muhammad)",
          "followers": "1.8 billion",
          "characteristics": "Majority tradition, acceptance of first four caliphs, Sharia law",
          "practices": "Five Pillars, Qur'an, Hadith, Ijma'"
        },
        {
          "name": "Shia",
          "founded": "680 CE (Karbala succession)",
          "followers": "300 million",
          "characteristics": "Imam leadership, hidden Imam concept, esoteric interpretation",
          "practices": "Wilayah, Taqiyyah (dissimulation), Muharram mourning"
        },
        {
          "name": "Sufi",
          "founded": "8th century CE",
          "followers": "50-100 million",
          "characteristics": "Mystical spirituality, spiritual orders (tariqahs), ecstatic states",
          "practices": "Dhikr (remembrance), Whirling dervish ceremony, music"
        }
      ],
      "overview": "Monotheistic faith founded by Prophet Muhammad, emphasizing submission to Allah (God). Core practices include Five Pillars, Qur'an study, and Shariah law. Emphasizes justice, charity, and community.",
      "branches": [
        {
          "name": "Sunni Islam",
          "description": "The majority branch following the Sunnah (practices of Prophet Muhammad) and caliphate tradition"
        },
        {
          "name": "Shia Islam",
          "description": "Branch emphasizing Imam leadership, hidden Imam theology, and distinct ritual practices"
        },
        {
          "name": "Sufi Islam",
          "description": "Mystical branch emphasizing direct spiritual experience and ecstatic union with Allah"
        }
      ]
    },
    "hinduism": {
      "name": "Hinduism",
      "description": "Diverse religious and philosophical tradition with polytheistic theology and rich mythology",
      "founded": "c. 1500 BCE (Vedic period)",
      "founders": [
        "Ancient sages and philosophers"
      ],
      "holyFigures": [
        {
          "name": "Brahman",
          "role": "Ultimate Reality, Supreme Consciousness",
          "popularity": 90,
          "significance": "The absolute, eternal, infinite spiritual force underlying all existence. Not a personal god but ultimate reality. Source of all creation and consciousness. Goal of Hindu spiritual practice is union with Brahman (Moksha).",
          "domain": "Ultimate Reality, Consciousness, Existence, Liberation",
          "history": "Eternal and transcendent, beyond time and space"
        },
        {
          "name": "Trimurti (Brahma, Vishnu, Shiva)",
          "role": "Trinity of Gods - Creator, Preserver, Destroyer",
          "popularity": 90,
          "significance": "Manifestation of Brahman in three forms. Brahma creates, Vishnu preserves, Shiva destroys and transforms. Each represents cosmic functions. Eternal divine cycle.",
          "domain": "Creation, Preservation, Transformation, Cosmic Cycles",
          "history": "Eternal divine manifestation"
        },
        {
          "name": "Krishna",
          "role": "Avatar of Vishnu, Divine Teacher, Beloved",
          "popularity": 95,
          "significance": "Eighth avatar of Vishnu. Central figure in Bhagavad Gita. Teacher of dharma and yoga. Symbol of divine love and compassion. Exemplar of divine play and perfect devotion.",
          "domain": "Divine Love, Dharma, Spiritual Wisdom, Joy",
          "history": "Avatar of Vishnu in Dvapara Yuga era of Hindu cosmology",
          "lifespan": "Mythological (estimated 1200 BCE or earlier in tradition)",
          "key_teachings": [
            "Bhagavad Gita teachings",
            "Dharma (duty)",
            "Devotion (Bhakti)",
            "Divine play (Lila)"
          ],
          "impact": "Eighth avatar of Vishnu, central to Hindu devotional practice",
          "symbols": [
            "Flute",
            "Peacock feather",
            "Lotus",
            "Chakra"
          ],
          "celebrations": "Janmashtami (birth celebration), Holi"
        },
        {
          "name": "Rama",
          "role": "Avatar of Vishnu, Ideal King, Symbol of Dharma",
          "popularity": 95,
          "significance": "Seventh avatar of Vishnu. Hero of Ramayana. Symbol of ideal kingship, duty, and righteousness. Exemplar of perfect son, brother, husband, and king. Defeated demon Ravana.",
          "domain": "Righteousness, Duty, Ideal Leadership, Virtue",
          "history": "Avatar of Vishnu in Treta Yuga"
        }
      ],
      "majorBranches": [
        "Vaishnavism (600+ million)",
        "Shaivism (600+ million)",
        "Shaktism (Goddess devotion)",
        "Smartism (philosophical)"
      ],
      "holySites": [
        "Varanasi (Ganges, holiest)",
        "Mathura (Krishna)",
        "Ayodhya (Rama)",
        "Rameswaram",
        "Himalayan mountains"
      ],
      "holyText": "Vedas, Upanishads, Bhagavad Gita, Mahabharata, Ramayana, Puranas",
      "centralBeliefs": "Dharma (duty), Karma (action/consequence), Samsara (rebirth), Moksha (liberation), Brahman (ultimate reality)",
      "practices": "Puja (worship), Meditation, Yoga, Pilgrimage, Mantra recitation, Scripture study, Festival celebration",
      "followers": "1.4+ billion (3rd largest religion)",
      "denominations": [
        {
          "name": "Vaishnavism",
          "founded": "Ancient",
          "followers": "900 million",
          "characteristics": "Devotion to Vishnu/Krishna, Bhakti tradition",
          "practices": "Krishna worship, mantra recitation, pilgrimage"
        },
        {
          "name": "Shaivism",
          "founded": "Ancient",
          "followers": "200 million",
          "characteristics": "Devotion to Shiva, tantra, meditation",
          "practices": "Shiva meditation, asceticism, yoga"
        },
        {
          "name": "Shaktism",
          "founded": "Ancient",
          "followers": "100 million",
          "characteristics": "Worship of divine feminine (Shakti), Devi worship",
          "practices": "Goddess puja, tantra, ritual"
        }
      ],
      "overview": "Ancient polytheistic faith with billions of followers. Emphasizes dharma (duty), karma, and reincarnation. Celebrates diverse deities, yoga, meditation, and the pursuit of moksha (liberation).",
      "branches": [
        {
          "name": "Vaishnavism",
          "description": "Devotion to Vishnu and Krishna, emphasis on Bhakti (devotional love)"
        },
        {
          "name": "Shaivism",
          "description": "Worship of Shiva, emphasis on meditation, yoga, and transcendence"
        },
        {
          "name": "Shaktism",
          "description": "Worship of Shakti (divine feminine), goddess-centered spirituality"
        }
      ]
    },
    "buddhism": {
      "name": "Buddhism",
      "description": "Spiritual tradition based on teachings of Siddhartha Gautama (the Buddha) about suffering and enlightenment",
      "founded": "6th-5th century BCE",
      "founders": [
        "Siddhartha Gautama (The Buddha)"
      ],
      "holyFigures": [
        {
          "name": "Siddhartha Gautama (The Buddha)",
          "role": "Enlightened One, Teacher, Founder",
          "popularity": 95,
          "significance": "Founder of Buddhism. Achieved enlightenment and taught the path to liberation from suffering (Nirvana). Rejected extreme asceticism and indulgence. Perfect example of human potential for awakening.",
          "domain": "Enlightenment, Spiritual Awakening, Compassion, Wisdom",
          "history": "Born ~563 BCE as Prince Siddhartha, achieved enlightenment ~528 BCE, taught 45 years, died ~483 BCE"
        },
        {
          "name": "Bodhisattvas",
          "role": "Enlightened Beings, Compassionate Helpers",
          "popularity": 75,
          "significance": "Beings achieving enlightenment but postponing final liberation to help others. Models of compassion and wisdom. Include Avalokiteshvara (compassion) and Manjushri (wisdom).",
          "domain": "Compassion, Wisdom, Enlightenment, Spiritual Guidance",
          "history": "Eternal figures in Buddhist cosmology"
        }
      ],
      "majorBranches": [
        "Theravada (Southeast Asia, 170+ million)",
        "Mahayana (East Asia, 250+ million)",
        "Vajrayana (Tibet, 30+ million)"
      ],
      "holySites": [
        "Bodh Gaya (enlightenment)",
        "Sarnath (first sermon)",
        "Kushinagar (death)",
        "Lumbini (birth)"
      ],
      "holyText": "Tripitaka, Mahayana Sutras, Tibetan Buddhist texts",
      "centralBeliefs": "Four Noble Truths, Eightfold Path, Nirvana (liberation), No eternal soul, Impermanence, Karma",
      "practices": "Meditation, Mindfulness, Dharma study, Monastic discipline, Ethical conduct",
      "followers": "500+ million (4th largest religion)",
      "denominations": [
        {
          "name": "Theravada",
          "founded": "250 BCE (after Ashoka)",
          "followers": "150 million",
          "characteristics": "Oldest surviving school, individual enlightenment, monastic focus",
          "practices": "Meditation, monastic discipline, Pali Canon"
        },
        {
          "name": "Mahayana",
          "founded": "100 CE",
          "followers": "500 million",
          "characteristics": "Bodhisattva path, multiple buddhas, lay practice",
          "practices": "Buddha veneration, chanting, visualization"
        },
        {
          "name": "Vajrayana",
          "founded": "500 CE",
          "followers": "20 million",
          "characteristics": "Tantric practices, lama guidance, rapid enlightenment",
          "practices": "Mantra, mandala, guru-student relationship"
        }
      ],
      "overview": "Spiritual tradition centered on Buddha's teachings on suffering, enlightenment, and the Middle Way. Emphasizes mindfulness, meditation, and the Noble Eightfold Path. Non-theistic approach to spirituality.",
      "branches": [
        {
          "name": "Theravada Buddhism",
          "description": "The original school emphasizing individual enlightenment and monastic traditions"
        },
        {
          "name": "Mahayana Buddhism",
          "description": "The bodhisattva path where enlightenment benefits all beings"
        },
        {
          "name": "Vajrayana Buddhism",
          "description": "Tantric Buddhism emphasizing transformation and rapid enlightenment"
        }
      ]
    },
    "judaism": {
      "name": "Judaism",
      "description": "Ancient monotheistic religion and cultural tradition of the Jewish people with Torah-based practices",
      "founded": "c. 2000 BCE (Abraham), formalized c. 1300 BCE (Moses/Torah)",
      "founders": [
        "Abraham",
        "Moses"
      ],
      "holyFigures": [
        {
          "name": "God (YHWH/Yahweh/Adonai)",
          "role": "Supreme Creator, Covenant God",
          "popularity": 90,
          "significance": "The one God of Judaism. Creator of universe. Established covenants with Abraham and Moses. Central to Jewish identity and spiritual practice throughout history.",
          "domain": "Creation, Covenant, Divine Law, Justice",
          "history": "Eternal being revealed through Torah and prophets"
        },
        {
          "name": "Abraham",
          "role": "Patriarch, Father of Faith",
          "popularity": 90,
          "significance": "Founder of Judaism covenant with God. Father of Jewish people. Model of faith and obedience. Willing to sacrifice son Isaac. Established monotheism.",
          "domain": "Faith, Covenant, Patriarchy, Righteousness",
          "history": "Ancient patriarch, lived c. 2000 BCE"
        },
        {
          "name": "Moses",
          "role": "Lawgiver, Prophet, Liberator",
          "popularity": 90,
          "significance": "Received Torah from God on Mount Sinai. Led Jewish people from Egyptian slavery. Greatest prophet in Judaism. Established Jewish law and religious practice.",
          "domain": "Divine Law, Liberation, Prophecy, Spiritual Leadership",
          "history": "Born c. 1400 BCE, received Torah c. 1300 BCE, led exodus from Egypt"
        }
      ],
      "majorBranches": [
        "Orthodox (40%)",
        "Conservative (30%)",
        "Reform (20%)",
        "Reconstructionist"
      ],
      "holySites": [
        "Jerusalem (Western Wall, Temple Mount)",
        "Mount Sinai",
        "Dead Sea"
      ],
      "holyText": "Torah, Tanakh (Hebrew Bible), Talmud",
      "centralBeliefs": "Monotheism, Torah as divine law, Covenant with God, Redemption and Messianic hope, Tikkun Olam (repairing world)",
      "practices": "Torah study, Prayer, Observance of Commandments, Sabbath (Shabbat), Festivals, Dietary laws (Kosher)",
      "followers": "15+ million worldwide",
      "overview": "Ancient monotheistic faith with Torah as foundation. Emphasizes covenant with God, ethical living, and community. Rich tradition of interpretation, prayer, and observance of mitzvot (commandments).",
      "branches": [
        {
          "name": "Orthodox Judaism",
          "description": "Strict observance of Torah and Talmudic law with traditional practices"
        },
        {
          "name": "Conservative Judaism",
          "description": "Balance between tradition and modern interpretation of Jewish law"
        },
        {
          "name": "Reform Judaism",
          "description": "Modern adaptation emphasizing universal Jewish principles over strict observance"
        }
      ]
    },
    "zoroastrianism": {
      "name": "Zoroastrianism",
      "description": "Ancient Persian monotheistic religion, one of humanity's oldest organized faiths",
      "founded": "c. 1500-600 BCE",
      "founders": [
        "Zoroaster (Zarathustra)"
      ],
      "holyFigures": [
        {
          "name": "Ahura Mazda",
          "role": "Supreme Creator, Wise Lord",
          "popularity": 75,
          "significance": "Supreme god and creator of all good. Wise, just, and merciful. Represents light, goodness, and order. Eternal struggle against evil (Ahriman).",
          "domain": "Creation, Wisdom, Good, Light, Justice",
          "history": "Eternal deity revealed to Zoroaster"
        },
        {
          "name": "Zoroaster (Zarathustra)",
          "role": "Prophet, Founder",
          "popularity": 75,
          "significance": "Founder of Zoroastrianism. Received divine revelation from Ahura Mazda. Taught monotheism and cosmic dualism. One of humanity's first organized religions.",
          "domain": "Prophecy, Divine Revelation, Spiritual Leadership",
          "history": "Lived c. 1500-600 BCE (date uncertain)"
        }
      ],
      "majorBranches": [
        "Ancient Zoroastrianism",
        "Zurvanism",
        "Modern Zoroastrianism"
      ],
      "holySites": [
        "Fire temples in Iran and worldwide",
        "Mount Hara (spiritual center)"
      ],
      "holyText": "Avesta, Yasnas, Yashts, Vendidad",
      "centralBeliefs": "Monotheism, Dualism (good vs evil), Free will, Judgment after death, Resurrection, Final victory of good",
      "practices": "Fire worship, Prayer, Purity (ritual and moral), Charity, Good thoughts, words, and deeds",
      "followers": "100,000+ worldwide",
      "overview": "Ancient Persian monotheistic faith emphasizing cosmic struggle between good (Ahura Mazda) and evil (Angra Mainyu). Influential on later religions, emphasizing free will and moral choice.",
      "branches": [
        {
          "name": "Parsi Zoroastrianism",
          "description": "Zoroastrian tradition preserved by Parsi communities in India"
        },
        {
          "name": "Iranian Zoroastrianism",
          "description": "Zoroastrian traditions continued in Iran with local adaptations"
        }
      ]
    },
    "sikhism": {
      "name": "Sikhism",
      "description": "Monotheistic religion founded in Punjab combining Hindu and Islamic influences with emphasis on equality",
      "founded": "15th century CE (1469 CE)",
      "founders": [
        "Guru Nanak"
      ],
      "holyFigures": [
        {
          "name": "Ik Onkar (The One)",
          "role": "Supreme God, Ultimate Reality",
          "popularity": 85,
          "significance": "One eternal God. Creator of all existence. Transcendent and immanent. Central concept in Sikhism - belief in one unified divine reality. Beyond gender, form, and attributes.",
          "domain": "Creation, Divine Unity, Eternity, Truth",
          "history": "Eternal being"
        },
        {
          "name": "Guru Nanak",
          "role": "First Guru, Founder, Spiritual Teacher",
          "popularity": 85,
          "significance": "Founder of Sikhism. First of ten human Gurus. Preached monotheism, equality, and social justice. Rejected caste system. Established langar (community kitchen).",
          "domain": "Spiritual Leadership, Equality, Social Justice, Divine Truth",
          "history": "Born 1469 CE in Punjab, died 1539 CE"
        }
      ],
      "majorBranches": [
        "Khalsa (orthodox)",
        "Non-Khalsa"
      ],
      "holySites": [
        "Golden Temple (Amritsar, holiest)",
        "Gurdwaras worldwide"
      ],
      "holyText": "Guru Granth Sahib, Writings of the Gurus",
      "centralBeliefs": "One God, Equality of all, Karma and rebirth, Salvation through grace, Community service (Seva)",
      "practices": "Prayer, Meditation, Community service, Langar, Khalsa initiation, Religious symbols",
      "followers": "30+ million worldwide",
      "overview": "Indian faith emphasizing one God (Ik Onkar), equality of all humans, and spiritual practice. Celebrates Guru Nanak's teachings, communal service (seva), and distinctive turbans and uncut hair.",
      "branches": [
        {
          "name": "Khalsa",
          "description": "Initiated Sikhs following strict codes of conduct and appearance"
        },
        {
          "name": "Sahajdhari",
          "description": "Sikhs who practice core beliefs without initiating into the Khalsa"
        }
      ]
    },
    "taoism": {
      "name": "Taoism/Daoism",
      "description": "Chinese philosophical and spiritual tradition based on harmony with the Tao",
      "founded": "6th century BCE (philosophical), 2nd century CE (religious)",
      "founders": [
        "Laozi (attributed)"
      ],
      "holyFigures": [
        {
          "name": "The Tao",
          "role": "Ultimate Reality, The Way",
          "popularity": 80,
          "significance": "The way, path, ultimate principle underlying all existence. Beyond description or form. Source of all phenomena. Harmonizing with Tao leads to peace and enlightenment.",
          "domain": "Ultimate Reality, Natural Harmony, Cosmic Order",
          "history": "Eternal and transcendent"
        },
        {
          "name": "Laozi",
          "role": "Philosopher, Sage, Founder",
          "popularity": 75,
          "significance": "Attributed author of Tao Te Ching. Founder of philosophical Taoism. Emphasized living in harmony with nature and simplicity. Deified in religious Taoism.",
          "domain": "Wisdom, Harmony, Philosophy, Spiritual Leadership",
          "history": "Lived c. 6th century BCE"
        }
      ],
      "majorBranches": [
        "Philosophical Taoism",
        "Religious Taoism",
        "Popular Taoism"
      ],
      "holySites": [
        "Sacred mountains (Wudang, Wutai, Emei)",
        "Taoist temples"
      ],
      "holyText": "Tao Te Ching, Zhuangzi, Taoist Canons, Internal Alchemy texts",
      "centralBeliefs": "Harmony with Tao, Wu Wei (non-action), Yin-Yang balance, Qi cultivation, Immortality, Return to simplicity",
      "practices": "Meditation, Tai Chi, Qigong, Feng Shui, Alchemy, Rituals, Scripture study",
      "followers": "12+ million worldwide",
      "overview": "Chinese philosophical tradition emphasizing Tao (the Way) and living in harmony with nature. Blends philosophy, spirituality, and folk practices. Values simplicity, spontaneity, and balance.",
      "branches": [
        {
          "name": "Philosophical Taoism",
          "description": "Emphasis on Taoist philosophy, natural living, and harmony with the Tao"
        },
        {
          "name": "Religious Taoism",
          "description": "Worship of Taoist deities, rituals, and organized priesthood"
        }
      ]
    },
    "shintoism": {
      "name": "Shintoism",
      "description": "Indigenous religion of Japan based on worship of nature spirits (kami) and reverence for ancestors",
      "founded": "Ancient (prehistory), formalized c. 700 CE",
      "founders": [
        "Indigenous tradition (no single founder)"
      ],
      "holyFigures": [
        {
          "name": "Kami",
          "role": "Nature Spirits, Divine Beings",
          "popularity": 85,
          "significance": "Infinite divine spirits inhabiting natural phenomena - mountains, rivers, trees. Ancestors become kami. Represent sacred aspects of nature. Possess supernatural powers.",
          "domain": "Nature Spirits, Sacred Essence, Natural Forces",
          "history": "Eternal and omnipresent in nature"
        },
        {
          "name": "Amaterasu Omikami",
          "role": "Sun Goddess, Divine Ancestor of Emperor",
          "popularity": 90,
          "significance": "Supreme kami in Shinto. Sun goddess. Divine ancestor of Japanese imperial family. Holiest kami. Central to Japanese identity and imperial authority.",
          "domain": "Sun, Light, Imperial Authority, Divine Ancestry",
          "history": "Eternal primordial kami from Japanese creation myth"
        }
      ],
      "majorBranches": [
        "Shrine Shinto",
        "Sect Shinto",
        "Folk Shinto"
      ],
      "holySites": [
        "Ise Grand Shrine (holiest)",
        "Meiji Shrine",
        "Fushimi Inari Shrine",
        "Mount Fuji"
      ],
      "holyText": "Kojiki, Nihon Shoki, Shrine traditions",
      "centralBeliefs": "Kami veneration, Purity and purification, Harmony with nature, Emperor veneration, Ancestor respect",
      "practices": "Shrine visits, Purification rituals, Festival participation, Torii gates, Protective amulets",
      "followers": "100+ million in Japan",
      "overview": "Japanese indigenous religion emphasizing reverence for kami (spirits) in nature. Celebrates seasonal festivals, purification rituals, and harmony with the natural world."
    },
    "bahai": {
      "name": "Bahai Faith",
      "description": "Monotheistic religion emphasizing unity of humanity and all religions, world peace, and spiritual principles",
      "founded": "19th century CE (1844 CE)",
      "founders": [
        "The Bab (Herald)",
        "Bahaullah (Founder)"
      ],
      "holyFigures": [
        {
          "name": "Bahaullah",
          "role": "Manifestation of God, Founder",
          "popularity": 75,
          "significance": "Latest manifestation of God for this age. Founder of Bahai Faith. Proclaimed establishment of Kingdom of God on earth. Emphasized unity of humanity and world peace.",
          "domain": "Divine Manifestation, Unity, World Peace, Spiritual Leadership",
          "history": "Born 1817 CE, proclaimed prophethood 1863 CE, died 1892 CE"
        },
        {
          "name": "The Bab",
          "role": "Herald, Forerunner",
          "popularity": 70,
          "significance": "Forerunner of Bahaullah. Founder of Babi religion. Proclaimed coming of 'He whom God shall make manifest'. Martyred for faith. Represents preparatory revelation.",
          "domain": "Divine Herald, Spiritual Preparation, Truth",
          "history": "Born 1819 CE, proclaimed prophethood 1844 CE, executed 1850 CE"
        }
      ],
      "majorBranches": [
        "Orthodox Bahai (majority)",
        "Independent Bahai (minority)"
      ],
      "holySites": [
        "Bahai World Centre (Haifa, Israel)",
        "Shrine of the Bab",
        "Shrine of Bahaullah",
        "Bahai temples worldwide"
      ],
      "holyText": "Writings of Bahaullah, Writings of The Bab, Writings of Abdu'l-Baha",
      "centralBeliefs": "Unity of God, Unity of religions, Unity of humanity, Progressive revelation, World peace, Equality of men and women",
      "practices": "Prayer and meditation, Fasting, Community service, Teaching faith, Scripture study, Holy day celebration",
      "followers": "8+ million worldwide"
    }
  },
  "worldviews": {
    "nihilism": {
      "name": "Nihilism",
      "description": "Philosophical belief that life has no inherent meaning, purpose, or objective moral values",
      "founded": "19th century CE (formalized)",
      "founders": [
        "Friedrich Nietzsche (popularized)",
        "Ivan Turgenev (coined term)"
      ],
      "figures": [
        {
          "name": "Friedrich Nietzsche",
          "role": "Philosopher, Critic of Nihilism",
          "popularity": 85,
          "significance": "German philosopher who extensively analyzed nihilism and critiqued it. Proposed 'will to power' as alternative. Advocated creating one's own meaning rather than accepting nihilistic despair.",
          "domain": "Philosophy, Meaning Creation, Cultural Criticism",
          "history": "Lived 1844-1900 CE, wrote extensively on nihilism and philosophy"
        },
        {
          "name": "Ivan Turgenev",
          "role": "Writer, Term Originator",
          "popularity": 70,
          "significance": "Russian novelist who coined the term 'nihilism' in his 1862 novel 'Fathers and Sons'. Popularized concept through literature and cultural debate.",
          "domain": "Literature, Philosophy, Cultural Ideas",
          "history": "Lived 1818-1883 CE"
        }
      ],
      "coreConcepts": [
        "No inherent meaning in universe",
        "No objective moral values",
        "Rejection of religious/spiritual meaning",
        "Life has no predetermined purpose",
        "Freedom through acceptance of meaninglessness"
      ],
      "critiques": "Criticized for leading to despair, depression, destructive behavior, and lack of motivation for moral action",
      "variations": [
        "Metaphysical Nihilism (nothing exists)",
        "Epistemological Nihilism (knowledge impossible)",
        "Moral Nihilism (no objective morality)",
        "Existential Nihilism (life meaningless)"
      ],
      "followers": "Estimated 5-10 million adherents worldwide (academic and cultural)",
      "response": "Creates opportunity for individual meaning-making and authentic freedom",
      "overview": "Philosophical position rejecting objective meaning, values, and truth. Emphasizes absurdity of existence and rejection of societal conventions. Questions foundations of knowledge and morality."
    },
    "existentialism": {
      "name": "Existentialism",
      "description": "Philosophical movement emphasizing individual existence, freedom, choice, and responsibility to create meaning",
      "founded": "20th century CE (1940s-1950s)",
      "founders": [
        "Jean-Paul Sartre",
        "Simone de Beauvoir",
        "Albert Camus"
      ],
      "figures": [
        {
          "name": "Jean-Paul Sartre",
          "role": "Founder, Atheistic Existentialist",
          "popularity": 85,
          "significance": "French philosopher who formalized existentialism. Argued 'existence precedes essence' - humans have no predefined nature, must create themselves through choices. Emphasized radical freedom and responsibility.",
          "domain": "Philosophy, Ontology, Ethics, Freedom",
          "history": "Lived 1905-1980 CE, published major works 1943-1960",
          "key_works": [
            "Being and Nothingness",
            "Existentialism is a Humanism",
            "Critique of Dialectical Reason"
          ],
          "main_ideas": [
            "Existence precedes essence",
            "Freedom and responsibility",
            "Bad faith",
            "Facticity and transcendence"
          ],
          "influences": [
            "Heidegger",
            "Husserl",
            "Marx"
          ],
          "legacy": "Shaped 20th century philosophy, political activism, intellectual culture",
          "famous_quotes": [
            "Man is condemned to be free",
            "We are our choices"
          ]
        },
        {
          "name": "Simone de Beauvoir",
          "role": "Existentialist Philosopher, Feminist",
          "popularity": 80,
          "significance": "French existentialist philosopher and writer. Applied existentialism to feminist philosophy. Argued for women's freedom and authentic existence. Explored ethics and human relationships.",
          "domain": "Philosophy, Feminism, Ethics, Existentialism",
          "history": "Lived 1908-1986 CE",
          "key_works": [
            "The Second Sex",
            "The Ethics of Ambiguity",
            "She Came to Stay"
          ],
          "main_ideas": [
            "Feminist existentialism",
            "Women's liberation",
            "Ambiguity of human condition"
          ],
          "influences": [
            "Sartre",
            "Husserl",
            "Hegel"
          ],
          "legacy": "Founded modern feminism, existential ethics",
          "famous_quotes": [
            "One is not born, but rather becomes, a woman"
          ]
        },
        {
          "name": "Albert Camus",
          "role": "Absurdist, Existentialist Writer",
          "popularity": 80,
          "significance": "French-Algerian philosopher and writer. Explored 'absurdism' - conflict between human search for meaning and universe's silence. Famous for 'The Stranger' and 'The Myth of Sisyphus'.",
          "domain": "Philosophy, Literature, Absurdism, Meaning",
          "history": "Lived 1913-1960 CE",
          "key_works": [
            "The Stranger",
            "The Myth of Sisyphus",
            "The Rebel"
          ],
          "main_ideas": [
            "Absurdism",
            "Meaninglessness of existence",
            "Rebellion against absurdity"
          ],
          "influences": [
            "Dostoyevsky",
            "Nietzsche",
            "Sartre"
          ],
          "legacy": "Questioned meaning in modern life, ethical philosophy",
          "famous_quotes": [
            "There is one way to happiness and that is to cease worrying"
          ]
        }
      ],
      "coreConcepts": [
        "Existence precedes essence",
        "Radical freedom and choice",
        "Individual responsibility for creating meaning",
        "Authenticity and self-creation",
        "Confronting absurdity and anxiety",
        "Bad faith (self-deception)"
      ],
      "critiques": "Accused of promoting extreme individualism, ignoring social context, leading to relativism",
      "variations": [
        "Atheistic Existentialism (Sartre)",
        "Absurdism (Camus)",
        "Christian Existentialism (Kierkegaard, Buber)"
      ],
      "followers": "Estimated 10-20 million adherents worldwide (academic and cultural)",
      "response": "Humans are radically free and responsible for creating their own meaning through authentic choices",
      "overview": "Philosophy emphasizing individual freedom, responsibility, and authenticity. Focuses on existence preceding essence and the anxiety of freedom. Celebrates personal choice and self-creation.",
      "branches": [
        {
          "name": "Atheistic Existentialism",
          "description": "Existentialism without God (Sartre), emphasizing radical freedom and responsibility"
        },
        {
          "name": "Theistic Existentialism",
          "description": "Existentialism with God (Kierkegaard), emphasizing faith and divine mystery"
        }
      ]
    },
    "stoicism": {
      "name": "Stoicism",
      "description": "Ancient Greek and Roman philosophical school emphasizing virtue, acceptance of fate, and living in harmony with reason",
      "founded": "3rd century BCE (Ancient)",
      "revived": "Modern Stoicism (contemporary)",
      "founders": [
        "Zeno of Citium",
        "Marcus Aurelius (Roman Stoic)"
      ],
      "figures": [
        {
          "name": "Zeno of Citium",
          "role": "Founder of Stoicism",
          "popularity": 70,
          "significance": "Greek philosopher who founded Stoic school c. 300 BCE. Taught that virtue is the highest good and that living in accordance with reason/nature leads to happiness and tranquility.",
          "domain": "Philosophy, Ethics, Logic, Natural Law",
          "history": "Lived c. 334-262 BCE"
        },
        {
          "name": "Marcus Aurelius",
          "role": "Roman Emperor, Stoic Philosopher",
          "popularity": 85,
          "significance": "Roman Emperor and Stoic philosopher. Wrote 'Meditations' - personal reflections on Stoic philosophy. Exemplified Stoic virtue through life and leadership. Famous for accepting duty and natural order.",
          "domain": "Philosophy, Leadership, Ethics, Acceptance",
          "history": "Lived 121-180 CE, ruled Rome 161-180 CE",
          "key_works": [
            "Meditations"
          ],
          "main_ideas": [
            "Virtue is the only good",
            "Acceptance of fate",
            "Living in accord with nature"
          ],
          "influences": [
            "Earlier Stoics",
            "Epictetus"
          ],
          "legacy": "Most famous Stoic philosopher, influential self-help wisdom",
          "famous_quotes": [
            "You have power over your mind not outside events"
          ]
        },
        {
          "name": "Epictetus",
          "role": "Stoic Philosopher, Former Slave",
          "popularity": 75,
          "significance": "Greek Stoic philosopher who was born enslaved. Taught that freedom comes from accepting what we cannot control and exercising virtue in what we can control. Influenced later Stoic thought.",
          "domain": "Philosophy, Ethics, Freedom, Virtue",
          "history": "Lived c. 50-135 CE",
          "key_works": [
            "Enchiridion (Manual)",
            "Discourses"
          ],
          "main_ideas": [
            "Dichotomy of control",
            "Freedom through virtue",
            "Student-teacher philosophy"
          ],
          "influences": [
            "Zeno of Citium",
            "Earlier Stoics"
          ],
          "legacy": "Influenced Marcus Aurelius, modern Cognitive Behavioral Therapy",
          "famous_quotes": [
            "It is impossible for a man to be free when he is a slave to his body"
          ]
        }
      ],
      "coreConcepts": [
        "Virtue is the highest good",
        "Live in accordance with reason/nature",
        "Accept what you cannot control (amor fati)",
        "Focus on what is within your control",
        "Emotional detachment from external events",
        "Duty and acceptance of fate"
      ],
      "critiques": "Accused of promoting emotional suppression, fatalism, and passivity in face of injustice",
      "variations": [
        "Ancient Stoicism (Zeno, Epictetus, Aurelius)",
        "Modern Stoicism (contemporary revival)",
        "Cognitive-Behavioral Stoicism (therapy-based)"
      ],
      "followers": "Estimated 5 million practicing modern Stoics, widespread in leadership and psychology",
      "response": "Freedom and peace come through virtue and accepting what is beyond our control",
      "overview": "Ancient philosophy emphasizing virtue as the highest good and living in accordance with reason. Teaches acceptance of fate, emotional detachment, and inner peace through virtue.",
      "branches": [
        {
          "name": "Early Stoicism",
          "description": "Zeno and early founders emphasizing logic and physics alongside ethics"
        },
        {
          "name": "Roman Stoicism",
          "description": "Later development through Marcus Aurelius and Epictetus focused on practical virtue"
        }
      ]
    },
    "buddhism_philosophy": {
      "name": "Buddhism (Philosophical)",
      "description": "Philosophical worldview emphasizing suffering, impermanence, no-self, and path to liberation through understanding",
      "founded": "6th-5th century BCE",
      "founders": [
        "Siddhartha Gautama (The Buddha)"
      ],
      "figures": [
        {
          "name": "Siddhartha Gautama (The Buddha)",
          "role": "Enlightened One, Teacher",
          "popularity": 95,
          "significance": "Founder of Buddhist philosophy. Achieved enlightenment and taught the Four Noble Truths and Eightfold Path as framework for understanding suffering and liberation.",
          "domain": "Philosophy, Enlightenment, Suffering, Liberation",
          "history": "Born ~563 BCE, achieved enlightenment ~528 BCE, died ~483 BCE"
        }
      ],
      "coreConcepts": [
        "Four Noble Truths (suffering, cause, cessation, path)",
        "Eightfold Path (ethical and mental development)",
        "Impermanence (Anicca)",
        "No permanent self (Anatta)",
        "Dependent origination",
        "Nirvana (liberation from suffering)"
      ],
      "critiques": "Some view as pessimistic (focus on suffering), others criticize as escapist",
      "variations": [
        "Theravada Buddhism (original teachings)",
        "Mahayana Buddhism (expanded tradition)",
        "Zen Buddhism (sudden enlightenment)"
      ],
      "followers": "500+ million Buddhists, millions more study philosophy",
      "response": "Understanding the nature of suffering and impermanence leads to liberation and peace"
    },
    "materialism": {
      "name": "Materialism (Philosophical)",
      "description": "Worldview asserting that only matter/physical substance is real; consciousness and mind arise from physical processes",
      "founded": "Ancient Greece (formalized modern: 17th century onwards)",
      "founders": [
        "Leucippus and Democritus (atomism)",
        "Karl Marx (historical materialism)"
      ],
      "figures": [
        {
          "name": "Democritus",
          "role": "Ancient Materialist Philosopher",
          "popularity": 75,
          "significance": "Ancient Greek philosopher who argued that only atoms and void exist. Everything, including mind and consciousness, results from physical atomic interactions. Pioneer of mechanistic worldview.",
          "domain": "Philosophy, Metaphysics, Ancient Physics",
          "history": "Lived c. 460-370 BCE"
        },
        {
          "name": "Karl Marx",
          "role": "Historical Materialist, Social Theorist",
          "popularity": 85,
          "significance": "German philosopher who developed 'historical materialism' - analysis of history through material economic conditions. Argued economic systems determine social structures, ideology, and consciousness.",
          "domain": "Philosophy, Economics, History, Social Theory",
          "history": "Lived 1818-1883 CE"
        },
        {
          "name": "Ludwig Feuerbach",
          "role": "Materialist Philosopher",
          "popularity": 70,
          "significance": "German philosopher who argued that religion and ideology are human projections of material conditions. Influenced Marx's materialism. Promoted naturalistic philosophy.",
          "domain": "Philosophy, Religion Criticism, Materialism",
          "history": "Lived 1804-1872 CE"
        }
      ],
      "coreConcepts": [
        "Only matter/physical substance is real",
        "Mind arises from brain/physical processes",
        "No supernatural or spiritual reality",
        "Determinism (physical laws govern universe)",
        "Reductionism (complex phenomena reduce to physics)",
        "Historical materialism (economy drives history)"
      ],
      "critiques": "Struggles to explain consciousness and subjective experience, accusations of reductionism",
      "variations": [
        "Metaphysical Materialism (ontological)",
        "Epistemological Materialism (knowledge-based)",
        "Historical Materialism (Marx)",
        "Scientific Materialism (modern physics-based)"
      ],
      "followers": "Estimated 100+ million influenced by materialist worldviews (implicit in many scientists)",
      "response": "Understanding material reality through science explains all phenomena",
      "overview": "Philosophy asserting that physical matter is fundamental reality. Rejects immaterial substances and emphasizes scientific materialism. Foundation for scientific worldview.",
      "branches": [
        {
          "name": "Scientific Materialism",
          "description": "Matter is fundamental, all phenomena reducible to physical processes"
        },
        {
          "name": "Dialectical Materialism",
          "description": "Marxist materialism emphasizing conflict and historical development"
        }
      ]
    },
    "idealism": {
      "name": "Idealism (Philosophical)",
      "description": "Worldview asserting that reality is fundamentally mental, mind-dependent, or composed of ideas/consciousness",
      "founded": "Ancient philosophy (formalized modern: 17th-18th centuries)",
      "founders": [
        "Plato (ancient)",
        "Immanuel Kant (modern)",
        "Georg Hegel"
      ],
      "figures": [
        {
          "name": "Immanuel Kant",
          "role": "Transcendental Idealist",
          "popularity": 85,
          "significance": "German philosopher who developed 'transcendental idealism' - mind structures experience through categories and forms of intuition. Reality as we know it is mind-dependent, though things-in-themselves exist.",
          "domain": "Philosophy, Epistemology, Metaphysics",
          "history": "Lived 1724-1804 CE"
        },
        {
          "name": "Georg Wilhelm Friedrich Hegel",
          "role": "Absolute Idealist, Dialectical Thinker",
          "popularity": 80,
          "significance": "German philosopher who argued reality is the unfolding of Absolute Spirit/Idea through dialectical process. History is rational development of consciousness and freedom. Influenced Marx and modern thought.",
          "domain": "Philosophy, History, Logic, Dialectics",
          "history": "Lived 1770-1831 CE"
        },
        {
          "name": "George Berkeley",
          "role": "Subjective Idealist",
          "popularity": 75,
          "significance": "Irish philosopher who argued that material objects are collections of ideas perceived by minds. 'To be is to be perceived.' Challenged materialism through idealism.",
          "domain": "Philosophy, Metaphysics, Perception",
          "history": "Lived 1685-1753 CE"
        }
      ],
      "coreConcepts": [
        "Reality is fundamentally mental or consciousness-based",
        "Mind or ideas are primary reality",
        "Matter is dependent on perception/mind",
        "Universal consciousness or Absolute Spirit",
        "Reality unfolds through thought and ideas",
        "Knowledge shapes reality"
      ],
      "critiques": "Difficulty explaining physical world independence, appears disconnected from scientific understanding",
      "variations": [
        "Subjective Idealism (Berkeley)",
        "Transcendental Idealism (Kant)",
        "Absolute Idealism (Hegel)",
        "Objective Idealism (Plato's Forms)"
      ],
      "followers": "Estimated 10+ million adherents in philosophy and consciousness studies",
      "response": "Mind and consciousness are fundamental to understanding reality",
      "overview": "Philosophy asserting that reality is fundamentally mental or experiential. Emphasizes mind, consciousness, and ideas as primary. Challenges purely physical understanding of existence."
    },
    "empiricism": {
      "name": "Empiricism",
      "description": "Philosophical view that knowledge comes primarily from sensory experience and observation rather than innate ideas",
      "founded": "17th-18th centuries CE",
      "founders": [
        "Francis Bacon",
        "John Locke",
        "David Hume"
      ],
      "figures": [
        {
          "name": "John Locke",
          "role": "Founder of British Empiricism",
          "popularity": 85,
          "significance": "English philosopher who argued mind begins as 'blank slate' (tabula rasa) and knowledge comes from sensory experience. Championed empirical method and individual rights.",
          "domain": "Philosophy, Epistemology, Political Theory",
          "history": "Lived 1632-1704 CE",
          "key_works": [
            "An Essay Concerning Human Understanding",
            "Two Treatises of Government"
          ],
          "main_ideas": [
            "Tabula rasa (blank slate)",
            "Natural rights",
            "Empirical knowledge"
          ],
          "influences": [
            "Bacon",
            "Descartes"
          ],
          "legacy": "Founded empiricism, influenced political philosophy and democracy",
          "famous_quotes": [
            "Reading furnishes the mind only with materials of knowledge"
          ]
        },
        {
          "name": "David Hume",
          "role": "Skeptical Empiricist",
          "popularity": 80,
          "significance": "Scottish philosopher who radically applied empiricism, arguing that causality, God, and even self are not empirically verifiable. Challenged metaphysical assumptions through skeptical empiricism.",
          "domain": "Philosophy, Epistemology, Skepticism",
          "history": "Lived 1711-1776 CE",
          "key_works": [
            "A Treatise of Human Nature",
            "An Enquiry Concerning Human Understanding"
          ],
          "main_ideas": [
            "All knowledge from sense experience",
            "Skepticism about causality",
            "No innate ideas"
          ],
          "influences": [
            "John Locke",
            "George Berkeley"
          ],
          "legacy": "Influenced Kant and logical positivism, questioning causality",
          "famous_quotes": [
            "Beauty is no quality in things themselves: it exists merely in the mind"
          ]
        },
        {
          "name": "Francis Bacon",
          "role": "Founder of Scientific Method",
          "popularity": 85,
          "significance": "English philosopher who promoted 'inductive method' - observation of nature to derive principles. Founded modern scientific method emphasizing experimentation over pure reasoning.",
          "domain": "Philosophy, Science, Methodology",
          "history": "Lived 1561-1626 CE"
        }
      ],
      "coreConcepts": [
        "Knowledge comes from sensory experience",
        "Mind starts as blank slate (Locke)",
        "Observation and experimentation are key",
        "Rejection of innate ideas",
        "Scientific method based on induction",
        "Skepticism toward metaphysics (Hume)"
      ],
      "critiques": "Problem of induction (can't prove universal truths from observations), difficulty accounting for abstract knowledge",
      "variations": [
        "British Empiricism (Locke, Hume)",
        "Radical Empiricism (James)",
        "Logical Empiricism (20th century science)"
      ],
      "followers": "Estimated 50+ million influenced by empiricist epistemology (implicit in science)",
      "response": "Scientific observation and experience provide reliable knowledge of the world",
      "overview": "Philosophy emphasizing knowledge comes from sensory experience. Skeptical of innate ideas and emphasizes observation and experimentation. Foundation of scientific method.",
      "branches": [
        {
          "name": "Classical Empiricism",
          "description": "Hume and Locke emphasizing sensory experience as foundation of knowledge"
        },
        {
          "name": "Logical Empiricism",
          "description": "Modern empiricism combining logic and verification principle"
        }
      ]
    },
    "rationalism": {
      "name": "Rationalism",
      "description": "Philosophical view that reason and logic are the primary sources of knowledge, not sensory experience",
      "founded": "17th century CE",
      "founders": [
        "René Descartes",
        "Gottfried Leibniz",
        "Baruch Spinoza"
      ],
      "figures": [
        {
          "name": "René Descartes",
          "role": "Father of Modern Rationalism",
          "popularity": 85,
          "significance": "French philosopher who founded modern rationalism. Advocated methodical doubt and reason as path to certain knowledge. Famous for 'Cogito, ergo sum' (I think, therefore I am).",
          "domain": "Philosophy, Metaphysics, Method, Mathematics",
          "history": "Lived 1596-1650 CE",
          "key_works": [
            "Discourse on Method",
            "Meditations on First Philosophy"
          ],
          "main_ideas": [
            "Cogito ergo sum",
            "Mind-body dualism",
            "Reason as foundation"
          ],
          "influences": [
            "Scholasticism",
            "Medieval philosophy"
          ],
          "legacy": "Founder of modern philosophy, mathematical method in philosophy",
          "famous_quotes": [
            "I think therefore I am",
            "It is not enough to have a good mind, the main thing is to use it well"
          ]
        },
        {
          "name": "Gottfried Wilhelm Leibniz",
          "role": "Rationalist Polymath",
          "popularity": 80,
          "significance": "German philosopher and mathematician who developed rationalist system emphasizing innate ideas and pre-established harmony. Invented calculus and monadology.",
          "domain": "Philosophy, Mathematics, Metaphysics, Logic",
          "history": "Lived 1646-1716 CE"
        },
        {
          "name": "Baruch Spinoza",
          "role": "Rationalist Metaphysician",
          "popularity": 80,
          "significance": "Dutch philosopher who developed rationalist metaphysics with Substance (God/Nature) as fundamental reality. Pantheist who used geometric/mathematical reasoning for philosophy.",
          "domain": "Philosophy, Metaphysics, Ethics, Reason",
          "history": "Lived 1632-1677 CE"
        }
      ],
      "coreConcepts": [
        "Reason is primary source of knowledge",
        "Innate ideas exist in mind",
        "Logic and mathematics reveal truth",
        "Deductive reasoning from first principles",
        "Mind has access to universal truths",
        "Reality is rational and comprehensible"
      ],
      "critiques": "Disconnected from empirical reality, difficulty explaining sensory experience, reliance on unproven assumptions",
      "variations": [
        "Continental Rationalism (Descartes, Leibniz, Spinoza)",
        "Mathematical Rationalism",
        "Logical Rationalism"
      ],
      "followers": "Estimated 30+ million influenced by rationalist philosophy (mathematics, logic, AI)",
      "response": "Pure reason and logic reveal the fundamental nature of reality",
      "overview": "Philosophy emphasizing reason and intellect as primary sources of knowledge. Values mathematical and logical thinking. Celebrates human reason's ability to understand reality."
    },
    "pragmatism": {
      "name": "Pragmatism",
      "description": "Philosophical movement valuing practical consequences and usefulness over abstract truth or theory",
      "founded": "Late 19th-early 20th centuries CE",
      "founders": [
        "Charles Peirce",
        "William James",
        "John Dewey"
      ],
      "figures": [
        {
          "name": "William James",
          "role": "Founder of Pragmatism Movement",
          "popularity": 85,
          "significance": "American psychologist and philosopher who championed pragmatism. Argued truth should be judged by practical consequences and workability. Emphasized action and experience.",
          "domain": "Philosophy, Psychology, Epistemology, Practice",
          "history": "Lived 1842-1910 CE"
        },
        {
          "name": "Charles Sanders Peirce",
          "role": "Founder of Semiotics and Pragmatism",
          "popularity": 80,
          "significance": "American philosopher who originated pragmatism and semiotics. Argued meaning and truth emerge through community inquiry and practical experience. Influenced scientific methodology.",
          "domain": "Philosophy, Semiotics, Logic, Science",
          "history": "Lived 1839-1914 CE"
        },
        {
          "name": "John Dewey",
          "role": "Pragmatist Educator and Philosopher",
          "popularity": 85,
          "significance": "American philosopher who applied pragmatism to education, democracy, and social reform. Emphasized learning through doing and solving real-world problems. Influenced modern education.",
          "domain": "Philosophy, Education, Democracy, Social Practice",
          "history": "Lived 1859-1952 CE"
        }
      ],
      "coreConcepts": [
        "Truth is what works in practice",
        "Meaning comes from consequences",
        "Knowledge should solve real problems",
        "Action and experience over theory",
        "Community inquiry determines truth",
        "Continuous improvement and adaptation"
      ],
      "critiques": "May reduce truth to mere utility, difficulty defining 'works', may ignore principles",
      "variations": [
        "Classical Pragmatism (Peirce, James, Dewey)",
        "Neopragmatism (contemporary)",
        "Pragmatic ethics"
      ],
      "followers": "Estimated 50+ million influenced by pragmatism (business, education, science)",
      "response": "The truth and value of ideas should be measured by their practical consequences",
      "overview": "Philosophy judging truth and value by practical consequences and usefulness. Emphasizes action, experimentation, and adaptation. Practical approach to solving problems."
    }
  },
  "spirituality": {
    "astrology": {
      "name": "Astrology",
      "description": "Ancient system of interpreting celestial bodies and their influence on human affairs and personality",
      "founded": "c. 3000 BCE (ancient Babylon)",
      "founders": [
        "Ancient Babylonians",
        "Ancient Egyptians"
      ],
      "image": "",
      "figures": [
        {
          "name": "Ptolemy",
          "role": "Ancient Astronomer & Astrologer",
          "image": "",
          "popularity": 80,
          "significance": "Greek-Egyptian astronomer who systematized astrology in 'Tetrabiblos'. Established foundations of Western astrology that influenced practice for 1500+ years.",
          "domain": "Astrology, Astronomy, Cosmology",
          "history": "Lived c. 100-170 CE in Alexandria",
          "key_contributions": [
            "Systematized Western astrology",
            "Created astrological framework"
          ],
          "practices": [
            "Horoscope calculation",
            "Planetary interpretation",
            "Zodiacal analysis"
          ],
          "students": "Influenced all subsequent astrologers",
          "legacy": "Foundation of Western astrology for 1500+ years",
          "symbols": [
            "Astrolabe",
            "Zodiac wheel",
            "Planetary symbols"
          ]
        },
        {
          "name": "Nostradamus",
          "role": "Astrologer & Seer",
          "image": "",
          "popularity": 75,
          "significance": "French astrologer famous for prophecies written in quatrains. Influenced modern astrology and divination practices.",
          "domain": "Astrology, Prophecy, Divination",
          "history": "Lived 1503-1566 CE",
          "key_contributions": [
            "Prophecies in quatrain form",
            "Modern astrology interpretation"
          ],
          "practices": [
            "Scrying (crystal gazing)",
            "Astrological prophecy",
            "Herbal medicine"
          ],
          "students": "Influenced modern divination practices",
          "legacy": "Famous for prophecies, modern astrology icon",
          "symbols": [
            "Crystal ball",
            "Mystical herbs",
            "Prophetic visions"
          ]
        }
      ],
      "zodiacSigns": [
        {
          "name": "Aries",
          "dates": "March 21 - April 19",
          "element": "Fire",
          "ruling_planet": "Mars",
          "symbol": "The Ram",
          "traits": "Courageous, ambitious, passionate, determined"
        },
        {
          "name": "Taurus",
          "dates": "April 20 - May 20",
          "element": "Earth",
          "ruling_planet": "Venus",
          "symbol": "The Bull",
          "traits": "Reliable, practical, loyal, grounded"
        },
        {
          "name": "Gemini",
          "dates": "May 21 - June 20",
          "element": "Air",
          "ruling_planet": "Mercury",
          "symbol": "The Twins",
          "traits": "Curious, adaptable, communicative, intellectual"
        },
        {
          "name": "Cancer",
          "dates": "June 21 - July 22",
          "element": "Water",
          "ruling_planet": "Moon",
          "symbol": "The Crab",
          "traits": "Emotional, nurturing, protective, intuitive"
        },
        {
          "name": "Leo",
          "dates": "July 23 - August 22",
          "element": "Fire",
          "ruling_planet": "Sun",
          "symbol": "The Lion",
          "traits": "Confident, creative, generous, theatrical"
        },
        {
          "name": "Virgo",
          "dates": "August 23 - September 22",
          "element": "Earth",
          "ruling_planet": "Mercury",
          "symbol": "The Maiden",
          "traits": "Analytical, practical, organized, conscientious"
        },
        {
          "name": "Libra",
          "dates": "September 23 - October 22",
          "element": "Air",
          "ruling_planet": "Venus",
          "symbol": "The Scales",
          "traits": "Balanced, diplomatic, social, fair-minded"
        },
        {
          "name": "Scorpio",
          "dates": "October 23 - November 21",
          "element": "Water",
          "ruling_planet": "Pluto",
          "symbol": "The Scorpion",
          "traits": "Intense, secretive, magnetic, transformative"
        },
        {
          "name": "Sagittarius",
          "dates": "November 22 - December 21",
          "element": "Fire",
          "ruling_planet": "Jupiter",
          "symbol": "The Archer",
          "traits": "Optimistic, adventurous, philosophical, free-spirited"
        },
        {
          "name": "Capricorn",
          "dates": "December 22 - January 19",
          "element": "Earth",
          "ruling_planet": "Saturn",
          "symbol": "The Goat",
          "traits": "Disciplined, responsible, ambitious, pragmatic"
        },
        {
          "name": "Aquarius",
          "dates": "January 20 - February 18",
          "element": "Air",
          "ruling_planet": "Uranus",
          "symbol": "The Water Bearer",
          "traits": "Independent, innovative, humanitarian, detached"
        },
        {
          "name": "Pisces",
          "dates": "February 19 - March 20",
          "element": "Water",
          "ruling_planet": "Neptune",
          "symbol": "The Fish",
          "traits": "Compassionate, artistic, intuitive, escapist"
        }
      ],
      "coreConcepts": [
        "Zodiac signs",
        "Planetary influence",
        "Birth charts",
        "Horoscopes",
        "Astrological aspects",
        "Houses",
        "Elements (Fire, Earth, Air, Water)"
      ],
      "practices": [
        "Birth chart reading",
        "Daily horoscopes",
        "Transit interpretation",
        "Synastry (relationship astrology)",
        "Predictive astrology"
      ],
      "followers": "100+ million practitioners and believers worldwide",
      "history": "Originated in Babylonia c. 3000 BCE; systematized by Greeks and Ptolemy; spread through Islamic Golden Age; revived during Renaissance; modern astrology combines ancient and contemporary practices",
      "overview": "Ancient practice interpreting celestial movements to understand human affairs and personality. Uses zodiac signs, planetary positions, and birth charts. Blends mythology, mathematics, and psychology.",
      "zodiac_signs": [
        {
          "name": "Aries",
          "dates": "March 21 - April 19",
          "symbol": "♈ (The Ram)",
          "element": "Fire",
          "ruling_planet": "Mars",
          "modality": "Cardinal",
          "traits": "Bold, courageous, passionate, pioneering, direct",
          "strengths": "Leadership, initiative, enthusiasm, confidence",
          "challenges": "Impulsive, aggressive, impatient, selfish"
        },
        {
          "name": "Taurus",
          "dates": "April 20 - May 20",
          "symbol": "♉ (The Bull)",
          "element": "Earth",
          "ruling_planet": "Venus",
          "modality": "Fixed",
          "traits": "Stable, reliable, sensual, grounded, practical",
          "strengths": "Loyalty, patience, determination, abundance",
          "challenges": "Stubborn, possessive, materialistic, inflexible"
        },
        {
          "name": "Gemini",
          "dates": "May 21 - June 20",
          "symbol": "♊ (The Twins)",
          "element": "Air",
          "ruling_planet": "Mercury",
          "modality": "Mutable",
          "traits": "Communicative, curious, intellectual, adaptable, witty",
          "strengths": "Communication, versatility, intelligence, humor",
          "challenges": "Inconsistent, superficial, anxious, scattered"
        },
        {
          "name": "Cancer",
          "dates": "June 21 - July 22",
          "symbol": "♋ (The Crab)",
          "element": "Water",
          "ruling_planet": "Moon",
          "modality": "Cardinal",
          "traits": "Emotional, nurturing, intuitive, protective, sentimental",
          "strengths": "Empathy, loyalty, caretaking, emotional depth",
          "challenges": "Moody, clingy, oversensitive, defensive"
        },
        {
          "name": "Leo",
          "dates": "July 23 - August 22",
          "symbol": "♌ (The Lion)",
          "element": "Fire",
          "ruling_planet": "Sun",
          "modality": "Fixed",
          "traits": "Confident, creative, generous, dramatic, proud",
          "strengths": "Charisma, creativity, generosity, leadership",
          "challenges": "Arrogant, vain, stubborn, attention-seeking"
        },
        {
          "name": "Virgo",
          "dates": "August 23 - September 22",
          "symbol": "♍ (The Maiden)",
          "element": "Earth",
          "ruling_planet": "Mercury",
          "modality": "Mutable",
          "traits": "Analytical, practical, methodical, perfectionist, service-oriented",
          "strengths": "Precision, helpfulness, dedication, discernment",
          "challenges": "Critical, anxious, overly analytical, nitpicky"
        },
        {
          "name": "Libra",
          "dates": "September 23 - October 22",
          "symbol": "♎ (The Scales)",
          "element": "Air",
          "ruling_planet": "Venus",
          "modality": "Cardinal",
          "traits": "Balanced, diplomatic, aesthetic, social, indecisive",
          "strengths": "Diplomacy, fairness, charm, social grace",
          "challenges": "Indecisive, people-pleasing, superficial, avoidant"
        },
        {
          "name": "Scorpio",
          "dates": "October 23 - November 21",
          "symbol": "♏ (The Scorpion)",
          "element": "Water",
          "ruling_planet": "Pluto",
          "modality": "Fixed",
          "traits": "Intense, secretive, powerful, transformative, mysterious",
          "strengths": "Determination, passion, loyalty, depth",
          "challenges": "Jealous, secretive, controlling, vindictive"
        },
        {
          "name": "Sagittarius",
          "dates": "November 22 - December 21",
          "symbol": "♐ (The Archer)",
          "element": "Fire",
          "ruling_planet": "Jupiter",
          "modality": "Mutable",
          "traits": "Optimistic, adventurous, philosophical, expansive, blunt",
          "strengths": "Optimism, honesty, adventure, wisdom",
          "challenges": "Overconfident, tactless, impatient, reckless"
        },
        {
          "name": "Capricorn",
          "dates": "December 22 - January 19",
          "symbol": "♑ (The Goat)",
          "element": "Earth",
          "ruling_planet": "Saturn",
          "modality": "Cardinal",
          "traits": "Ambitious, disciplined, practical, responsible, reserved",
          "strengths": "Responsibility, discipline, ambition, reliability",
          "challenges": "Cold, pessimistic, overly serious, stubborn"
        },
        {
          "name": "Aquarius",
          "dates": "January 20 - February 18",
          "symbol": "♒ (The Water Bearer)",
          "element": "Air",
          "ruling_planet": "Uranus",
          "modality": "Fixed",
          "traits": "Innovative, detached, humanitarian, rebellious, intellectual",
          "strengths": "Innovation, independence, humanitarianism, vision",
          "challenges": "Detached, aloof, stubborn, unpredictable"
        },
        {
          "name": "Pisces",
          "dates": "February 19 - March 20",
          "symbol": "♓ (The Fish)",
          "element": "Water",
          "ruling_planet": "Neptune",
          "modality": "Mutable",
          "traits": "Dreamy, compassionate, intuitive, artistic, escapist",
          "strengths": "Compassion, intuition, creativity, adaptability",
          "challenges": "Unrealistic, escapist, overly idealistic, gullible"
        }
      ],
      "houses": [
        {
          "number": "1st House",
          "name": "House of Self",
          "ruler": "Aries",
          "meaning": "Self-image, personality, appearance, first impressions, identity, how others perceive you"
        },
        {
          "number": "2nd House",
          "name": "House of Possessions",
          "ruler": "Taurus",
          "meaning": "Money, finances, material possessions, self-worth, values, earning ability"
        },
        {
          "number": "3rd House",
          "name": "House of Communication",
          "ruler": "Gemini",
          "meaning": "Communication, siblings, short trips, learning, thinking patterns, writing"
        },
        {
          "number": "4th House",
          "name": "House of Home & Family",
          "ruler": "Cancer",
          "meaning": "Home, family, roots, parents, foundations, private life, real estate"
        },
        {
          "number": "5th House",
          "name": "House of Pleasure",
          "ruler": "Leo",
          "meaning": "Creativity, romance, children, hobbies, entertainment, self-expression, fun"
        },
        {
          "number": "6th House",
          "name": "House of Health",
          "ruler": "Virgo",
          "meaning": "Health, work, daily routines, service, pets, habits, employment"
        },
        {
          "number": "7th House",
          "name": "House of Partnership",
          "ruler": "Libra",
          "meaning": "Marriage, partnerships, relationships, contracts, open enemies, balance"
        },
        {
          "number": "8th House",
          "name": "House of Transformation",
          "ruler": "Scorpio",
          "meaning": "Shared resources, inheritance, sexuality, death/rebirth, transformation, psychology"
        },
        {
          "number": "9th House",
          "name": "House of Philosophy",
          "ruler": "Sagittarius",
          "meaning": "Higher education, philosophy, religion, travel, publishing, foreign cultures"
        },
        {
          "number": "10th House",
          "name": "House of Career",
          "ruler": "Capricorn",
          "meaning": "Career, public image, authority, achievement, reputation, social status"
        },
        {
          "number": "11th House",
          "name": "House of Friendships",
          "ruler": "Aquarius",
          "meaning": "Friendships, groups, hopes, wishes, networking, community, ideals"
        },
        {
          "number": "12th House",
          "name": "House of Spirituality",
          "ruler": "Pisces",
          "meaning": "Spirituality, unconscious, hidden matters, solitude, karma, transcendence"
        }
      ],
      "aspects": [
        {
          "name": "Conjunction",
          "symbol": "☌",
          "angle": "0°",
          "meaning": "Blending of energies, unity, combined force, emphasis, powerful influence"
        },
        {
          "name": "Sextile",
          "symbol": "⚹",
          "angle": "60°",
          "meaning": "Harmony, ease, opportunity, supportive flow, natural talent"
        },
        {
          "name": "Square",
          "symbol": "□",
          "angle": "90°",
          "meaning": "Tension, challenge, growth through friction, conflict, motivation"
        },
        {
          "name": "Trine",
          "symbol": "△",
          "angle": "120°",
          "meaning": "Grace, ease, natural ability, blessing, luck, harmony in flow"
        },
        {
          "name": "Opposition",
          "symbol": "☍",
          "angle": "180°",
          "meaning": "Polarity, awareness, relationship dynamics, push-pull, integration needed"
        },
        {
          "name": "Quincunx",
          "symbol": "⚺",
          "angle": "150°",
          "meaning": "Adjustment, minor tension, need for adaptation, awkwardness"
        }
      ],
      "planets": [
        {
          "name": "Sun",
          "symbol": "☉",
          "meaning": "Core identity, ego, will, vitality, life force, central purpose, conscious self",
          "rulership": "Leo"
        },
        {
          "name": "Moon",
          "symbol": "☾",
          "meaning": "Emotions, instincts, subconscious, nurturing, inner world, comfort, habits",
          "rulership": "Cancer"
        },
        {
          "name": "Mercury",
          "symbol": "☿",
          "meaning": "Communication, thinking, intellect, speech, perception, learning, short trips",
          "rulership": "Gemini, Virgo"
        },
        {
          "name": "Venus",
          "symbol": "♀",
          "meaning": "Love, values, beauty, pleasure, attraction, relationships, finances",
          "rulership": "Taurus, Libra"
        },
        {
          "name": "Mars",
          "symbol": "♂",
          "meaning": "Action, passion, drive, aggression, courage, sexuality, conflict",
          "rulership": "Aries"
        },
        {
          "name": "Jupiter",
          "symbol": "♃",
          "meaning": "Expansion, luck, growth, philosophy, optimism, abundance, truth",
          "rulership": "Sagittarius"
        },
        {
          "name": "Saturn",
          "symbol": "♄",
          "meaning": "Limitations, discipline, karma, responsibility, time, structure, maturity",
          "rulership": "Capricorn"
        },
        {
          "name": "Uranus",
          "symbol": "♅",
          "meaning": "Revolution, innovation, rebellion, sudden change, freedom, technology",
          "rulership": "Aquarius"
        },
        {
          "name": "Neptune",
          "symbol": "♆",
          "meaning": "Dreams, illusions, spirituality, imagination, mysticism, transcendence",
          "rulership": "Pisces"
        },
        {
          "name": "Pluto",
          "symbol": "♇",
          "meaning": "Transformation, power, depth, rebirth, death/renewal, the underworld",
          "rulership": "Scorpio"
        }
      ],
      "types": [
        {
          "name": "Western Astrology (Tropical)",
          "origin": "Ancient Greece and Rome",
          "zodiac_system": "Tropical Zodiac",
          "key_difference": "Based on the spring equinox (vernal point). The zodiac begins at 0° Aries when the sun reaches the spring equinox, regardless of where the actual constellations are.",
          "characteristics": "Most commonly used in the Western world. Focuses on psychological and personal development. Uses the spring equinox as the fixed starting point.",
          "house_system": "Multiple systems (Placidus, Whole Sign, Equal, Koch, etc.)",
          "strengths": "Predictable, mathematically consistent, psychologically focused, widely available resources",
          "followers": "~1 billion (estimated practitioners and believers worldwide)"
        },
        {
          "name": "Vedic Astrology (Sidereal)",
          "origin": "Ancient India (Vedas, ~1200 BCE)",
          "zodiac_system": "Sidereal Zodiac",
          "key_difference": "Uses actual constellation positions in the sky. Accounts for precession (wobble in Earth's axis). The zodiac is aligned with where constellations actually are, about 24 degrees behind Western astrology.",
          "characteristics": "Emphasizes karma, reincarnation, and dharma. More precise with current sky positions. Focuses on spiritual growth and past-life influences.",
          "house_system": "Whole Sign system primarily",
          "strengths": "Astronomically accurate, spiritual focus, ancient philosophical foundation, accounts for precession",
          "followers": "~500 million (primarily in India and Asia, growing worldwide)"
        },
        {
          "name": "Hellenistic Astrology",
          "origin": "Ancient Greece (200 BCE - 600 CE)",
          "zodiac_system": "Tropical (early development)",
          "key_difference": "Foundation for modern Western astrology. Emphasizes horary astrology (answering specific questions) and nativity charts. More mathematical and logical approach.",
          "characteristics": "Uses aspects, dignities, and rulerships. Focuses on fate and determinism. Highly technical and calculation-based.",
          "house_system": "Whole Sign and quadrant systems",
          "strengths": "Historical foundation, technical precision, detailed rulership systems, influential on modern practice",
          "followers": "Specialized practitioners and scholars"
        },
        {
          "name": "Medical Astrology",
          "origin": "Ancient Greece and Medieval Europe",
          "zodiac_system": "Tropical (Western)",
          "key_difference": "Links zodiac signs and planets to body parts and health conditions. Uses astrological timing for medical treatments.",
          "characteristics": "Each sign governs specific body parts. Planets represent diseases. Moon represents bodily fluids. Practices herbal remedies based on planetary hours.",
          "house_system": "Tropical Western system",
          "strengths": "Holistic health approach, connects cosmos to body, historical medical framework, preventative focus",
          "followers": "Holistic health practitioners, herbalists, alternative medicine practitioners"
        },
        {
          "name": "Horary Astrology",
          "origin": "Ancient Middle East and Greece",
          "zodiac_system": "Can use either Tropical or Sidereal",
          "key_difference": "Answers specific yes/no or how/why questions by casting a chart at the moment the question is asked. Not about the person's birth chart.",
          "characteristics": "Extremely precise timing needed. Uses strict rules and dignities. Focuses on the Quesited (answer) and Querent (questioner). Very practical and answer-focused.",
          "house_system": "Whole Sign primarily",
          "strengths": "Answers specific questions, practical application, doesn't require birth time, historically proven accurate",
          "followers": "Divination practitioners, consultants, mystery solvers"
        },
        {
          "name": "Electional Astrology",
          "origin": "Ancient Babylon and Greece",
          "zodiac_system": "Tropical (Western) primarily",
          "key_difference": "Chooses the best astrological time to START an event (like a wedding, business launch, surgery). Works in reverse - picking optimal timing.",
          "characteristics": "Identifies favorable planetary alignments for future events. Uses dignity and aspect analysis. Seeks to maximize success probability.",
          "house_system": "Tropical Western system",
          "strengths": "Practical planning tool, maximizes success potential, backed by historical precedent, empowering",
          "followers": "Event planners, business owners, practitioners seeking optimal timing"
        },
        {
          "name": "Psychological Astrology",
          "origin": "Modern (20th century - Present)",
          "zodiac_system": "Tropical (Western)",
          "key_difference": "Uses astrology as a psychological tool for self-understanding and personal growth rather than prediction. Influenced by Jungian psychology.",
          "characteristics": "Focuses on archetypes, shadow work, and personal integration. Emphasizes free will over fate. Uses birth chart for psychological insight.",
          "house_system": "Modern Western systems (Placidus, Equal, etc.)",
          "strengths": "Empowering personal growth focus, evidence-based psychology integration, modern relevance, therapeutic applications",
          "followers": "Therapists, life coaches, self-help seekers, modern practitioners"
        },
        {
          "name": "Evolutionary Astrology",
          "origin": "Modern (20th century - Present)",
          "zodiac_system": "Tropical (Western)",
          "key_difference": "Views astrology through the lens of soul evolution and spiritual growth. Uses Pluto placements and nodes heavily. Focuses on transformation and karmic lessons.",
          "characteristics": "Emphasizes South Node (past/karma) and North Node (future/growth). Sees challenges as growth opportunities. Spiritual and transformative focus.",
          "house_system": "Modern Western systems",
          "strengths": "Spiritual growth orientation, transformative perspective, karmic understanding, healing-focused",
          "followers": "Spiritual seekers, therapists, coaches with spiritual orientation"
        },
        {
          "name": "Chinese Astrology",
          "origin": "Ancient China (~2000 BCE)",
          "zodiac_system": "12 Animal Signs (yearly cycle)",
          "key_difference": "Based on lunar calendar and 12-year cycles instead of 12-month zodiac. Uses Five Elements (Wu Xing): Wood, Fire, Earth, Metal, Water.",
          "characteristics": "Animal signs repeat every 12 years. Elements cycle every 5 years. Creates 60-year cycles. Focuses on harmony and balance rather than personality types.",
          "house_system": "No house system - uses elemental interactions",
          "strengths": "Lunar cycle accuracy, elemental balance philosophy, Taoist principles, practical yearly guidance",
          "followers": "~1.5 billion (primarily in Asia, growing globally)"
        },
        {
          "name": "Karmic Astrology",
          "origin": "Theosophical movement (19th century)",
          "zodiac_system": "Tropical (Western)",
          "key_difference": "Interprets birth chart as a blueprint of soul's karmic journey. Uses nodes of the Moon (South = past karma, North = future destiny) as central indicators.",
          "characteristics": "Every planetary placement represents karmic lessons. Saturn shows karmic challenges. South Node shows innate talents/past abilities. North Node shows soul's direction.",
          "house_system": "Modern Western systems",
          "strengths": "Spiritual framework, karmic understanding, healing-oriented, purpose-focused, growth-directed",
          "followers": "Spiritual practitioners, reincarnation believers, karmic seekers"
        }
      ],
      "variations": [
        {
          "name": "Western Astrology",
          "description": "Tropical zodiac system based on spring equinox, psychologically-focused"
        },
        {
          "name": "Vedic Astrology",
          "description": "Sidereal system using actual constellation positions, karma-focused"
        },
        {
          "name": "Chinese Astrology",
          "description": "Animal signs and five elements, lunar calendar based"
        }
      ]
    },
    "tarot": {
      "name": "Tarot",
      "description": "Divination system using a deck of 78 cards with symbolic imagery for insight, guidance, and spiritual exploration",
      "founded": "c. 1440 CE (Italy, as card game; divination use c. 1700s)",
      "founders": [
        "Unknown (Italian card game creators)",
        "Antoine Court de Gébelin (popularized divination)"
      ],
      "image": "",
      "figures": [
        {
          "name": "Antoine Court de Gébelin",
          "role": "Occultist & Tarot Scholar",
          "image": "",
          "popularity": 75,
          "significance": "French occultist who first connected tarot cards to ancient Egyptian wisdom and popularized tarot for divination purposes in the 18th century.",
          "domain": "Occultism, Tarot, Ancient Knowledge",
          "history": "Lived 1725-1784 CE",
          "key_contributions": [
            "Connected tarot to Egyptian wisdom",
            "Popularized tarot divination"
          ],
          "practices": [
            "Tarot interpretation",
            "Mystical scholarship",
            "Occult study"
          ],
          "students": "Influenced modern tarot practice",
          "legacy": "Transformed tarot from card game to divination tool",
          "symbols": [
            "Tarot cards",
            "Mystical symbols"
          ]
        },
        {
          "name": "Arthur Edward Waite",
          "role": "Tarot Creator & Occultist",
          "image": "",
          "popularity": 80,
          "significance": "Created the Rider-Waite tarot deck (1909), one of the most popular and influential tarot decks. Revolutionized tarot with detailed symbolic imagery on minor arcana.",
          "domain": "Tarot, Occultism, Symbolism",
          "history": "Lived 1857-1942 CE",
          "key_contributions": [
            "Rider-Waite deck creation",
            "Detailed minor arcana symbolism"
          ],
          "practices": [
            "Tarot divination",
            "Occult instruction",
            "Symbolic interpretation"
          ],
          "students": "Millions of tarot practitioners using his deck",
          "legacy": "Created most popular tarot deck (Rider-Waite-Smith)",
          "symbols": [
            "Rider-Waite cards",
            "Golden Dawn symbols"
          ]
        }
      ],
      "majorArcana": [
        "0. The Fool",
        "I. The Magician",
        "II. The High Priestess",
        "III. The Empress",
        "IV. The Emperor",
        "V. The Hierophant",
        "VI. The Lovers",
        "VII. The Chariot",
        "VIII. Strength",
        "IX. The Hermit",
        "X. Wheel of Fortune",
        "XI. Justice",
        "XII. The Hanged Man",
        "XIII. Death",
        "XIV. Temperance",
        "XV. The Devil",
        "XVI. The Tower",
        "XVII. The Star",
        "XVIII. The Moon",
        "XIX. The Sun",
        "XX. Judgement",
        "XXI. The World"
      ],
      "minorArcana": {
        "Wands": [
          "Ace through 10",
          "Page",
          "Knight",
          "Queen",
          "King"
        ],
        "Cups": [
          "Ace through 10",
          "Page",
          "Knight",
          "Queen",
          "King"
        ],
        "Swords": [
          "Ace through 10",
          "Page",
          "Knight",
          "Queen",
          "King"
        ],
        "Pentacles": [
          "Ace through 10",
          "Page",
          "Knight",
          "Queen",
          "King"
        ]
      },
      "coreConcepts": [
        "Major Arcana (22 cards)",
        "Minor Arcana (56 cards)",
        "Archetypes",
        "Symbolism",
        "Spreads",
        "Reversals",
        "Intuition"
      ],
      "practices": [
        "Card spreads (3-card, Celtic cross, etc.)",
        "Daily draws",
        "Relationship readings",
        "Career guidance",
        "Spiritual counseling"
      ],
      "followers": "50+ million tarot enthusiasts and practitioners worldwide",
      "history": "Originated as Italian playing cards (tarocchi) c. 1440; used for divination from 18th century onwards; popularized in 19th-20th centuries; modern resurgence in spiritual communities",
      "overview": "Divination system using 78 cards to gain insight and guidance. Features Major and Minor Arcana representing different life aspects. Emphasizes synchronicity, intuition, and self-reflection.",
      "variations": [
        {
          "name": "Marseille Tarot",
          "description": "Traditional French tarot with rich symbolism and esoteric meanings"
        },
        {
          "name": "Rider-Waite Tarot",
          "description": "Modern tarot with detailed illustrated Minor Arcana cards"
        },
        {
          "name": "Thoth Tarot",
          "description": "Hermetic tarot combining Egyptian symbolism and Kabbalah"
        }
      ],
      "major_arcana": [
        {
          "number": "0",
          "name": "The Fool",
          "meaning": "New beginnings, taking risks, innocence, spontaneity, foolishness"
        },
        {
          "number": "I",
          "name": "The Magician",
          "meaning": "Manifestation, resourcefulness, power, inspired action, will"
        },
        {
          "number": "II",
          "name": "The High Priestess",
          "meaning": "Intuition, sacred knowledge, divine feminine, the subconscious mind"
        },
        {
          "number": "III",
          "name": "The Empress",
          "meaning": "Femininity, beauty, abundance, nature, fertility, creativity"
        },
        {
          "number": "IV",
          "name": "The Emperor",
          "meaning": "Authority, power, masculine energy, control, leadership, structure"
        },
        {
          "number": "V",
          "name": "The Hierophant",
          "meaning": "Spirituality, tradition, conformity, morality, ethics, religion"
        },
        {
          "number": "VI",
          "name": "The Lovers",
          "meaning": "Relationships, love, harmony, values alignment, choices"
        },
        {
          "number": "VII",
          "name": "The Chariot",
          "meaning": "Control, willpower, determination, hard work, triumph, momentum"
        },
        {
          "number": "VIII",
          "name": "Strength",
          "meaning": "Inner strength, courage, patience, control, compassion, influence"
        },
        {
          "number": "IX",
          "name": "The Hermit",
          "meaning": "Soul searching, introspection, inner guidance, reflection, solitude"
        },
        {
          "number": "X",
          "name": "Wheel of Fortune",
          "meaning": "Good luck, destiny, karma, turning point, cycles, fate"
        },
        {
          "number": "XI",
          "name": "Justice",
          "meaning": "Justice, fairness, truth, cause and effect, accountability, clarity"
        },
        {
          "number": "XII",
          "name": "The Hanged Man",
          "meaning": "Surrender, restriction, letting go, new perspective, pause"
        },
        {
          "number": "XIII",
          "name": "Death",
          "meaning": "Transformation, endings, beginnings, change, transition, renewal"
        },
        {
          "number": "XIV",
          "name": "Temperance",
          "meaning": "Balance, moderation, patience, finding meaning, purpose, harmony"
        },
        {
          "number": "XV",
          "name": "The Devil",
          "meaning": "Bondage, materialism, playfulness, detachment, illusion, shadow self"
        },
        {
          "number": "XVI",
          "name": "The Tower",
          "meaning": "Sudden change, revelation, breakdown, chaos, revelation, awakening"
        },
        {
          "number": "XVII",
          "name": "The Star",
          "meaning": "Hope, faith, renewal, spirituality, freedom, destiny, clarity"
        },
        {
          "number": "XVIII",
          "name": "The Moon",
          "meaning": "Illusion, fear, anxiety, subconscious, intuition, uncertainty"
        },
        {
          "number": "XIX",
          "name": "The Sun",
          "meaning": "Success, vitality, joy, warmth, abundance, positivity, growth"
        },
        {
          "number": "XX",
          "name": "Judgement",
          "meaning": "Rebirth, reckoning, inner calling, awakening, absolution, renewal"
        },
        {
          "number": "XXI",
          "name": "The World",
          "meaning": "Completion, accomplishment, fulfillment, wholeness, travel, unity"
        }
      ],
      "minor_arcana": {
        "wands": [
          {
            "number": "Ace",
            "name": "Ace of Wands",
            "meaning": "Creativity, new opportunities, growth, potential, inspiration"
          },
          {
            "number": "2",
            "name": "Two of Wands",
            "meaning": "Planning, making decisions, leaving home, new paths, insights"
          },
          {
            "number": "3",
            "name": "Three of Wands",
            "meaning": "Foresight, expansion, overseas trade, progress, vision"
          },
          {
            "number": "4",
            "name": "Four of Wands",
            "meaning": "Celebration, harmony, reunion, home, community, joy"
          },
          {
            "number": "5",
            "name": "Five of Wands",
            "meaning": "Conflict, disagreement, tension, competition, struggle"
          },
          {
            "number": "6",
            "name": "Six of Wands",
            "meaning": "Success, public recognition, victory, progress, confidence"
          },
          {
            "number": "7",
            "name": "Seven of Wands",
            "meaning": "Challenge, competition, perseverance, defending beliefs"
          },
          {
            "number": "8",
            "name": "Eight of Wands",
            "meaning": "Rapid action, swift movement, progress, clarity, action"
          },
          {
            "number": "9",
            "name": "Nine of Wands",
            "meaning": "Resilience, persistence, strength, testing of faith, resolve"
          },
          {
            "number": "10",
            "name": "Ten of Wands",
            "meaning": "Burden, responsibilities, stress, heavy load, completion"
          },
          {
            "number": "Page",
            "name": "Page of Wands",
            "meaning": "Exploration, freedom, potential, discovery, youthfulness"
          },
          {
            "number": "Knight",
            "name": "Knight of Wands",
            "meaning": "Energy, passion, adventure, impulsiveness, enthusiasm"
          },
          {
            "number": "Queen",
            "name": "Queen of Wands",
            "meaning": "Confidence, determination, independence, charisma, boldness"
          },
          {
            "number": "King",
            "name": "King of Wands",
            "meaning": "Leadership, vision, entrepreneurship, natural born leader"
          }
        ],
        "cups": [
          {
            "number": "Ace",
            "name": "Ace of Cups",
            "meaning": "New relationships, emotions, creativity, compassion, joy"
          },
          {
            "number": "2",
            "name": "Two of Cups",
            "meaning": "Partnership, unity, connection, relationship, mutual attraction"
          },
          {
            "number": "3",
            "name": "Three of Cups",
            "meaning": "Celebration, community, friendship, gatherings, good news"
          },
          {
            "number": "4",
            "name": "Four of Cups",
            "meaning": "Apathy, contemplation, meditation, reevaluation, withdrawn"
          },
          {
            "number": "5",
            "name": "Five of Cups",
            "meaning": "Loss, grief, disappointment, sadness, heartbreak, crying over spilled milk"
          },
          {
            "number": "6",
            "name": "Six of Cups",
            "meaning": "Innocence, nostalgia, childhood, happiness, joy, simplicity"
          },
          {
            "number": "7",
            "name": "Seven of Cups",
            "meaning": "Illusion, desire, choice, wishful thinking, fantasy"
          },
          {
            "number": "8",
            "name": "Eight of Cups",
            "meaning": "Abandonment, desertion, withdrawal, leaving, searching for meaning"
          },
          {
            "number": "9",
            "name": "Nine of Cups",
            "meaning": "Satisfaction, comfort, contentment, wishes coming true, fulfillment"
          },
          {
            "number": "10",
            "name": "Ten of Cups",
            "meaning": "Harmony, happiness, alignment, family, success, unity"
          },
          {
            "number": "Page",
            "name": "Page of Cups",
            "meaning": "Curiosity, innocence, openness, sensitivity, imagination"
          },
          {
            "number": "Knight",
            "name": "Knight of Cups",
            "meaning": "Romanticism, charm, grace, imagination, cavalier attitude"
          },
          {
            "number": "Queen",
            "name": "Queen of Cups",
            "meaning": "Compassion, calm, artistic, intuitive, nurturing"
          },
          {
            "number": "King",
            "name": "King of Cups",
            "meaning": "Diplomatic, composed, caring, control, counselor, balanced"
          }
        ],
        "swords": [
          {
            "number": "Ace",
            "name": "Ace of Swords",
            "meaning": "Truth, clarity, new ideas, breakthrough, mental clarity"
          },
          {
            "number": "2",
            "name": "Two of Swords",
            "meaning": "Indecision, difficult choices, stalemate, tension, blocked communication"
          },
          {
            "number": "3",
            "name": "Three of Swords",
            "meaning": "Heartache, painful truths, separation, grief, sorrow"
          },
          {
            "number": "4",
            "name": "Four of Swords",
            "meaning": "Rest, pause, breath, sanctuary, recovery, meditation"
          },
          {
            "number": "5",
            "name": "Five of Swords",
            "meaning": "Conflict, disagreement, tension, loss, defeat, aftermath"
          },
          {
            "number": "6",
            "name": "Six of Swords",
            "meaning": "Transition, moving on, leaving, journey, progress, motion"
          },
          {
            "number": "7",
            "name": "Seven of Swords",
            "meaning": "Betrayal, deception, theft, sneaking, strategy, cunning"
          },
          {
            "number": "8",
            "name": "Eight of Swords",
            "meaning": "Restriction, confusion, powerlessness, self-imposed limits, imprisonment"
          },
          {
            "number": "9",
            "name": "Nine of Swords",
            "meaning": "Anxiety, worry, fear, nightmares, despair, stress"
          },
          {
            "number": "10",
            "name": "Ten of Swords",
            "meaning": "Betrayal, tragedy, loss, ruin, collapse, ending"
          },
          {
            "number": "Page",
            "name": "Page of Swords",
            "meaning": "Curiosity, restlessness, mental agility, quick-witted, mischief"
          },
          {
            "number": "Knight",
            "name": "Knight of Swords",
            "meaning": "Action, impulsiveness, combat, defending, protecting, boldness"
          },
          {
            "number": "Queen",
            "name": "Queen of Swords",
            "meaning": "Independent, analytical, sharp-minded, clear, direct"
          },
          {
            "number": "King",
            "name": "King of Swords",
            "meaning": "Logic, truth, authority, intellect, justice, command"
          }
        ],
        "pentacles": [
          {
            "number": "Ace",
            "name": "Ace of Pentacles",
            "meaning": "Prosperity, new opportunity, abundance, security, nourishment"
          },
          {
            "number": "2",
            "name": "Two of Pentacles",
            "meaning": "Balance, dexterity, multitasking, juggling, adapting"
          },
          {
            "number": "3",
            "name": "Three of Pentacles",
            "meaning": "Teamwork, collaboration, learning, working together, skill"
          },
          {
            "number": "4",
            "name": "Four of Pentacles",
            "meaning": "Conservation, control, possessiveness, security, stability"
          },
          {
            "number": "5",
            "name": "Five of Pentacles",
            "meaning": "Hardship, poverty, financial loss, insecurity, vulnerability"
          },
          {
            "number": "6",
            "name": "Six of Pentacles",
            "meaning": "Generosity, sharing, fairness, charity, abundance, giving"
          },
          {
            "number": "7",
            "name": "Seven of Pentacles",
            "meaning": "Assessment, patience, progress, investment, growth"
          },
          {
            "number": "8",
            "name": "Eight of Pentacles",
            "meaning": "Mastery, learning, skill-building, expertise, apprenticeship"
          },
          {
            "number": "9",
            "name": "Nine of Pentacles",
            "meaning": "Abundance, luxury, self-sufficiency, comfort, independance"
          },
          {
            "number": "10",
            "name": "Ten of Pentacles",
            "meaning": "Wealth, legacy, family, stability, inheritance, permanence"
          },
          {
            "number": "Page",
            "name": "Page of Pentacles",
            "meaning": "Potential, ambition, eagerness, studious, cautious"
          },
          {
            "number": "Knight",
            "name": "Knight of Pentacles",
            "meaning": "Dedication, reliability, loyalty, conscientious, methodical"
          },
          {
            "number": "Queen",
            "name": "Queen of Pentacles",
            "meaning": "Practicality, creature comforts, financial security, kindness"
          },
          {
            "number": "King",
            "name": "King of Pentacles",
            "meaning": "Wealth, success, leadership, abundance, prosperity, authority"
          }
        ]
      }
    },
    "numerology": {
      "name": "Numerology",
      "description": "Spiritual system interpreting numbers and their vibrations as guides to understanding personality, destiny, and life patterns",
      "founded": "Ancient (used by Pythagoras c. 600 BCE); formalized c. 1400s CE",
      "founders": [
        "Pythagoras (mathematical foundations)",
        "Modern numerologists (20th century systematization)"
      ],
      "image": "",
      "figures": [
        {
          "name": "Pythagoras",
          "role": "Mathematician & Philosopher",
          "image": "",
          "popularity": 85,
          "significance": "Ancient Greek mathematician and mystic who believed numbers held sacred significance. Foundation of numerological thought based on mathematical harmony.",
          "domain": "Mathematics, Numerology, Philosophy, Mysticism",
          "history": "Lived c. 570-495 BCE",
          "key_contributions": [
            "Mathematical philosophy of numbers",
            "Sacred significance of numbers"
          ],
          "practices": [
            "Mathematical mysticism",
            "Number symbolism",
            "Harmonic theory"
          ],
          "students": "Influenced all subsequent numerologists",
          "legacy": "Foundation of numerological thinking",
          "symbols": [
            "Golden ratio",
            "Mathematical patterns",
            "Mystical numbers"
          ]
        },
        {
          "name": "L. Dow Balliett",
          "role": "Modern Numerology Pioneer",
          "image": "",
          "popularity": 70,
          "significance": "Early 20th century numerologist who systematized and popularized numerology in modern form, writing influential books on the subject.",
          "domain": "Numerology, Spirituality, Personal Development",
          "history": "Lived late 1800s-early 1900s",
          "key_contributions": [
            "Systematized modern numerology",
            "Created numerological systems"
          ],
          "practices": [
            "Name analysis",
            "Number interpretation",
            "Birth date analysis"
          ],
          "students": "Popularized numerology in 20th century",
          "legacy": "Modern numerology framework still used today",
          "symbols": [
            "Numbers 1-9",
            "Master numbers"
          ]
        }
      ],
      "lifePathNumbers": [
        {
          "number": 1,
          "traits": "Leadership, independence, pioneering, ambitious"
        },
        {
          "number": 2,
          "traits": "Cooperation, balance, diplomacy, intuition"
        },
        {
          "number": 3,
          "traits": "Creativity, self-expression, communication, optimism"
        },
        {
          "number": 4,
          "traits": "Stability, practicality, organization, hard work"
        },
        {
          "number": 5,
          "traits": "Freedom, adaptability, adventure, versatility"
        },
        {
          "number": 6,
          "traits": "Harmony, responsibility, nurturing, care"
        },
        {
          "number": 7,
          "traits": "Spirituality, analysis, wisdom, introspection"
        },
        {
          "number": 8,
          "traits": "Power, ambition, material success, authority"
        },
        {
          "number": 9,
          "traits": "Compassion, completion, universal love, enlightenment"
        }
      ],
      "destinyNumbers": [
        {
          "number": 1,
          "meaning": "Creator, innovator, independent path"
        },
        {
          "number": 2,
          "meaning": "Peacemaker, mediator, balance finder"
        },
        {
          "number": 3,
          "meaning": "Artist, communicator, joy bringer"
        },
        {
          "number": 4,
          "meaning": "Builder, organizer, solid foundation creator"
        },
        {
          "number": 5,
          "meaning": "Communicator, explorer, freedom seeker"
        },
        {
          "number": 6,
          "meaning": "Caregiver, healer, harmonizer"
        },
        {
          "number": 7,
          "meaning": "Seeker, analyst, spiritual warrior"
        },
        {
          "number": 8,
          "meaning": "Leader, achiever, abundance manifester"
        },
        {
          "number": 9,
          "meaning": "Humanitarian, teacher, wisdom sharer"
        }
      ],
      "soulUrgeNumbers": [
        "Calculated from vowels in birth name",
        "Reveals inner desires and motivations",
        "Shows what the soul yearns to express",
        "Ranges 1-9 with 11, 22, 33 as master numbers"
      ],
      "coreConcepts": [
        "Life Path Number",
        "Destiny Number",
        "Soul Urge Number",
        "Expression Number",
        "Master Numbers (11, 22, 33)",
        "Vibrations",
        "Synchronicity"
      ],
      "practices": [
        "Name analysis",
        "Birth date interpretation",
        "Numerology charts",
        "Yearly number forecasts",
        "Relationship compatibility"
      ],
      "followers": "30+ million numerology practitioners and believers worldwide",
      "history": "Ancient roots in Hebrew Kabbalah (Gematria) and Pythagorean philosophy; formalized in modern spirituality; blends mathematics with metaphysics",
      "overview": "Mystical practice assigning spiritual significance to numbers. Analyzes birth dates, names, and patterns. Seeks universal meaning through numerical relationships.",
      "variations": [
        {
          "name": "Pythagorean Numerology",
          "description": "Western system based on Greek philosophy and mathematical principles"
        },
        {
          "name": "Chaldean Numerology",
          "description": "Ancient Babylonian system using different number-letter correspondences"
        }
      ]
    },
    "shamanism": {
      "name": "Shamanism",
      "description": "Ancient spiritual practice involving direct communication with spirits through trance, ritual, and healing for community wellbeing",
      "founded": "Pre-historical (estimated 30,000+ years old)",
      "founders": [
        "Indigenous cultures worldwide (no single founder)"
      ],
      "image": "",
      "figures": [
        {
          "name": "Mircea Eliade",
          "role": "Shamanism Scholar & Historian",
          "image": "",
          "popularity": 75,
          "significance": "Comparative religionist who extensively studied and documented shamanic traditions worldwide. His research brought shamanism to academic and Western spiritual attention.",
          "domain": "Comparative Religion, Shamanism, Anthropology",
          "history": "Lived 1907-1986 CE",
          "key_contributions": [
            "Scholarly study of shamanism",
            "Documentation of shamanic traditions"
          ],
          "practices": [
            "Academic research",
            "Comparative religion",
            "Anthropological study"
          ],
          "students": "Academic approach to shamanic studies",
          "legacy": "Legitimized shamanism as serious spiritual practice",
          "symbols": [
            "World Tree",
            "Sacred journey",
            "Axis Mundi"
          ]
        },
        {
          "name": "Don Juan Matus",
          "role": "Yaqui Shaman & Spiritual Teacher",
          "image": "",
          "popularity": 80,
          "significance": "Famous shaman whose teachings were documented by anthropologist Carlos Castaneda, popularizing shamanism in Western culture.",
          "domain": "Shamanism, Indigenous Spirituality, Spiritual Teaching",
          "history": "Lived early 1900s (exact dates disputed)",
          "key_contributions": [
            "Teachings on consciousness",
            "Warrior's path to freedom"
          ],
          "practices": [
            "Meditation",
            "Dreaming",
            "Perception shifting",
            "Shamanic journeying"
          ],
          "students": "Documented by Carlos Castaneda, influenced millions",
          "legacy": "Brought shamanic teachings to Western consciousness",
          "symbols": [
            "Eagle",
            "Smoke",
            "Dreams",
            "Power animals"
          ]
        }
      ],
      "shamansRoles": [
        "Healer - treating illness and spiritual imbalance",
        "Guide - conducting souls and spirits",
        "Counselor - providing wisdom and guidance",
        "Ritual leader - conducting ceremonies",
        "Keeper of traditions - preserving cultural knowledge",
        "Bridge - connecting physical and spiritual worlds"
      ],
      "practices": [
        "Trance and ecstatic states",
        "Drumming and rhythmic sounds",
        "Plant medicine ceremonies",
        "Soul retrieval",
        "Energy healing",
        "Spirit communication",
        "Vision quests",
        "Rituals and ceremonies"
      ],
      "coreConcepts": [
        "Spirit world",
        "Power animals",
        "Soul retrieval",
        "Healing",
        "Trance states",
        "Sacred space",
        "Communion with nature"
      ],
      "traditions": [
        "Siberian Shamanism",
        "Peruvian Shamanism",
        "Native American Shamanism",
        "African Shamanism",
        "Asian Shamanism",
        "Neo-shamanism"
      ],
      "followers": "Millions of indigenous practitioners plus growing Western neo-shamanic communities",
      "history": "Oldest spiritual practice, documented in cultures across Siberia, Americas, Africa, and Asia. Core practices unchanged for thousands of years; modern revival in Western spirituality",
      "overview": "Ancient spiritual practice found in indigenous cultures worldwide. Shamans act as healers, guides, and intermediaries with spiritual realm. Emphasizes trance, plant medicine, and communion with spirits.",
      "variations": [
        {
          "name": "Siberian Shamanism",
          "description": "Traditional form emphasizing drum journeys and spirit communication"
        },
        {
          "name": "Core Shamanism",
          "description": "Modern synthesized form accessible to contemporary practitioners"
        },
        {
          "name": "Curandismo",
          "description": "Latin American shamanic healing tradition"
        }
      ]
    },
    "kabbalah": {
      "name": "Kabbalah",
      "description": "Jewish mystical tradition exploring hidden meanings in sacred texts and cosmic structures for spiritual enlightenment and transformation",
      "founded": "c. 1200 CE (written form); oral traditions much older",
      "founders": [
        "Jewish mystics and rabbis",
        "Isaac Luria (Lurianic Kabbalah)"
      ],
      "image": "",
      "figures": [
        {
          "name": "Isaac Luria",
          "role": "Kabbalist & Mystic",
          "image": "",
          "popularity": 75,
          "significance": "16th century kabbalist who developed comprehensive kabbalistic system (Lurianic Kabbalah). His teachings revolutionized mystical Judaism.",
          "domain": "Kabbalah, Jewish Mysticism, Spirituality",
          "history": "Lived 1534-1572 CE",
          "key_contributions": [
            "Lurianic Kabbalah system",
            "Concept of tzimtzum (divine contraction)"
          ],
          "practices": [
            "Meditation on Hebrew letters",
            "Contemplation of Sephiroth",
            "Mystical prayer"
          ],
          "students": "Shaped Kabbalistic thought for centuries",
          "legacy": "Most influential Kabbalistic system",
          "symbols": [
            "Tree of Life",
            "Hebrew letters",
            "Sephiroth"
          ]
        },
        {
          "name": "Gershom Scholem",
          "role": "Kabbalah Scholar & Historian",
          "image": "",
          "popularity": 75,
          "significance": "Modern scholar who systematically studied and documented Kabbalah traditions, making them accessible to academic and Western audiences.",
          "domain": "Kabbalah, Jewish Studies, Mysticism",
          "history": "Lived 1897-1982 CE",
          "key_contributions": [
            "Academic study of Kabbalah",
            "Historical documentation"
          ],
          "practices": [
            "Scholarly research",
            "Historical analysis",
            "Comparative mysticism"
          ],
          "students": "Made Kabbalah academically legitimate",
          "legacy": "Brought Kabbalah into academic study",
          "symbols": [
            "Tree of Life",
            "Kabbalistic texts",
            "Mystical symbols"
          ]
        }
      ],
      "tenSephiroth": [
        "1. Keter (Crown) - Divine source",
        "2. Chokmah (Wisdom) - Creative force",
        "3. Binah (Understanding) - Receptive force",
        "4. Chesed (Mercy) - Expansion and blessing",
        "5. Gevurah (Severity) - Contraction and judgment",
        "6. Tiphareth (Beauty) - Center, consciousness, self",
        "7. Netzach (Victory) - Emotion and imagination",
        "8. Hod (Splendor) - Intellect and reason",
        "9. Yesod (Foundation) - Subconscious, dreams",
        "10. Malkuth (Kingdom) - Physical reality"
      ],
      "coreConcepts": [
        "Tree of Life",
        "Sephiroth",
        "Paths",
        "Divine names",
        "Mystical letters",
        "Gematria (numerology)",
        "Meditation"
      ],
      "practices": [
        "Tree of Life meditation",
        "Letter contemplation",
        "Visualization",
        "Mystical study",
        "Spiritual development"
      ],
      "traditions": [
        "Rabbinic Kabbalah",
        "Lurianic Kabbalah",
        "Hasidic Kabbalah",
        "Western Esotericism Kabbalah"
      ],
      "followers": "Millions of Jewish practitioners plus Western esoteric students",
      "history": "Rooted in ancient Jewish mysticism; formalized in medieval Spain; systematized by Luria in 16th century; integrated into Western occultism",
      "overview": "Jewish mystical tradition exploring divine nature and cosmic structure. Uses Tree of Life as spiritual map. Emphasizes meditation, Hebrew letter mysticism, and spiritual ascent.",
      "variations": [
        {
          "name": "Lurianic Kabbalah",
          "description": "Eastern Kabbalah emphasizing creation through divine contraction"
        },
        {
          "name": "Hermetic Kabbalah",
          "description": "Western Kabbalah combining Jewish mysticism with Western occultism"
        }
      ]
    },
    "wicca": {
      "name": "Wicca & Modern Witchcraft",
      "description": "Contemporary pagan spiritual practice honoring nature, divinity (often as goddess and god), and magic for healing and harmony",
      "founded": "1950s CE (modern Wicca)",
      "founders": [
        "Gerald Gardner (founder of Wicca)",
        "Doreen Valiente (Wiccan liturgy)"
      ],
      "image": "",
      "figures": [
        {
          "name": "Gerald Gardner",
          "role": "Founder of Modern Wicca",
          "image": "",
          "popularity": 80,
          "significance": "Created and popularized modern Wicca as organized religion in 1950s. Established core rituals, beliefs, and practices that define contemporary Wicca.",
          "domain": "Wicca, Witchcraft, Paganism, Spirituality",
          "history": "Lived 1884-1964 CE",
          "key_contributions": [
            "Founded modern Wicca",
            "Created Wiccan rituals and practices"
          ],
          "practices": [
            "Circle casting",
            "Ritual magic",
            "Goddess and God invocation",
            "Seasonal celebrations"
          ],
          "students": "All Wiccan practitioners follow his framework",
          "legacy": "Father of modern Wicca",
          "symbols": [
            "Pentacle",
            "Wand",
            "Cauldron",
            "Athame"
          ]
        },
        {
          "name": "Doreen Valiente",
          "role": "Wiccan Priestess & Ritual Creator",
          "image": "",
          "popularity": 78,
          "significance": "High priestess who created the iconic Charge of the Goddess, defining Wiccan theology and liturgy. Major influence on modern Wicca's spiritual foundation.",
          "domain": "Wicca, Goddess spirituality, Ritual magic",
          "history": "Lived 1922-1999 CE",
          "key_contributions": [
            "Created Charge of the Goddess",
            "Defined Wiccan theology"
          ],
          "practices": [
            "Goddess spirituality",
            "Priestess ordination",
            "Ritual leadership"
          ],
          "students": "Influenced Wiccan spiritual practice",
          "legacy": "Heart of Wiccan spirituality",
          "symbols": [
            "Goddess",
            "Moon",
            "Divine feminine"
          ]
        }
      ],
      "wiccaBeliefs": [
        "Reverence for nature and natural cycles",
        "Divinity as Goddess and God (or both)",
        "Magic through will and intention",
        "Harm to none (Wiccan Rede)",
        "Threefold law (actions return threefold)",
        "Seasonal festivals and sabbats",
        "Ritual and ceremony",
        "Personal spiritual experience"
      ],
      "practices": [
        "Casting circles",
        "Spell work and magic",
        "Ritual celebrations",
        "Meditation and visualization",
        "Herbalism and natural magic",
        "Divination",
        "Seasonal observances",
        "God/Goddess invocation"
      ],
      "sabbats": [
        "Samhain",
        "Yule",
        "Imbolc",
        "Beltane",
        "Lughnasadh",
        "Litha",
        "Mabon",
        "Ostara"
      ],
      "elements": [
        "Earth",
        "Air",
        "Fire",
        "Water",
        "Spirit"
      ],
      "coreConcepts": [
        "The Craft",
        "The Charge of the Goddess",
        "Circle casting",
        "Magical will",
        "Natural magic",
        "Goddess and God"
      ],
      "traditions": [
        "Gardnerian Wicca",
        "Alexandrian Wicca",
        "Dianic Wicca",
        "Eclectic Wicca"
      ],
      "followers": "500,000+ to 3+ million practitioners worldwide (estimates vary)",
      "history": "Emerged in 1950s England; rapidly spread globally; diverse traditions developed; combines witchcraft, paganism, and goddess spirituality",
      "overview": "Modern pagan spiritual movement celebrating nature, Goddess/God, and magic. Emphasizes seasonal cycles, personal power, and harm to none. Ritual-based practice honoring natural forces.",
      "variations": [
        {
          "name": "Gardnerian Wicca",
          "description": "Original tradition founded by Gerald Gardner with strict initiatory lineage"
        },
        {
          "name": "Alexandrian Wicca",
          "description": "Branch of Gardnerian Wicca with similar practices and initiatory structure"
        },
        {
          "name": "Eclectic Wicca",
          "description": "Modern non-initiatory form allowing personal interpretation and practice"
        }
      ]
    }
  }
}
